{
  "took": 106,
  "timed_out": false,
  "_shards": {
    "total": 1,
    "successful": 1,
    "skipped": 0,
    "failed": 0
  },
  "hits": {
    "total": {
      "value": 67,
      "relation": "eq"
    },
    "max_score": 27.746075,
    "hits": [
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ki_NAIUBmFo8GYv0boky",
        "_score": 27.746075,
        "title": "Lust, Caution",
        "year": 2007,
        "genders": [
          "Drama",
          "History",
          "Romance"
        ],
        "score": 7.5,
        "directors": [
          "Ang Lee"
        ],
        "writers": [
          "Eileen Chang",
          "James Schamus",
          "Hui-Ling Wang"
        ],
        "synopsis": [
          "Shanghai, 1942: The World War II Japanese occupation of this Chinese city continues in force. Mrs. Mak, a woman of sophistication and means, walks into a café, places a call, and then sits and waits. She remembers how her story began several years earlier, in 1938 China. She is not in fact Mrs. Mak, but shy Wong Chia Chi (Tang Wei). With WW II underway, Wong has been left behind by her father, who has escaped to England. As a freshman at university, she meets fellow student Kuang Yu Min (Wang Leehom) Kuang has started a drama society to shore up patriotism. As the theater troupes new leading lady, Wong realizes that she has found her calling, able to move and inspire audiences and Kuang.He convenes a core group of students to carry out a radical and ambitious plan to assassinate a top Japanese collaborator, Mr. Yee (Tony Leung). Each student has a part to play; Wong will be Mrs. Mak, who will gain Yees trust by befriending his wife (Joan Chen) and then draw the man into an affair. Wong transforms herself utterly inside and out, and the scenario proceeds as scripted until an unexpectedly fatal twist spurs her to flee.Shanghai, 1941: With no end in sight for the occupation, Wong--having emigrated from Hong Kong--goes through the motions of her existence. Much to her surprise, Kuang re-enters her life. Now part of the organized resistance, he enlists her to again become Mrs. Mak in a revival of the plot to kill Yee, who as head of the collaborationist secret service has become even more a key part of the puppet government. As Wong reprises her earlier role, and is drawn ever closer to her dangerous prey, she finds her very identity being pushed to the limit..."
        ],
        "summaries": [
          "During World War II era, a young woman, Wang Jiazhi, gets swept up in a dangerous game of emotional intrigue with a powerful political figure, Mr. Yee.",
          "Frustrated in his attempts to assassinate Yee, who is an important official in Japanese-ruled Shanghai, Old Wu, who has lost his wife and two sons as well as two women who had attempted to seduce Yee, now recruits Kuang, Mai Tai Tai, and their troupe of drama students from Hong Kong University in yet another attempt to do away with Yee. Mai Tai Tai is chosen to befriend Yee, which she does by posing as the wife of Mak, befriending Yee's wife and her female friends, and then eventually befriending Yee himself. Even though both get together, they do end up going separate ways, only to meet again four years later. This time Mai is all set to entrap Yee at Chandni Chowk Jewellers which is owned by an East Indian man named Khalid Saiduddin. The question does remain: Will she and her troupe succeed?",
          "Naive Wong Chia Chi is a college student in 1938 Hong Kong, to where many mainland Chinese have escaped from the bloodshed of the Sino-Japanese War. Her widowed father, abandoning her in China, escapes himself to England with her younger brother. On campus, she innocently gets involved with the politically active theater troupe led by Kuang Yu Min. Their plays protest the war, with Yu Min's stance particularly against any Chinese who collaborates with the Japanese. The productions' primary goal is to raise money for the resistance. Many Chinese do collaborate with the Japanese in part to maintain their upper class lifestyle. No longer solely content to hear the chants of \"China will not fall\" from their anti-Japanese audiences, Yu Min wants to venture into more direct activism by killing one of those collaborating with the Japanese, namely a Shanghai bigwig hiding out in Hong Kong named Mr. Yee to who they can get access through an old friend of Yu Min's. Despite all of them realizing that they know nothing about killing or espionage, they all agree. The expensive plot, funded by wealthy troupe member Liang Jun Sheng, involves Chia Chi acting as Mrs. Mak, the wife of a wealthy businessman, played by her fellow actor, Auyang Ling Wen. Although not originally the plan, Chia Chi becomes the center of the plot as she is the one who captures the attention of both Mr. and Mrs. Yee. The final act becomes more and more difficult to execute due to Mr. Yee's extremely cautious nature and despite his overwhelming evident lust for Mrs. Mak. The plot, which eventually involves those in the resistance who may have more expertise in espionage and killing, which moves to Shanghai and which covers the span of four years, changes Chia Chi fundamentally as a person, especially due to her developing love/hate relationship with Mr. Yee.",
          "Shanghai, 1942. The World War II Japanese occupation of this Chinese city continues in force. Mrs. Mak, a woman of sophistication and means, walks into a café, places a call, and then sits and waits. She remembers how her story began several years earlier, in 1938 China. She is not in fact Mrs. Mak, but shy Wong Chia Chi. With WWII underway, Wong has been left behind by her father, who has escaped to England. As a freshman at university, she meets fellow student Kuang Yu Min. Kuang has started a drama society to shore up patriotism. As the theater troupe's new leading lady, Wong realizes that she has found her calling, able to move and inspire audiences and Kuang. He convenes a core group of students to carry out a radical and ambitious plan to assassinate a top Japanese collaborator, Mr. Yee. Each student has a part to play; Wong will be Mrs. Mak, who will gain Yees' trust by befriending his wife and then draw the man into an affair. Wong transforms herself utterly inside and out, and the scenario proceeds as scripted until an unexpectedly fatal twist spurs her to flee. Shanghai, 1941. With no end in sight for the occupation, Wong having emigrated from Hong Kong goes through the motions of her existence. Much to her surprise, Kuang re-enters her life. Now part of the organized resistance, he enlists her to again become Mrs. Mak in a revival of the plot to kill Yee, who as head of the collaborationist secret service has become even more a key part of the puppet government. As Wong reprises her earlier role, and is drawn ever closer to her dangerous prey, she finds her very identity being pushed to the limit...",
          "During the World War II, in the Japanese-occupied Shanghai a students drama troupe plan to kill a Japanese-supported official, Mr. Yee. For the job, the shy girl but the leading lady of the group, who has the power to convulse the audience, Wong Chia Chi, is chosen. But she is willing for the leader of the troupe Kuang Yu Min. She has to be disguised as Mrs. Mak and has to earn the trust of Mrs. Yee. Then what she had to do is to get into the heart of Mr. Yee."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "GC_NAIUBmFo8GYv0bnot",
        "_score": 21.124485,
        "title": "For a Lost Soldier",
        "year": 1992,
        "genders": [
          "Drama",
          "Romance",
          "War"
        ],
        "score": 7.6,
        "directors": [
          "Roeland Kerbosch"
        ],
        "writers": [
          "Don Bloch",
          "Rudi van Dantzig",
          "Roeland Kerbosch"
        ],
        "synopsis": [],
        "summaries": [
          "Set in The Netherlands at the end of WW II, this touching story, told in flashbacks, explores the complex and romantic relationship between an adult soldier and a displaced, lonely adolescent boy.",
          "The story of a romantic relationship between a grown-up and a child. Set in the Netherlands near the end of WWII, the film is a flashback recalling an adolescent relationship between Jeroen and a Canadian soldier. A difficult subject handled with style and feeling."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Si_NAIUBmFo8GYv0bnot",
        "_score": 19.399014,
        "title": "Delta of Venus",
        "year": 1995,
        "genders": [
          "Drama"
        ],
        "score": 4.7,
        "directors": [
          "Zalman King"
        ],
        "writers": [
          "Anaïs Nin",
          "Elisa M. Rothstein",
          "Patricia Louisianna Knop"
        ],
        "synopsis": [
          "Delta of Venus is the sultry adventure of Elena Martin (Audie England), a young female American writer in Paris during the dawn of WWII. All of the stories Elena writes involves her as the star of her own erotic adventures which are secretly contracted by her lover, Lawrence Walters (Costas Mandylor) from a distance. Once this truth is revealed to Elena, her reaction is strong and she transforms from a sexually innocent and unfeeling girl, to a woman who feels everything. She rejects her lover as she leaves Paris to return to America once France is invaded."
        ],
        "summaries": [
          "A struggling American writer (England) and a fellow American expatriate (Mandylor) begin a sordid affair among the chaos and discord of 1940 Paris, France on the brink of World War II.",
          "An American writer in Paris starts writing erotic fiction. From encouragement from her friends, her lover, and her publisher she gets involved in nude modeling and progresses onward through many other forms of voyeuristic and participatory sexual adventures. Contains full frontal nudity and simulated sex, lots of sexual dialogue and profanity."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "fi_NAIUBmFo8GYv0boMw",
        "_score": 18.836826,
        "title": "The Great Raid",
        "year": 2005,
        "genders": [
          "Action",
          "Drama",
          "War"
        ],
        "score": 6.6,
        "directors": [
          "John Dahl"
        ],
        "writers": [
          "William B. Breuer",
          "Hampton Sides",
          "Carlo Bernard"
        ],
        "synopsis": [
          "In the winter of 1944, World War II was coming to a close. The Japanese held some of the American prisoners who had survived the Bataan Death March in a notorious POW camp at Cabanatuan and subjected them to harsh treatment; many prisoners were also stricken with malaria. At the time of the raid the camp held about 500 prisoners.The film opens with the massacre of prisoners of war on Palawan by the Kempeitai, the Imperial Japanese military's secret police.Meanwhile at Lingayen Gulf, the 6th Ranger Battalion under Lt. Col Mucci is ordered by Lt. Gen. Walter Krueger to liberate all of the POWs at Cabanatuan prison camp before they are killed by the Japanese. The film chronicles the efforts of the Rangers, Alamo Scouts from the 6th Army and Filipino guerrillas as they undertake the Raid at Cabanatuan.Throughout the film, the viewpoint switches between the POWs at Cabanatuan, the Rangers, the Filipino resistance and the Japanese.In particular, the film covers the resistance work undertaken by nurse Margaret Utinsky, who smuggled medicine into the POW camps. The Kempeitai arrested her and sent her to Fort Santiago prison. She was eventually released, but spent six weeks recovering from gangrene as a result of injuries sustained from beatings. Once recovered, she escaped to Bataan, where she served as a nurse with the Philippine Commonwealth troops and recognized guerrilla units until liberation in February 1945.(Source: Wikipedia)"
        ],
        "summaries": [
          "Taking place towards the end of WWII, 500 American Soldiers have been entrapped in a camp for 3 years. Beginning to give up hope they will ever be rescued, a group of Rangers goes on a dangerous mission to try and save them.",
          "Set in the Philippines in 1945 towards the end of WWII, under the command of Lieutenant Colonel Henry Mucci and Captain Robert Prince, the 6th Ranger Battalion undertake a daring rescue mission against all odds. Traveling thirty miles behind enemy lines, they intend to liberate over 500 American Soldiers from the notorious Cabanatuan Japanese POW camp in the most audacious rescue ever."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "py_NAIUBmFo8GYv0bosz",
        "_score": 17.275501,
        "title": "Anonyma - Eine Frau in Berlin",
        "year": 2008,
        "genders": [
          "Biography",
          "Drama",
          "History"
        ],
        "score": 7,
        "directors": [
          "Max Färberböck"
        ],
        "writers": [
          "Max Färberböck",
          "Marta Hillers",
          "Catharina Schuchmann"
        ],
        "synopsis": [
          "CONTAINS SPOLIERS This is a real diary from a real woman. The woman cast in this film is too young too play the real woman. The diary was written by a woman in the basement of her bombed out building during the invasion of Berlin by The Red Army in the last months of WWII. It details the way German women survived the rapes the Red Army officers felt they deserved in victory. Anonymous uses one soldier to her advantage and essentially considers him her lover not her rapist. Her real fiancé returns from the front only to spurn her for being raped. The inginuity of the survival techniques used by the Berliners of this time round out Anon's tale. The diary should be read by every priveleged person, man or woman. Americans especially. War is no place for socialites.Regarding the age of the author vs. the actress; the author was 34 when writing the diary. Nina Hoss 33 at the time of filming. Great book.\nIn this movie appears Juliane Köhler who will later play the role of Clara, Fritz Shimon Haber's wife in Haber (2008)."
        ],
        "summaries": [
          "A woman tries to survive the invasion of Berlin by the Soviet troops during the last days of World War II.",
          "A nameless woman keeps a diary as the Russians invade Berlin in the spring of 1945. She is in her early 30s, a patriotic journalist with international credentials; her husband, Gerd, a writer, is an officer at the Russian front. She speaks Russian and, for a day or two after the invasion, keeps herself safe, but then the rapes begin. She resolves to control her fate and invites the attentions of a Russian major, Andreij Rybkin. He becomes her protector of sorts subject to pressures from his own fellow soldiers and officers. Dramas play out in the block of flats where she lives. Is she an amoral traitor? She asks, \"How do we go on living?\" And what of Gerd and her diary?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "-i_NAIUBmFo8GYv0bo00",
        "_score": 16.554192,
        "title": "Dead Snow",
        "year": 2009,
        "genders": [
          "Comedy",
          "Fantasy",
          "Horror"
        ],
        "score": 6.3,
        "directors": [
          "Tommy Wirkola"
        ],
        "writers": [
          "Tommy Wirkola",
          "Stig Frode Henriksen"
        ],
        "synopsis": [
          "The movie opens with a woman (Ane Dahl Torp) being chased through the snows of Norway. She is finally cornered and eaten by zombies in World War II German uniforms.The movie then moves to seven medical students on Easter vacation. They arrive at a small cabin near Øksfjord, about a 45-minute walk from the road where they have left their cars. The cabin is owned by Sara, another student who is the girlfriend of Vegard (Lasse Valdal), the student in the main group with the most knowledge of the wilderness. She has been skiing across the mountains to meet them, but has not yet arrived.They drink and party until a mysterious hiker (Bjørn Sundquist) arrives. He tells them the dark history of the region; during World War II, a force of Einsatzgruppen led by the dreaded Standartenführer Herzog occupied the area. During three long years the Nazis abused and tortured the local people, and near the end of the war, with Germany's defeat looming, looted all their valuables before starting to withdraw from the area. The citizens managed to stage an uprising and ambushed the Nazis, killing many. The surviving Nazis, including Herzog, were chased into the mountains, and it was assumed that they all froze to death. The hiker says the area still has an evil reputation. He leaves to continue on his way. Later the hiker is murdered by zombies while camped in the snow.The next morning Sara has still not arrived and Vegard takes the group's snowmobile to look for her. He finds the body of the hiker in his tent, but then falls through snow into a cave below.The other students find an old wooden box filled with valuables and German decorations hidden under the floor. They consider taking and selling it, but eventually put it back, although some of them keep items. After it gets dark, one of the students, Chris (Jenny Skavlan), goes to the outhouse, but is murdered while on the toilet. The others go outside to look for her; they do not find her, but do find Sara's rucksack buried in the snow.A little later, Chris's severed head appears at the window - the zombies have arrived. Erlend (Jeppe Laursen) is murdered before the remaining students manage to seal the cabin windows and door and survive the night.The following morning, Vegard comes round in the cave. He discovers World War II German firearms and helmets and a swastika flag, as well as Sara's severed head; she was the woman being pursued at the beginning of the film. He is attacked by zombies, but manages to escape from the cave. He is badly bitten in the neck by one zombie, but manages to escape on the snowmobile, which he equips with an MG 34 machine gun.Meanwhile, the remaining four students in the cabin have decided to split up. The two men, Martin (Vegar Hoel) and Roy (Stig Frode Henriksen), attempt to distract the zombies, while the two women, Hanna (Charlotte Frogner) and Liv (Evy Kasseth Røsten), run for the cars and go for help. Martin and Roy hole up in the cabin, but then accidentally set fire to it with molotov cocktails. They then discover that the shed next to the cabin contains a chainsaw, hammers and axes and equip themselves.The main group of zombies attacks. Martin and Roy manage to fight them off, aided by Vegard, who returns on the snowmobile. Vegard is killed during the fighting however and Martin accidentally kills his girlfriend Hanna with his hatchet, who has not managed to reach the cars (Liv has already been killed by the zombies). Herzog (Ørjan Gamst) arrives with another group of zombies, including SS men, but Martin and Roy also manage to fight them off. Martin is bitten on the arm and cuts it off with the chainsaw to avoid turning into a zombie. Herzog then raises many other zombies from all around and the two students run. Roy falls and is killed.Martin finally realises that the zombies are after their loot and runs to the burnt-out remains of the cabin. He gives the box of loot to Herzog and runs for the cars. The zombies do not appear to follow him. However, on reaching the car, a coin falls out of Martin's pocket. Swearing, he looks round to see Herzog smashing the car window."
        ],
        "summaries": [
          "A ski vacation turns horrific for a group of medical students, as they find themselves confronted by an unimaginable menace: Nazi zombies.",
          "Several friends take to the mountains and shack-up in the wilderness of back-of-beyond to enjoy a little R and R together. Their peace is soon interrupted by a mysterious old man who informs them that during WWII, Nazi invaders of the area were brutal and harsh in their methods of control until, according to a legend, a villager's revolt drove the invaders up into the cold, dark mountains, where they perished. But now there's the rumor that they returned in the form of zombies --evil Nazi zombies.",
          "The medical students Martin, Roy and Erlend travel with their friend Vegard to meet with the girls Hanna, Liv and Chris and spend vacation in the isolated cabin in the wilderness of Øksfjord that belongs to Vegard's girlfriend Sara. When they arrive, they do not find Sara but they believe she is practicing sports on the snow. Soon a weird traveler visits them and tells the story about the resistance of the locals during the World War II against the Nazi invaders that were pursued and assumed frozen to death. On the next morning, Vegard drives his snowmobile seeking out Sara in the mountains. Meanwhile his friends are attacked by a Nazi zombie army led by the evil Commander Herzog and they have to fight to survive. Will they succeed in their intent?",
          "To blow off steam, a team of medical school students take a ski vacation to a weather-battered cabin atop a remote, snow-capped peak in the Norwegian Lyngen Alps. However, when the unsuspecting group accidentally unearths the mountains' shocking secret, the dark past of the isolated village comes to life, giving birth to a long-forgotten terror: an unstoppable, undead, and hungry-for-flesh Waffen-SS infantry squad. And as the resurrected Nazis pick up where they left off, innocents start dying left and right, and warm, bright-red blood stains the deep, white snow. Do the young invaders have what it takes to survive the Nazi zombies' blitzkrieg?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Qy_NAIUBmFo8GYv0bpM2",
        "_score": 15.599198,
        "title": "Frankenstein's Army",
        "year": 2013,
        "genders": [
          "Horror",
          "Sci-Fi"
        ],
        "score": 5.3,
        "directors": [
          "Richard Raaphorst"
        ],
        "writers": [
          "Richard Raaphorst",
          "Miguel Tejada-Flores",
          "Chris W. Mitchell"
        ],
        "synopsis": [],
        "summaries": [
          "In the dying days of WWII, a battalion of Russian soldiers is lured into the secret lab of a deranged scientist and forced to face off against an army of horrific flesh-and-metal war machines.",
          "Toward the end of World War II, Russian soldiers pushing into eastern Germany stumble across a secret Nazi lab, one that has unearthed and begun experimenting with the journal of one Dr. Victor Frankenstein. The scientists have used the legendary Frankenstein's work to assemble an army of super-soldiers stitched together from the body parts of their fallen comrades -- a desperate Hitler's last ghastly ploy to escape defeat.",
          "During the World War II, a Russian troop in Germany receives a distress call in the radio from a group of Russian soldiers under siege by the Germans with the respective coordinates. The leader Sergeant Novikov decides to seek out the soldiers through the countryside of Germany. The soldier Dimitri is filming the troop to make a documentary and while they walk, they find weird bodies, slaughtered nuns in a convent burnt to the ground and open graves in a cemetery. They arrive at a deserted church where they meet a lethal army of undead with implanted weapons and tools. Soon they learn that the deranged but brilliant grandson of Dr. Viktor Frankenstein with the same name has a secret laboratory in the church and is responsible for those monstrosities. Further, they discover that their troop has been secretly assigned by the government to find and kill or bring the mad scientist to Moscow.",
          "In the waning days of World War II, Dimitri, a Red Army documentarian, and a small team of brothers-in-arms come across a bizarre Nazi laboratory run by the mad scientist Viktor: a direct descendant of the notorious Dr Frankenstein. But, there, in the dark dungeon rife with abominable, flesh-and-metal hybrids, no one is safe. Is there an escape from Adolf Hitler's plan for world domination and the deadly Zom-bot trap?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "qC_NAIUBmFo8GYv0bnwu",
        "_score": 15.1220455,
        "title": "The Long Way Home",
        "year": 1997,
        "genders": [
          "Documentary",
          "History",
          "War"
        ],
        "score": 7.6,
        "directors": [
          "Mark Jonathan Harris"
        ],
        "writers": [
          "Mark Jonathan Harris"
        ],
        "synopsis": [],
        "summaries": [
          "The story of the post World War II Jewish refugee situation from liberation to the establishment of the modern state of Israel.",
          "After WWII, Jewish Holocaust survivors are moved into Displaced Persons' camps. After delays, more physical hardship, and years of uncertainty, they are permitted to begin new lives in Israel and the U.S.",
          "At the end of World War II, Holocaust survivors are freed from Nazi internment camps. For many of them, the joy quickly turns to despair, as most have no families and nowhere to go. Because of quotas imposed by the British, thousands are unable to legally immigrate to Palestine. Many are put into displaced persons camps to await relocation. Meanwhile, the world powers work toward the creation of Israel as a homeland for all Jews. Morgan Freeman narrates this moving documentary.",
          "This documentary reports events for European Jews from the fall of the Third Reich in 1945 to the formation of the state of Israel in 1948, arguing that creating the Israeli state was necessary given the nature of post-war Europe for these survivors. We see death in concentration camps after liberation, from disease or even from eating too much. We learn of pogroms murdering those who return home. We see the squalor of displaced persons camps. Facing strict British immigration limits into Palestine, many sought passage illegally, often ending up in locked camps in Cyprus. Against this backdrop, Jews in Palestine, Truman in the White House, and UN delegates debate Israel's formation."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "9C_NAIUBmFo8GYv0boAv",
        "_score": 15.051197,
        "title": "Windtalkers",
        "year": 2002,
        "genders": [
          "Action",
          "Drama",
          "War"
        ],
        "score": 6.1,
        "directors": [
          "John Woo"
        ],
        "writers": [
          "John Rice",
          "Joe Batteer"
        ],
        "synopsis": [],
        "summaries": [
          "Two U.S. Marines in World War II are assigned to protect Navajo Marines, who use their native language as an unbreakable radio cypher.",
          "During World War II when the Americans needed to find a secure method of communicating they devised a code using the Navajo language. So Navajos were recruited to become what they call code talkers. They would be assigned to a unit and would communicate with other units using the code so that even though the enemy could listen they couldn't understand what they were saying. And to insure that the code is protected men are assigned to protect it at all costs. One of these men is Joe Enders, a man who sustained an injury that can make him unfit for duty but he manages to avoid it and is told of his duty and that the man he is suppose to protect is Ben Yahzee. Initially there is tension but the two men learn to get along.",
          "WWII. Joe Enders, a decorated Marine who is by-the-book to a fault, is just coming back on duty (by cheating on his medical tests). \"Ox\" Anderson, much greener, is also getting the same new task: Protect the Navajo codetalkers (Ben Yahzee and Charles Whitehorse, respectively). While Enders is initially frustrated with his assignment, his respect grows as the codetalkers prove their worth in the brutal battle to take Saipan.",
          "In the close quarters and brutal fighting of the World War II Pacific Theater, the U.S. Intelligence services desperately seek a fool-proof encryption code, immune to the code breakers of the Japanese. The answer is soon discovered in the ancient language of the Navajo. Enlisted into the Marine Corps are several \"Windtalkers\" who are deployed to frontline areas in the Pacific, to use their language as an impossible-to-crack secret code. A drawback, however, is that the U.S. military soon puts forth a directive that the Windtalkers must never be captured alive by the enemy, so additional Marines are assigned to make certain that this directive is carried out to the letter."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "3y_NAIUBmFo8GYv0boky",
        "_score": 14.665382,
        "title": "An American Girl on the Home Front",
        "year": 2006,
        "genders": [
          "Drama",
          "Family",
          "War"
        ],
        "score": 6.7,
        "directors": [
          "Joyce Chopra"
        ],
        "writers": [
          "Anna Sandor",
          "Valerie Tripp"
        ],
        "synopsis": [],
        "summaries": [
          "Molly is a girl living in the year 1943 and WWII has brought many changes to Molly's life. An English girl comes to live with Molly's family to escape the bombings. They slowly become good friends.",
          "Based on several of the \"Molly; An American Girl\" books, this story is set in 1943 in the fictional town of Jefferson, Illinois during World War II. Molly McIntire and her family are learning to cope with the changes the war has brought to their close-knit family. Molly misses her father who went overseas to care for the wounded soldiers. As they try to keep things running smoothly, Molly enters a dance contest at school. She and her friends are lively, outgoing and always bursting with ideas. Also during this time a young girl named Emily comes from London England to live with the family and Molly learns the importance of getting along and pulling together."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Ci_NAIUBmFo8GYv0bpM2",
        "_score": 14.43819,
        "title": "Into the White",
        "year": 2012,
        "genders": [
          "Action",
          "Biography",
          "Drama"
        ],
        "score": 7.1,
        "directors": [
          "Petter Næss"
        ],
        "writers": [
          "Ole Meldgaard",
          "Dave Mango",
          "Petter Næss"
        ],
        "synopsis": [],
        "summaries": [
          "Norway, WWII: A group of British and German soldiers find themselves stranded in the wilderness after an aircraft battle. Finding shelter in the same cabin, they realize the only way to survive the winter is to place the rules of war aside.",
          "In World War II, the German pilots Lieutenant Horst Schopis, Josef Schwartz and Wolfgang Strunk crash their airplane in the wilderness of Norway after shooting down a British airplane. They walk through a snow storm until they reach shelter in an abandoned hunter cabin. Soon the British pilot Captain Charles P. Davenport and the gunner Robert Smith arrive in the cabin and they become prisoners of the German pilots. However, after the initial friction between the enemies, they realize that they should team-up to survive in the wilderness in the beginning of an improbable friendship.",
          "At the beginning of World War II, a hostile chance encounter in the skies above the harsh Norwegian wilderness leaves two aircraft - one British, one German - shot down in a remote and isolated region. By strange coincidence the crews seek shelter in the same cabin. They must battle to survive the brutal winter in order to get back to the war - and to fighting one another. Although war has made them enemies, as the days go by animosity proves hard to maintain. Mutual need leads to unlikely friendships, and the rules of war must be put aside.",
          "High above the harsh Norwegian wilderness, English and German pilots shoot each other to the ground after a violent chance encounter. Isolated, they must fight to survive the brutal winter. Though war has made them enemies, antagonism is hard to maintain as days go by. Through mutual need, unlikely friendships bloom. Somehow, they become comrades."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Ey_NAIUBmFo8GYv0bnQr",
        "_score": 13.979271,
        "title": "The Last Flight of Noah's Ark",
        "year": 1980,
        "genders": [
          "Adventure",
          "Family"
        ],
        "score": 5.7,
        "directors": [
          "Charles Jarrott"
        ],
        "writers": [
          "Ernest K. Gann",
          "Steven W. Carabatsos",
          "Sandy Glass"
        ],
        "synopsis": [
          "Pilot Noah Dugan is sleeping when two creditors burst in and threaten him. They tell him he has 24 hours to come up with $5,000 and a week to come up with an unspecified remainder. They rough him up and leave.Dugan goes out looking for work, but nobody will hire him. In desperation, he goes to a friend, Stoney, who tells him about a cargo run. Dugan asks what kind of plane. Stoney is evasive at first, then finally shows him the plane -- an old B-29 into which animals are being loaded. Dugan refuses, saying animals and planes don't mix. Trying to convince Dugan to fly the run, Stoney introduces him to Bernadette LaFleur, a missionary with an orphanage who is taking the animals to a remote tropical island, where she plans to show the natives how to raise them. Bernadette asks how soon they can leave. Dugan says never, and tells her to get her money back from Stoney -- fast. Stoney says the money is gone. Bernadette threatens to take the matter to the police if necessary.Dugan finally tells Stoney he'll take the run if he gets a certified check for $3,000 in Honolulu. As Dugan explores the plane, Petey, a duck belonging to Julie, one of the orphans, escapes to the back of the plane. Dugan goes after him and ends up dropping out the back. Seeing the plane's condition, Dugan heads off, but stops short when he sees the creditors drive up. Saying he'll fly the cargo run, Dugan asks Stoney to stall them.The kids load the rest of the animals, among them a bull, Brutus. Dugan has trouble getting Brutus on the plane until Bobby, another of the kids, coaxes him on board. Dugan has the kids leave, while Julie and Bobby stay behind to say goodbye to Petey and Brutus, respectively. Evading the creditors, Dugan packs his bags. Bernadette says goodbye to Julie and Bobby and she and Dugan head for the plane. Once on board, Dugan starts the engines. Uneasy about how Dugan will treat the animals, Bobby sneaks on board. Julie follows him.As Dugan takes off, he lights a cigar while Bernadette plays classical music in a tape player. Dugan complains about the music, and Bernadette, who he calls \"Bernie,\" says she'll let stop playing the music if he stops smoking. Dugan reluctantly agrees, then discovers that the plane's autopilot isn't working. Bernie offers to help, but Dugan is doubtful since her experience is limited to a few hours flying a Cessna. As soon as she takes control, however, the plane pitches nose down. Just then, Petey comes out, followed by the kids. Dugan goes back with the kids to check on the animals, but is knocked unconscious when Brutus kicks him.The kids report the problem to Bernie, but just then Dugan returns. He settles in to fly the plane through the rest of the night while the kids sleep in the back. The next morning, Bernie and Dugan see the sunrise off the left wing, not behind them as expected. Dugan checks the instruments, which indicate that they're still on the heading he wanted to fly. When he removes Bernie's tape player, however, he discovers that the player had affected the compass and they're now off course. He says they'll have to go as far as they can before they run out of fuel. Bernie asks if they can turn back, but Dugan says they've gone too far.As the engines begin to flame out, Bobby spots an island off to the left. The engines die out completely just before they reach the island, forcing Dugan to ditch in the water, with the plane coming to a sudden stop on the beach. Dugan and Bernie build a corral out of the vegetation and move the animals from the plane into the corral. Meanwhile, two Japanese sailors, who noticed the plane when it crashed, begin making plans to intercept the new arrivals.As Bobby leads Brutus to the corral, he suddenly runs off. Bobby and Julie chase after him, finally catching up to him near a river. When they make their way back, they see the Japanese sailors' hut and tell Dugan and Bernie. Dugan says the hut must have been a World War II military outpost. Bernie says the sailors look like they're still dressed for the war. Dugan says they may not have heard that it ended. Bernie suggests going down and talking to them, but Dugan vetoes the idea, saying they should go back to the plane instead.Back in the plane, the group sees the two sailors come out. The sailors demand that the group surrender, but both their rifles malfunction and a grenade that one of them throws turns out to be a dud. Dugan, Bernie, Bobby, and Julie chase them back into the underbrush. Bernie says she still wants to make friends with them, but Dugan still doesn't trust them.As Julie and Bobby prepare for bed, Julie says that Dugan was brave, but Bobby says he still doesn't like him. Bernie goes to relieve Dugan, apologizing for her behavior. Dugan also apologizes. Bernie says she'd like for them to try to get along better.The next morning, Bernie is nowhere to be found, so Dugan goes after her while the kids go swimming. Bernie makes her way to the sailors' camp, finding it empty. As she explores their hut, they return. She tells them that World War II is over. They settle down and prepare a meal, which they share with her. Meanwhile, Dugan comes across the compound. When he overhears Bernie saying, \"No more, I've had enough,\" and hears the soldiers laughing, he charges the hut, breaking a wall and upsetting the meal. The soldiers attack Dugan, but Bernie shouts at them to stop. She introduces her friends to Dugan as Commander Hiro and Cleveland from the Japanese Navy. Cleveland, who is fluent in English, says that his mom visited the United States in 1924 and her favorite city was Cleveland, his namesake. Bernie says the sailors have been stranded on the island for 35 years.As Bernie and Dugan make their way back to the plane, he lectures her for leaving. Later that night, while the kids are sleeping, he tries to apologize to her. When she doesn't listen, he asks more forcefully and they go outside to talk. Meanwhile, not having actually fallen asleep, Bobby and Julie sneak to the front of the plane and overhear them talking. Dugan tells Bernie he cares about her and they share a kiss. Bobby asks Julie how Bernie can like Dugan, and she says Dugan is really nice. Bobby remains unconvinced.The next day, the sailors see the group attempting to drag a rubber fuel tank from the plane. Cleveland says the tank will make a lousy raft, and Hiro comes up with an idea to use the plane as a boat. Bobby likes the idea, but Dugan has his doubts. Cleveland asks him if he plans to stay until someone finds him, and he says he will, even if it's a couple of days or weeks. Cleveland then asks him, \"How about 35 years?\"With the sailors' help, Dugan, Bernie, Bobby, and Julie change the plane into a boat. Bernie works on a sail, but when she asks for a large piece of cloth to put in the center, the sailors offer their Japanese flag. Bernie adds the flag at the top.Bobby and Julie start to load the animals, but Dugan says they can't bring them on board. This angers Bobby, who says that Julie kept saying that Dugan was nice, but his refusal to board the animals now proves otherwise. Julie gets upset, and Dugan finally relents, allowing the animals to be loaded. Walking around to the other side of the plane, Dugan sees Bernie painting the name \"Noah's Ark\" on the side and tells her he hates the name \"Noah,\" but says that otherwise the name is fine.As the group prepares to depart the island, they can't find any sign of Cleveland or Hiro. When they can't wait any longer, they launch the boat, but just as they get into the water Cleveland and Hiro appear on the beach. They jump in the water and swim toward the boat. Dugan asks Cleveland and Hiro why they were late. Just then, they see several explosions on the hillside -- following orders they were given during the war, the sailors made sure they left nothing when they departed.The group sails toward Hawaii. As they sail, Bernie gets an idea about sending a message. Dugan ties a note to Petey and sends him off, but the duck heads in the wrong direction. Cleveland suggests they try fishing, but he and Hiro are unable to catch anything. Meanwhile, Brutus refuses to eat. Bobby tries to give him some milk, but Dugan stops him, saying the milk is their food supply and he doesn't want it being used to feed the animals. Annoyed, Bobby takes his milk ration and gives it to Brutus.That night, Bobby gets an idea to use a lantern to draw fish -- something he and a friend would do at the orphanage. The light draws the fish, but it also draws a shark, which scares the fish away. Using the last of their caught fish, Dugan, Hiro, and Cleveland go after the shark, but it gets away. Wanting to get a closer look, Bobby gets too close to the edge, slips, and falls in the water. Dugan jumps in after him and barely manages to get him back on board before the shark returns. As Dugan jumps on board, Bernie fires a gun at the shark, killing it. Bobby thanks Dugan for saving his life, but Dugan berates him, saying he nearly got both of them killed. Dugan orders Cleveland to take Bobby downstairs and get him changed.Below deck, Dugan asks the rest of the group to leave him and Bobby alone. He apologizes to Bobby. Bobby also apologizes for his behavior, and they agree to be friends.The next day, a storm hits, destroying part of the wooden decks on the boat but leaving it otherwise intact. After the storm clears, Brutus, who has fallen down, is lying on his side. Bobby asks if Brutus can be saved, but Bernie says there's nothing that can be done. Dugan pulls out a gun to put Brutus out of his misery, but Bobby refuses to let him be shot. Dugan asks Bobby what his dad would have done. Bobby says his dad left him at the orphanage and didn't care. Dugan says that now Bobby is surrounded by people who *do* care. Hiro takes the gun from Dugan, sits down next to Bobby, and gently talks to him in Japanese. Resigned to Brutus' fate, Bobby says a tearful goodbye to him, then nods to Hiro.As Hiro prepares to shoot Brutus, the group hears a whistle from a Coast Guard cutter, which has located them. As the cutter tows them toward shore, Brutus is shown to have fully recovered, while Dugan marries Bernie and they hug the kids."
        ],
        "summaries": [
          "When a plane carrying various animals makes a forced landing on a desert island, the only chance to escape is to convert the plane into a boat.",
          "When Noah Dugan agrees to fly missionary Bernadette Lafleur and her cargo of animals to a remote island, its only because he is on the run from a couple of bookies. What neither of them know is that two of Miss Lafleur's young students have stowed away with the animals & Miss Lafleur's transistor radio has interfered with the plane's instruments and they're all now miles off course. After a forced landing on a remote island, Dugan, Bernadette, Bobby and Julie discover that they are not alone. Together with two Japanese soldiers who have been stranded on the island since WWII, they must turn the plane into a seaworthy boat if they are ever to make it home. When Bobby and Julie insist that they cannot leave the animals behind, the converted plane truly becomes a second Noah's Ark"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Yi_NAIUBmFo8GYv0bo40",
        "_score": 13.449972,
        "title": "Gangster Squad",
        "year": 2013,
        "genders": [
          "Action",
          "Crime",
          "Drama"
        ],
        "score": 6.7,
        "directors": [
          "Ruben Fleischer"
        ],
        "writers": [
          "Will Beall",
          "Paul Lieberman"
        ],
        "synopsis": [
          "note: work in progressIn 1949 post-WWII Los Angeles, gangster Mickey Cohen (Sean Penn) has become the most powerful figure in the California criminal underworld, and intends to continue to expand his criminal enterprise across the Western United States, forcing out his rivals in Chicago. The police have not been able to stop Cohen's ruthless rise, as Cohen has eliminated witnesses and bribed both the courts and the police, controlling both illegal and legal sides of L.A.The movie opens as Cohen has a gangster from Chicago killed by shackling him to two cars, which then proceed to rip him in half. He warns the gangster's partner to return to Chicago with news of what he's seen.The next day, Sgt. John O'Mara (Josh Brolin) and his partner are at Los Angeles Union Station when they see one of Cohen's thugs, Mitch, approach a young woman and tell her he is holding auditions, and hands her a card to convince her he is legitimate. O'Mara realizes, however, that Mitch intends to rape her. They tail him to a building that is owned by Cohen. O'Mara's partner refuses to enter, forcing O'Mara to go inside by himself.O'Mara enters the building, telling the man that he is meeting someone. He gets on an elevator, accompanied by two thugs. Things go sour, though, when one of them sees his handcuffs and realizes that O'Mara is a cop. A fight breaks out, during which one henchman is killed and another loses his hand. O'Mara finds the room where the girl is being held captive. He bursts in and after a brawl, subdues the three men and rescues the girl.Although the gangsters are arrested, they are set free on a corrupt judge's order, and Cohen subsequently has them killed by locking them up in an elevator and burning down the building.O'Mara is personally selected by Chief Bill Parker (Nick Nolte) due to O'Mara's special operations background and training at Camp X during World War II to wage guerrilla warfare on Cohen, dismantling his crime empire and forcing him out of Los Angeles. With the help of his reluctant and pregnant wife, Connie (Mireille Enos), O'Mara recruits fellow officers in his squad. Initially he is joined by hard-headed detective Coleman Harris (Anthony Mackie), wire-tapper Conway Keeler (Giovanni Ribisi), and legendary gangster-killer Max Kennard (Robert Patrick). Kennard's partner, Navidad Ramirez (Michael Peña), follows the squad and they reluctantly allow him to join. Sgt. Jerry Wooters (Ryan Gosling), O'Mara's close friend, turns down the offer, as he is disillusioned from the war and his time on the police force.Wooters has been keeping close to his old friend Jack Whalen (Sullivan Stapleton), who is his informant from within Cohen's operations. After meeting for drinks, Wooters becomes infatuated with Cohen's etiquette coach and girlfriend Grace Faraday (Emma Stone). Wooters and Grace begin a secret romantic relationship. After Cohen orders a hit on rival Jack Dragna (Jon Polito) that results in the death of Pete (Austin Abrams), an innocent boy Wooters knew, Wooters becomes motivated to take down Cohen. He saves O'Mara's squad after an unsuccessful hit on one of Cohen's casinos, and later joins them.With organization and better planning the unit strikes several successful blows at the heart of Cohen's criminal organization. The media refer to them as \"The Gangster Squad\". After wire-tapping Cohen's house, Keeler deduces the central location of Cohen's wire gambling business, the heart of his empire. The squad successfully burns down the business, but Cohen's men inform him that they didn't take any of his money. Cohen believes they are a group of honest cops, and believes someone ratted him out and tapped his house. As his men sweep the house for bugs, Grace runs away, fearing Cohen knows of her relationship with Wooters.The Gangster Squad is lured into a trap in Los Angeles's Chinatown by Cohen's head hitman Wrevock (Troy Garity), who was also responsible for Pete's death. Wooters interrupts the ambush just in time to save O'Mara, but Wrevock escapes. Karl Lennox (Holt McCallany), Cohen's right-hand man, kills Keeler in the unit's operation. Wooters asks Whalen to get Grace out of town, but Cohen reaches him first, looking for Grace, and kills him. O'Mara's house is later hit by a drive-by, and Connie gives birth to their son under the stress. Chief Parker tells O'Mara that, as a result of their failure, their careers with the LAPD are over. O'Mara gets Connie out of town, but refuses to leave with the job unfinished. Grace tells Wooters she is willing to testify against Cohen for Whalen's murder, prompting O'Mara, along with the remaining members of his unit, to go to the Park Plaza Hotel to arrest Cohen.Cohen and his men engage in a firefight with the police unit, with Wooters being wounded in the process after killing Wrevock. Cohen and Lennox escape, but O'Mara pursues them, which results in their vehicle crashing into a fountain. Kennard gets shot by Lennox, but manages to kill him with help from Navidad, before dying from his wounds. O'Mara prepares to arrest Cohen, but Cohen tempts him into fighting each other in a bare-knuckle boxing match, while a crowd of onlookers and journalists gather. O'Mara finally beats Cohen and has him arrested, ending his reign as a crime boss and the spread of the mafia into the Los Angeles area. The Gangster Squad was never mentioned in taking down Cohen, their surviving members remaining a secret. Cohen is sentenced to 25 to life, and is welcomed violently by Whalen's friends. Grace and Wooters continue their relationship, while Navidad and Harris become partners on the force. O'Mara quits to live a quiet life with his wife and son"
        ],
        "summaries": [
          "It's 1949 Los Angeles, the city is run by gangsters and a malicious mobster, Mickey Cohen. Determined to end the corruption, John O'Mara assembles a team of cops, ready to take down the ruthless leader and restore peace to the city.",
          "It's 1949 Los Angeles, and gangster Mickey Cohen has moved in, with the intention of controlling all criminal activity in the city. He has bought local judges and police, and no one is willing to cross him or testify against him. Everyone except Sergeant John O'Mara, a former World War II soldier, whose goal is to settle with his family in a peaceful Los Angeles. Police Chief William Parker decides to form a special unit whose mission is to take down Cohen, and chooses O'Mara to lead the unit. O'Mara chooses 4 cops and asks another cop and vet, Jerry Wooters to join him but Wooters is not interested. After Wooters witnesses the murder of a young boy by Cohen's people, he joins them, and they decide to take apart Cohen's organization. Cohen wonders if a rival is going after him, eventually he realizes it's the cops.",
          "1949 Los Angeles. Boxer turned mobster Mickey Cohen, who had been working in Chicago with some other mobster associates, has moved his operation to Los Angeles. He plans to take control of the city, in the process squeezing out all competition by whatever means, usually by violence. In being able to achieve this, Cohen has many in Los Angeles area authority in his back pocket. LAPD Chief Bill Parker asks Sgt. John O'Mara to assemble and lead an unofficial, off-the-books squad to deal with the Cohen problem. Parker makes this request specifically to O'Mara because of O'Mara's previous handling of some cases associated with Cohen's operations. O'Mara and the squad are not to kill Cohen - which would only lead to someone else taking over - but rather disable all his operations in such a way no other mobster would consider coming in. Although she doesn't much like this assignment, O'Mara's loving and very pregnant wife, Connie, convinces her husband that he needs to recruit others with specialized skills as opposed to clones of himself which was his original thought, her advice all in an effort to make sure he comes home alive as a father at the end of it all. O'Mara will have to control the disparate group he has assembled in working toward their common goal. One issue he will have to deal with is the fact that one of his colleagues, Sgt. Jerry Wooters, who has lost his professional drive, has just embarked on affair with Cohen's girlfriend, Grace Faraday, the two whose lives would be in danger if Cohen ever found out. As O'Mara and his team plow ahead without a clear plan, they may encounter problems in finding out who indeed is in Cohen's back pocket, and as they can't ask for any assistance from anyone outside of the squad as being \"unofficial\". Nonetheless, they may be able to continue progressing to their end goal as long as Cohen does not know who they are, namely that they are LAPD undercover. If they are ever discovered, it may not only compromise their work, but may place their lives, and that of their loved ones, in mortal danger.",
          "Having earned the respect of the Italian mob in 1949 Los Angeles, the brutally ambitious Brooklyn-born former professional boxer, Mickey Cohen, and his ruthless gang have spread their tentacles throughout the bustling city. Enjoying a preposterous immunity, and the ample protection of the local police and the corrupt politicians, Mickey brags about how he can dine with judges and police chiefs, who holds them in the palm of his hand, leaving the field clear for Cohen to enforce his omnipotence undisturbed. However, not if a small, top-secret LAPD task force can help it. Now, the brave and honest men of Sgt. John O'Mara and Jerry Wooters dice with death to bring down the vicious gangster's thriving criminal empire. Can L.A.'s Gangster Squad stop Mickey Cohen's reign of terror?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "aC_NAIUBmFo8GYv0boQw",
        "_score": 13.345703,
        "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
        "year": 2005,
        "genders": [
          "Adventure",
          "Family",
          "Fantasy"
        ],
        "score": 6.9,
        "directors": [
          "Andrew Adamson"
        ],
        "writers": [
          "Ann Peacock",
          "Andrew Adamson",
          "Christopher Markus"
        ],
        "synopsis": [
          "*** NOTE: This synopsis applies to the extended \"collector's edition\" version with the expanded battle scene ***Above the skies of London, a Luftwaffe bombardment group flies in, evades the defending flak gunners, and starts to drop yet another load of bombs on that much-abused city. Below, in a modest home in the London suburb of Finchley, a distraught mother rouses her four children from their sleep and hurries them to a bomb shelter, including one, the younger boy, who foolishly stands next to an open window. But just as they are about to enter the shelter, the young boy turns around and runs back into the house, to retrieve a portrait of their father, an RAF pilot. The older brother dashes after the younger one, and the two boys are nearly killed as the younger one recovers the portrait. As they gain the shelter, the older boy, Peter Pevensie (William Moseley), explodes at his younger brother Edmund (Skandar Keynes), saying that his rash act almost brought death to them all. \"Why can't you just do as you're told?\" he concludes, indicating that he has been the Man of the House since the elder Pevensie went off to war.The next day, Mrs. Pevensie (Judy McIntosh) herds her four children, Peter, Susan (Anna Popplewell), Edmund, and Lucy (Georgie Henley), onto an evacuation train at Paddington Station, the London terminus of the Great Western Railway. Mrs. Pevensie lovingly pins identification tags on each one and exhorts the older ones to take care of the younger ones. They all board the train, with Edmund sulkily protesting that he can board a train by himself.The four children ride out of London to a town called Coombe Halt, where the first motorcar they see simply blares its horn at them and moves on, leaving them standing there wondering whether, in Edmund's words, they might have been incorrectly labeled. Just then a horse-drawn cart appears, driven by a severe-looking middle-aged woman whom Peter guesses is the \"Mrs. Macready\" (Elizabeth Hawthorne) whom they were told to expect. Mrs. Macready is housekeeper to Professor Digory Kirke (Jim Broadbent), who lives on a vast estate dominated by a large house containing a wealth of historical artifacts from classical times and the Middle Ages. Macready informs them that the professor \"is unaccustomed to having children in his house,\" and on that account--or perhaps because the house is so like a museum--the children are subject to some rather strict rules. The chief rule (other than \"no touching of the historical artifacts\") is: Do not disturb the Professor.The children's first day on the estate reveals the tensions among the siblings. Edmund Pevensie is, quite simply, a \"rotten kid\", Lucy is homesick, Peter feels the weight of trying to be the Man of the Family while their father is fighting the war, and Susan is constantly \"trying to be smart\" and thus often bumps heads with Peter. (The bulletins describing yet more bombing runs by the Luftwaffe don't help their mood any.) The following day is no better, because it's raining and forces the children to stay indoors. Lucy proposes a game of hide-and-seek, and Peter, hoping to humor her, agrees to be \"It\" and starts counting up to 100. The other children find hiding places (Edmund pushing Lucy out of a closet after declaring that he was there first)--but Lucy finds the strangest hiding place of all--an unused room containing one \"sheeted\" piece of furniture that turns out to be a magnificent wooden armoire, or wardrobe, with an intricate carving of a tree on one of its doors. Lucy climbs inside and burrows in among the coats--but then finds that she can keep going, deeper and deeper, until she emerges into a snow-covered woodland!With little thought of anything but this wondrous land she has discovered, she walks out into the wood, and gazes in wonder at the trees. Strangest of all the objects she sees is a perfectly functioning gas lamppost standing far away from any sort of street. And then she sees an even stranger sight: a creature, half man and half goat, carrying an armload of brown-wrapped parcels and holding a flimsy parasol over his head!This creature and Lucy both cry out and hide from one another, and then come out and start a conversation--tentative at first, and then more confident. The faun, who gives his name as Tumnus (James McAvoy), is delighted to learn that Lucy is a \"daughter of Eve,\" i.e. human. He won't tell her why her human origin is so important, but he rather strenuously persuades her to join him at his home for tea and crumpets--\"and perhaps I'll even break into the sardines.\"Lucy questions nothing that she sees, even the idea that such a creature could not only exist, but also be civilized enough to have a furnished home--with a library of leather-bound books carrying such titles as \"Humans\" and \"Is Man a Myth?\". Tumnus then reveals that the world they are in, called Narnia, has seen no Christmas, and no season except winter, for the last hundred years. Then he offers to play some music of the sort that he used to play in Narnia's summers. He plays a hypnotic tune on a flute-like instrument, and Lucy actually sees shapes form in the flames of Tumnus' hearth fire, shapes of a man riding a unicorn, and fauns and dryads dancing. Eventually Lucy drops her teacup and falls asleep--and then another shape entirely forms in the flames: an angry lion who roars at Tumnus, stopping his playing and snuffing out the candles in his home.Now Tumnus makes a terrible confession: the ruling tyrant of his world, whom he calls the White Witch, has given orders that if any of her subjects were to find a human or humans wandering in the woods, they were to turn said human(s) over to her. Tumnus was trying to lull Lucy to sleep and hand her over--but now, conscience-stricken, he decides instead to hurry her back to the lamppost so that she can return to \"the shining city of War Drobe in the wondrous land of Spare Oom.\" As a token of her friendship, Lucy gives Tumnus her handkerchief before they part.Lucy tumbles out of the wardrobe--but to her surprise, Peter is just finishing his \"It\" count and saying, \"Ready or not, here I come!\" As a result, Lucy loses immediately when she cries out that she is all right after all, and cannot make her brothers and sister believe that she's been gone for hours. Especially when Susan investigates the wardrobe and finds nothing but a solid wooden wall where Lucy had claimed to find a wooded country. Peter, however, has another problem: Edmund makes a stupid joke about finding \"the football field in the bathroom cupboard,\" and when Peter severely reprimands Edmund for \"having to make things worse,\" Edmund cries out that Peter tries to pretend that he's their father, which Edmund will never accept.Later that night, Lucy takes her candle and goes into the spare room again. And when she opens the door to the wardrobe, a cold breeze blows out the candle. So Lucy goes into the wardrobe and into the wood. But behind her is Edmund, thinking to catch Lucy and make fun of her. And so he is quite unprepared to find himself entering the winter forest himself.Edmund at first searches for Lucy (and never thinks to follow her footprints). Then he is nearly run over by a sleigh drawn by six large white reindeer stags, and driven by an angry dwarf named Ginarrbrik (Kiran Shah), who stops the sleigh, dismounts, catches Edmund, and is about to cut his throat when the sleigh's passenger calls out, \"Wait.\" The passenger then dismounts.This is a very tall and very stunning but unusually pale-complexioned woman (Tilda Swinton) with blonde hair arranged in dreadlocks. (With that hairstyle, she may or may not be consciously imitating Medusa, the mythical creature that could petrify anyone foolish enough to look her in the face.) She regards Edmund at first with stern aspect and considers him a trespasser. But when she learns that he is one of four siblings, her attitude changes. She smiles, beguilingly, and offers him a seat in her sleigh--but as she turns aside, one can clearly see that she is worried.The woman offers him a hot drink--which she \"makes\" by dropping a green liqueur onto the snow. She asks him what he would like to eat, and he names his favorite confection: Turkish Delight, which usually is a fruit-flavored sugar snack covered with confectioner's sugar. But the Turkish Delight that this woman conjures up is more than usually addictive. The woman identifies herself as the Queen of Narnia, and then says that she has no children of her own, and could see Edmund becoming Narnia's king some day--but he would have to bring his family to claim that honor. With more beguiling words, she leaves Edmund in the path while her sleigh drives off.Then Lucy appears, and says that she has seen Tumnus again, and that \"the White Witch\" knew nothing of her presence there. Lucy then explains what she meant by that phrase: the \"White Witch\" is a woman who pretends to be the Queen of Narnia, but isn't actually. Edmund is troubled at those words, but won't tell Lucy why.The two children go back through the portal into the wardrobe, and Lucy wakes Peter and Susan to tell them excitedly that \"Narnia\" is all in the wardrobe as she said, and this time Edmund had seen it. But to her horror, Edmund now says that he was just playing along. Lucy starts to cry and runs out. Peter shoves his brother aside and follows Lucy--only to find that she has run into Professor Kirke. The commotion has also roused Mrs. Macready, who is about to send them to sleep in the stables until the Professor assures her that he is not offended, and that Macready could help by serving Lucy some hot chocolate.Professor Kirke questions Peter and Susan about the commotion--and when he hears that Lucy claims to have found a forest in the upstairs wardrobe, the Professor eagerly asks about that forest. Peter, surprised, asks Kirke whether he believes her story--and the professor says that he has no reason not to, and neither should Peter and Susan. \"You're her family!\" he says. \"You might start acting like one!\"The next day is a bright sunny day, so Peter organizes a cricket match--and of course Edmund gets hit with the ball, because he won't pay attention. Then Peter \"bowls\" the ball again, and Edmund swings his bat and connects--and send the ball flying through a stained-glass window, where it smashes a hole and then knocks something over with a crash. The children dash into the house and up the stairs to see what made the crash--and discover a suit of armor knocked supine. \"Well done, Ed!\" says Peter--and then they hear Macready's voice and start to flee. The only place to flee is into the spare room, where, at Edmund's urging, they climb into the wardrobe. And then, in an effort to find more room to crowd in, the children walk back--and-back--and back--until the four of them are in the winter-bound woodland.Peter is abashed and apologizes to Lucy, who starts a good-natured snowball fight. Then he realizes that Edmund has lied to the rest of them about what he had seen, and orders him to apologize, which he does. Then the four, wearing oversized coats taken from the wardrobe, set off for Tumnus' house, at Lucy's suggestion. Even Susan is captivated by this wondrous land--but Edmund is half guilty, half furtive, and constantly looking toward the two mountain peaks that the \"Queen of Narnia\" had pointed out to him on his last visit. No one takes any notice.Finally, they arrive at Tumnus' house--and find it a total wreck, with smashed furniture and crockery, piles of blown-in snow, and a crudely lettered parchment containing a notice accusing Tumnus of \"high treason against Her Majesty, Jadis, Queen of Narnia\" for \"fraternizing with humans.\" It is signed with the paw-print of a wolf, and the name Maugrim, identified as \"captain of the secret police.\" Susan wants them to return home, but Lucy insists on staying, to try to help Tumnus.Just then a small robin gives them an unmistakeable signal to follow, and leads them out into the open, where they meet a beaver (Ray Winstone) who can actually talk to them. The beaver gives Lucy back her handkerchief, says that Tumnus gave it to him just before his arrest, and encourages them all to follow him \"further in,\" and not to talk anymore until they are out of the woods--because some of the trees might actually inform the Witch against them. The beaver leads them all to his house, which he has built in a dam in the frozen river. The beaver has a wife (Dawn French), who acts like a typical good-natured scold--until she sees the four Pevensie children, and bows in obeisance to them as if they are somehow important and deserving of a high honor, which puzzles the children. The only sour note is that the beaver notices that Edmund is \"enjoying the scenery\"--specifically the same two mountain peaks that he was earlier gazing at.Once inside, the beavers tell the children about someone named \"Aslan\" who is \"on the move,\" and waiting for the children at a place called the Stone Table. (The children don't recognize that name, but they all somehow feel that that's a name laden with spiritual significance--all but Edmund, who asks \"Who's Aslan?\" and provokes the beaver to uproarious laughter.) The reason is that a long-standing prophecy says that two \"sons of Adam\" and two \"daughters of Eve\" will fight the White Witch and defeat her in combat, thus ending the winter and her regime. The beavers shock them further by saying that \"Aslan\" has outfitted an army for them to lead! Peter thanks them for their hospitality and prepares to lead the four of them out--but then finds that Edmund has gone missing.Edmund has indeed left the beavers' house and gone hiking toward those two mountain peaks. The others try to follow, but arrive only in time to see Edmund entering a very large, forbidding palace, seemingly constructed of ice and stone. Peter tries to follow, but the male beaver stops him, saying that Edmund is the bait for a trap. When the palace doors close on Edmund, Susan and Peter argue whether they should have gone back long before that, but Lucy says that arguing will not help Edmund. The male beaver agrees, saying, \"Only Aslan can help your brother now\"--so Peter asks the beavers to lead them to Aslan.Edmund, in the palace, is in a courtyard seemingly full of stone-masonry statuary--giants and centaurs and leopards and all manner of other creatures. Whether he notices that all of the statutes seemed to have been carved in an attitude of fright or anger or defiance--as if some of them were trying to kill someone in combat, and others were begging for mercy--is not entirely clear. Then he tries to step over a sleeping wolf (Michael Madsen)--who rouses himself with great speed and pounces on Edmund, challenging him for identification. Edmund says who he is, and the wolf condescendingly leads Edmund to an obvious throne room--where Edmund cannot resist sitting on the throne. Queen Jadis finds him sitting in it, and at first does not reprimand him for such lese-majeste. Instead, she first asks whether his sisters are deaf, and whether his brother is unintelligent--and then loudly demands to know how he dares return alone! Now sounding not very beguiling at all, but talking clearly for the first time, she frightens him into revealing that his brother and sisters are in the beavers' house. Edmund then asks whether he could have more Turkish Delight--and Jadis summons Ginarrbrik, who leads Edmund away at knife point--to a prison cell. Then she summons the wolf, who is actually Maugrim, the police captain--or rather, the alpha dog of a pack of wolves, who now rush out of the palace, intending to raid the beavers' house.At the house, the beavers hurriedly pack some supplies, and then the three children and two beavers escape into a tunnel just as Maugrim and his pack invade the house. The five emerge into another clearing--where they find the stone statue of a badger, which the two beavers recognize as once a buddy of the male beaver's. The children realize at once that they are looking at a real badger, once able to talk as the beavers are but now petrified. Nor is he the only such sad creature whom they find.\"This is what becomes of those who cross the Witch,\" says a fox (Rupert Everett) who offers to hide them up a tree while he sends Maugrim and his pack off on a fool's errand--though the fox is not entirely unscathed in the encounter. After the wolf pack runs away, following the fox's false lead, the fox allows the female beaver to tend to him only briefly, while he informs the party that \"Aslan himself\" has asked him to go about recruiting more troops. Peter is still dubious about getting involved in any war, but the fox and the beavers all urge him to fight, saying, \"We can't go to war without you.\"Back at Jadis' palace, Edmund, chained to the wall of a cell, meets a miserable faun who can only be Tumnus, with whom he shares the unappetizing food that Ginarrbrik, presumably, has thrown him. Tumnus asks Edmund whether Lucy is safe, which Edmund does not know. Then an angry Jadis storms in, saying that her police have torn the beaver house apart and found nothing. Lifting Edmund off his feet, she glares at him angrily--and if she didn't look like Medusa at their first meeting, she definitely does now. She demands to know where they went and is on the point of striking him with her upraised sceptre when Edmund abruptly drops the name of \"Aslan.\" Tumnus is shocked to hear him reveal so much, and Edmund, not wanting to reveal too much too fast, says that he left before his siblings said where they were going. Jadis then cruelly informs Tumnus, \"You're here because he turned you in for sweeties!\" She orders Tumnus taken to the statuary courtyard, and her sleigh made ready for travel. When Edmund is led out to the sleigh, he passes a statue of Tumnus--which he now realizes, with a sickening feeling in his gut, is actually Tumnus--petrified. That must have almost happened to Edmund, and worse yet: every one of those statues is not a statue at all, but a petrified victim of the Queen of Narnia--and \"White Witch\" is certainly a name that fits! And he is her prisoner.Jadis sets out on her sleigh (without bells), with Edmund bound hand and foot and sitting miserably at her feet. Meanwhile, the beavers lead the remaining Pevensies over a natural stone bridge to a vast vista that they will have to cross. Reluctantly, Peter leads the party across the apparent frozen wasteland, with the beavers acting as their only guides. On the way, a sleigh notices them and gives chase, forcing them to hide. The fleeing children fail to notice that the sleigh has a full set of bells on--or else don't stop to think that Jadis would not have hung bells on her sleigh while on the hunt. In any case, the driver of the sleigh that pursues the children is not Queen Jadis, or the nasty Ginarrbrik--but none other than Father Christmas (James Cosmo)!\"I've been driving one of these longer than the Witch,\" he says by way of explanation, and then gives the children some valuable gifts. To Lucy he gives a bottle made of diamond and containing a bright-red-colored cordial made from \"fire-flower juice,\" one drop of which can heal any injury, and a small dagger. To Susan he gives a bow, an ivory quiver filled with bright red-feathered arrows, and an ivory horn that will summon aid from anywhere. To Peter he gives a shield (argent a lion rampant guardant erect gules) and a sword containing a runic message that he does not take the time to translate. Then he says, \"Winter's almost over, and things do pile up when you've been away for a hundred years! Long live Aslan, and Merry Christmas!\"Peter notices another implication of Father Christmas' message: the great river that they must cross, that is supposed to be frozen, will not be frozen much longer. Sure enough, when they arrive at the Ford of Beruna, the river is already thawing. Desperately the children and the beavers try to cross on what little ice remains--and then Maugrim and his pack catch up with them. Maugrim's beta, or second-in-command, pounces on the male beaver while Maugrim taunts Peter and Susan, saying, \"This isn't your war! All my Queen wants is for you to leave!\" Maugrim might or might not have noticed that the rest of his pack are no longer able to support him, because the ice, breaking up, is already carrying them downriver and away from the fight. Then, before Peter can make up his mind, the nearby waterfall thaws the rest of the way, and its ice covering breaks. Peter drives his drawn sword into the ice and orders them all to hold on to him--and then the ice-dam collapses, scattering the wolves and washing the five fugitives down river. Almost by a miracle, they survive and manage to get safely across--where they notice that they can shed their coats, for now the snow is melting fast, and the nearby trees are putting out their first buds and leaves of spring.Behind them, Jadis arrives to find a running waterfall--and Maugrim and his pack arrive, dragging the fox who had deceived them earlier. Edmund, hoping to spare the fox's life, reveals the phrase \"stone table\" and that \"Aslan,\" whom he still does not know (though Jadis does) has an \"army.\" To his horror, Jadis strikes the fox with her sceptre--and a horrid blue electric flame leaps from the sceptre, washes over the fox--and petrifies him. That, then, is how she must have killed all those unfortunates in the courtyard! Jadis then slaps Edmund, telling him to remember whose side he is on. Then she orders Maugrim to muster those creatures faithful to her at an undetermined place, and declares--while petrifying an inoffensive butterfly with her sceptre, almost as an afterthought-- \"If it's a war Aslan wants, it's a war he shall get!\"The beavers lead the children straight into a medieval war camp, complete with brightly colored officers' tents, and all manner of wondrous creatures preparing armor and weapons for themselves. The fascinated children see centaurs, more fauns, satyrs, and gryphons (a kind of flying creature, part avian, part mammalian). Susan wonders what everyone is staring at, and Lucy says, \"They probably think *you* look funny!\" But the point is that the onlookers are not looking at the children with curiosity, but with reverence and awe, of a kind reserved for kings and queens. The children still do not understand the significance of this attitude.Peter walks up to the obvious command tent, draws his sword, and says, \"We have come to see Aslan!\" Then everyone kneels to the ground, and the command tent flap opens--and now the children meet Aslan (Liam Neeson) face to face. Aslan is a very large lion, who truly walks like the \"king of beasts,\" and now the children, too, kneel before him, as seems a perfectly natural thing to do. Aslan bids the three welcome, thanks the beavers for their good guidance, and then asks after Edmund--and Peter shocks the assembly by saying that Edmund was captured. The beaver shocks them further by saying that Edmund had betrayed them. Aslan quiets the assembly, and then Peter confesses that he is at least partly to blame, for being \"too hard\" on Edmund. As may be, Edmund is their brother, and they want him back, on any terms--a thing with which Aslan sympathizes, though he warns them that the situation is now very difficult.Later, Peter, now dressed in the leather jerkin of a Medieval officer, talks frankly with Aslan about the battle to come, and about Peter's future career as High King of Narnia, a post that he will have to win in combat. While he and Aslan are talking, Edmund is in a truly miserable situation: bound and gagged, and being taunted by Ginarrbrik about his \"special treatment.\"Susan and Lucy try on their own new costumes--when suddenly Maugrim appears, with only his beta to accompany him. (Why he did not come with his whole pack is never explained.) They announce that they intend to kill them both. Susan throws one of her dresses into Maugrim's face, grabs her horn, and manages to get off a good blast before she and Lucy have to climb a tree. Peter rushes to the spot and finds the girls up a tree with Maugrim and his beta trying to jump at them. Maugrim turns to Peter, saying, \"We both know you haven't got it in you!\" Peter is wondering how he will fight two wolves at once when suddenly Aslan arrives and restrains the beta. Behind Aslan come several galloping centaurs, led by Oreius (Patrick Kake), who draws his sword. Aslan tells them to stay where they are and let Peter fight his battle. Maugrim charges Peter--and impales himself on Peter's sword. Aslan releases the beta dog, sends Oreius and the centaurs to chase him, and holds a dubbing ceremony to invest Peter with a new title: Sir Peter Wolf's-bane, Knight of Narnia.Later that night, Oreius, having followed Maugrim's miserable beta back to Jadis' camp, leads a successful raid to rescue Edmund. The next morning, Aslan talks to Edmund alone about what he has done, and then re-introduces Edmund to his siblings, telling them \"there is no need to speak about what is past.\" Peter and his sisters are glad enough to have Edmund back, and are quite satisfied that Aslan has asked all the questions that need asking.The four children then have a serious conference. Peter wants to send his three siblings back to the lamppost and the wardrobe, while he stays and leads Aslan's troops in the coming battle. But Lucy insists that the free Narnians need all four of them to win, and Edmund will not walk away from a situation that he helped create. Susan, the last holdout, then takes up her bow and arrows to \"get in some practice.\" All four of them practice their combat techniques--Susan with her bow and arrow, Lucy with her dagger, and Peter and Edmund learning the proper way to ride a horse while holding a drawn sword (\"Sword point up!\") and even how to fight while on horseback. Then the male beaver alerts them all that Jadis has demanded a parley with Aslan and is coming to the camp.Jadis makes a terrible demand: Edmund must surrender himself to her, to be executed on the Stone Table--otherwise, Narnia will be destroyed completely. Aslan offers to talk alone with Jadis. Later, Jadis and Aslan emerge from the command tent, and Aslan announces that Jadis has renounced her claim. Jadis wants to know whether Aslan's own \"promise\" will be kept. Aslan roars his answer at her, and Jadis leaves--but Lucy notices that Aslan is much troubled.That night, Aslan walks out of his camp, toward the Stone Table. Susan and Lucy plead with Aslan to let them accompany him, a gesture that Aslan appreciates. But finally Aslan orders them to wait and \"trust\" him--while he walks into a barbaric ceremony and submits to being bound, shorn, and eventually executed with a single stroke of a stone knife held by Jadis.Jadis orders her own chief general, a minotaur named Otmin (Shane Rangi), to prepare for battle, \"however short it may be.\" Her forces withdraw, leaving Aslan's body alone on the Stone Table. Susan and Lucy rush forward and stand guard over the body all night long. Lucy opens her bottle of fire-flower cordial, but Susan says that it is too late for that, because Aslan is dead. (The cordial is a potion, and Aslan can no longer swallow it.) Susan at first wants to chase away the rats and mice who are swarming around Aslan, until Lucy points out that they are actually gnawing away his bonds. Then Susan says that Peter and Edmund need to be alerted, and Lucy reminds her that the trees are animated--or rather, have their own spirits, the dryads, who can carry messages faster than even the girls can deliver them. And so a dryad (Katrina Browne) awakens Peter and Edmund, back at the main camp, to advise them of Aslan's death.Now Edmund turns to Peter and says that Peter must lead them. Peter is afraid that he would never be able to do this--but Edmund reminds him that Aslan believed in him--and now, so does Edmund himself. Oreius, as if to underline the point, asks Peter what his orders are--and Peter gives them.The next day, the First Battle of Beruna unfolds. Peter deploys a cavalry consisting of centaurs and leopards at the base of a cliff, and orders Edmund to command the rest of his forces, armed with bows and arrows, at the top of the cliff. Peter even has an air force, consisting of talking eagles, falcons, hawks, and gryphons. He designates some to act as fighters, some as bombers, and some as aerial scouts.One gryphon (Cameron Rhodes) brings word that the enemy forces are coming, \"in numbers and weapons far greater than our own.\" Oreius confidently observes that numbers alone are not sufficient to win.The battle starts when Otmin leads half of Jadis' forces onto the open area, advancing in a full horizontal line. Peter first orders aerial bombardment, by his gryphons and other birds, carrying rocks and dropping them onto the advancing black dwarfs, ankle slicers, and other unsavory creatures. Otmin notices the approaching gryphons and alerts his forces, who begin shooting arrows. Jadis, driving a chariot drawn by polar bears, sends a group of large bats to attack the gryphons, resulting in a rather interesting substitute for modern aerial dogfighting.Then Peter cries out, \"For Narnia and for Aslan!\" and, astride his own war charger (a white unicorn), leads his cavalry in flying-wedge formation to drive into the enemy line.At the Stone Table, the girls prepare to leave--when suddenly they are thrown off their feet, as the Stone Table cracks in two--and Aslan is now missing. Then, as the look, a very much alive Aslan appears before them, assuring them that he had relied on a little-understood provision of the \"Deep Magic,\" \"that when a willing victim who has committed no treachery dies in a traitor's stead, the Stone Table will crack, and death itself will turn backwards.\" Aslan then orders the girls to climb on his back and cover their ears, as he starts to race across the countryside--back to Jadis' castle.At the battle, Peter orders Edmund to deploy another weapon--a phoenix, that forms out of a firebrand shot like an arrow from the top of the cliff. Jadis sends a bat after it, but Peter kills the bat with a javelin. The phoenix then self-combusts and draws a wall of fire separating the two sides--until Jadis advances and uses her magic--perhaps a blast of energy from her sceptre--to part the wall. Peter now orders his forces to fall back to the rocks inside the cliff area, where Edmund and his archers will shoot the enemy as they try to come in.All goes well, until Ginarrbrik shoots Peter's war charger out from under him. Now unhorsed, Peter watches helplessly as Oreius charges forward to attack Jadis on his own. Otmin tries to stop Oreius, but the centaur leader impales him with his swords. Drawing another, massive sword, Oreius leaps at Jadis, but the White Witch easily leans back to dodge his blow--and in the process, Oreius gets too close, thus allowing Jadis to petrify him with one touch of her sceptre.At that instant, Aslan, Susan, and Lucy have arrived at Jadis' palace, which is totally unguarded. Lucy sees the petrified Tumnus and bursts into tears--but then Aslan breathes upon Tumnus and revives him! Aslan orders the girls to search the palace, saying that they must form a relief army out of every petrified creature they can find.Jadis, having petrified Oreius, fends off all attackers with the same deadly efficacy. Peter now orders Edmund to quit the field, find the girls, and get them home. At first Edmund allows the male beaver to drag him away--but then he notices Jadis making her way to Peter and raising her sword and that dreadful sceptre. Once again he disobeys: he jumps into the fray, knocking Ginarrbrik off a cliff in the process, and engages Jadis as she is about to use the sceptre. Edmund swings his own sword, forcing Jadis to withdraw the sceptre. Jadis then thrusts forward with the sceptre in an attack on Edmund, but Edmund backsteps in time--and with another two-handed swing of his sword, cuts the sceptre in two, thus permanently deactivating it in a wash of blue lightning. The display distracts Edmund for a critical few seconds--and Jadis, who is much more skilled than Edmund, disarms him with the sword she is carrying in her left hand, and stabs him with the short fragment of her broken sceptre.Peter, seeing this, cries out in blind rage and rushes at Jadis, swatting another minotaur aside like an annoying insect. Then the two leaders clash, with Peter, armed with sword and shield, against Jadis, who has cast aside her now-useless sceptre and engages him with two swords--her own and the one that Edmund had been carrying. Peter swings almost blindly, Jadis counters every move he makes, and their differences in skill are painfully obvious--and then a great, air-filling roar interrupts them both, and they turn to see Aslan, the last person whom Jadis ever expected to see--with Susan and Lucy, at the head of a force greater even than the force that Peter had started out with!Susan and Lucy's relief forces, with Tumnus and a good-natured giant (Lee Tuson) in the lead, rush in and start to make quick work of Jadis' forces. Jadis, now concentrating on Peter, trips him up, pins his sword arm with one of her own swords, lifts his shield away from him, and is about to finish Peter off with one quick thrust when the angry Aslan pounces and bowls her over. Aslan allows her about five seconds of respite--during which she looks at Aslan with a look that is half terrified and half anticipatory. Then Aslan opens his great jaws and presumably breaks her neck. Whereupon Jadis' troops break and run in a rout, with Susan and Lucy's relief forces in hot pursuit. (The pursuit is made to look like an army of wraiths, to illustrate that Peter can barely perceive them, and has eyes only for Aslan and the dead Jadis.) As the chase moves out into the open, Aslan quietly declares, \"It is finished.\"Peter is joyously reunited with his sisters, and then reveals that Edmund is very badly wounded. The three come upon him, breathing agonally, with Ginarrbrik about to cut his head off. Susan kills Ginarrbrik with her bow, and then Lucy gives Edmund a drop of the firewater juice--which at first does not appear to succeed, until Edmund regains his consciousness and breathing. Peter embraces his brother lovingly, and then asks, \"When are you going to learn to do as you're told?\"Aslan then starts reviving the petrified Narnians by breathing on them (Aslan can restore anyone from that state, even a petrified creature that has since been shattered), and Lucy rushes about with her bottle of firewater juice to render what first aid she can. The shot then slews over the countryside, all the way out to the mouth of the Great River, to Cair Paravel, the Castle of the Four Thrones, where a solemn coronation ceremony now takes place. Aslan presides, of course, and installs the four children as the permanent resident Kings and Queens of Narnia, each with his or her own region of responsiblity. With that done, Aslan walks out along the beach and away from Narnia, obviously leaving the children in charge. Tumnus assures Lucy that Aslan will return one day, but when Aslan himself sees fit.Years later, the four Kings and Queens, now grown to adulthood, are in the Western Wood, chasing after the legendary White Stag, when they happen upon a most strange device: a lamp growing out of the ground. The four know it is familiar, but don't know why--until Lucy (Rachael Henley) remembers a phrase, \"Spare Oom!\" and leads the other three (Noah Huntley, Sophie Winkleman, and Mark Wells) deeper into the woods. As they continue to run, they find themselves in a confined space--with coats, not trees, to either side--and in the next instant they pile out of the original wardrobe, having not aged a day or even a second since entering Narnia so many years, as they perceived them, before--and then Professor Kirke comes to ask them what they were all doing in the wardrobe!\"You wouldn't believe us if we told you, sir!\" says Peter, now back to his original age, as are all the others. Kirke tosses him the cricket ball he had bowled, and says, \"Try me.\"As the credits roll, Lucy tries one more time to re-enter Narnia through the wardrobe, and Kirke informs her that she will not likely be able to re-enter that way, because \"you see, I have already tried.\" This is the one time that Professor Kirke reveals that he knows far more about Narnia than he ever was willing to tell, and even that the children can expect to return to Narnia someday, but at a time when they least expect, and aren't actively looking for it. As he leads Lucy out of the spare room, Aslan gives one last roar through the open wardrobe, which then turns dark forever."
        ],
        "summaries": [
          "Four kids travel through a wardrobe to the land of Narnia and learn of their destiny to free it with the guidance of a mystical lion.",
          "Four children from the same family have to leave their town because of the bombings of WWII. A woman and a professor take the children to their house. While playing a game of hide-and-seek, the youngest member of the family, Lucy, finds a wardrobe to hide in. She travels back and back into the wardrobe and finds a place named Narnia. After going in twice, the four children go in together for the last time. They battle wolves, meet talking animals, encounter an evil white witch and meet a magnificent lion named Aslan. Will this be the end of their journey to Narnia or will they stay?",
          "Four siblings are sent away from home during the blitz of WWII. They are sent to be watched over by an old Professor Kirke, who owns a massive mansion. Once there, they stumble upon an enormous wardrobe which transports them to the world of Narnia. Narnia itself was once a peaceful realm filled with talking animals, fauns, Giants and dwarves that is now under a cursed eternal winter by the villainous White Witch. With aid from the majestic lion Aslan, the four lead Narnia into an all out war as they fight to outwit the Witch and restore peace to the land.",
          "During the World War II bombings of London, four English siblings are sent to a country house where they will be safe. One day Lucy finds a wardrobe that transports her to a magical world called Narnia. After coming back, she soon returns to Narnia with her brothers, Peter and Edmund, and her sister, Susan. There they join the magical lion, Aslan, in the fight against the evil White Witch, Jadis.",
          "During the World War II bombings of London, four English siblings are sent to a country house where they will be safe. One day Lucy finds a wardrobe that transports her to a magical world called Narnia. After coming back, she soon returns to Narnia with her brothers, Peter and Edmund, and her sister, Susan. There they join the magical lion, Aslan, in the fight against the evil White Witch, Jadis. By. H. V .BOSS",
          "Based on the 2nd in the series of books by C.S. Lewis, \"The Lion, the Witch and the Wardrobe,\" the film tells the story of 4 children who go to live with an old professor during the war. One day, while playing hide and seek, Lucy, the youngest of the children, finds a wardrobe which leads to a magical land called Narnia. However Narnia is being ruled by the evil White Witch who has made it snow for 100 years and according to an old prophecy, Edmund, Lucy, Peter and Susan are the \"chosen ones\" who will defeat the Witch. They are assisted by the true ruler of Narnia, the lion, Aslan. With the good Narnians on their side all 4 children must now defeat the witch using all their strength and fulfill their destinies to become the new kings and queens of Narnia.",
          "Peter, Susan, Edmund, and Lucy are deported from London to the house of an eccentric professor during World War II. They find life in the house extremely dull, until Lucy discovers a wardrobe that leads to a magical world called Narnia, where animals can talk and all are ruled over by the wise and benevolent lion Aslan. The others don't believe her at first, but soon all of them go through the wardrobe and discover all is not well in Narnia. The land is being kept in a perpetual winter by the evil White Witch, Jadis, who turns anyone who doesn't obey her into stone. The children join Aslan and the animals loyal to him in an attempt to vanquish Jadis."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "dS_NAIUBmFo8GYv0bnst",
        "_score": 13.254982,
        "title": "The Tuskegee Airmen",
        "year": 1995,
        "genders": [
          "Drama",
          "History",
          "War"
        ],
        "score": 7.1,
        "directors": [
          "Robert Markowitz"
        ],
        "writers": [
          "Paris Qualles",
          "Trey Ellis",
          "Ron Hutchinson"
        ],
        "synopsis": [],
        "summaries": [
          "The true story of how a group of African American pilots overcame racist opposition to become one of the finest US fighter groups in World War II",
          "During the Second World War, a special project is begun by the US Army Air Corps to integrate African American pilots into the Fighter Pilot Program. Known as the \"Tuskegee Airman\" for the name of the airbase at which they were trained, these men were forced to constantly endure harassement, prejudice, and much behind the scenes politics until at last they were able to prove themselves in combat.",
          "Historical drama about the first Africa-American pilots in the US military. In 1942, a group of college graduates are selected for training as pilots in Army Air Corps at the Tuskegee training base. In what is billed by everyone as an \"experiment\", the men face not only the institutionalized prejudice of their white officers but that generally found in the US South at the time. There are clearly those who would like to see this fail, including the Major in charge of training and a US Senator. Even when they distinguish themselves in North Africa, there is an attempt to disband them. In the end, they served their country with distinction and bravery, flying missions in Europe include providing bomber escort for the bombing of Berlin. Based on a true story.",
          "A semi-fictionalized account of the Tuskegee Airmen, the first all-African-American Air Force squadron during World War II, the film centers on ambitious young pilot Hannibal Lee. Despite initial reticence by higher ranking white officers, Lee, along with Walter Peoples, Leroy Cappy, and others, are deployed into combat. As the successful missions mount, the Tuskegee Airmen develop a reputation as an able, fearsome group of pilots.",
          "In WWII, the Tuskegee army airfield was where the first 'colored' army fighter pilots were trained. This dramatization of real events follows one man, Hannibal Lee, through training to impossibly high standards, Congressional maneuvering, months of no air-combat action, and finally acceptance and decoration as one of the 332nd Fighter Group, who never lost a bomber to enemy action."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "4C_NAIUBmFo8GYv0bnYs",
        "_score": 13.232308,
        "title": "Hope and Glory",
        "year": 1987,
        "genders": [
          "Comedy",
          "Drama",
          "Romance"
        ],
        "score": 7.3,
        "directors": [
          "John Boorman"
        ],
        "writers": [
          "John Boorman"
        ],
        "synopsis": [],
        "summaries": [
          "Bill, a young boy living on the outskirts of London experiences the exhilaration of World War II. During this period, Bill learns about sex, death, love, hypocrisy, and the faults of adults as he prowls the ruins of bombed houses.",
          "A semi-autobiographical project by John Boorman about a nine year old boy called Bill as he grows up in London during the blitz of World War II. For a young boy, this time in history was more of an adventure, a total upheaval of order, restrictions and discipline. The liberating effect of the war on the women left behind. And the joy when Hitler blows up your school.",
          "Bill Rohan, a young boy living on the outskirts of London experiences the exhilaration of World War II, as seen through the eyes of director John Boorman, who also wrote and produced the autobiographical film. During this period, Bill learns about sex, death, love, hypocrisy, and the faults of adults as he prowls the ruins of bombed houses on Rosehill Avenue. His childlike father is off chasing patriotic dreams of glory from behind a military clerk's typewriter; his teenage sister runs wild; his mother can't cope; and everything in the end will eventually turn out all right.",
          "Now on the far side of middle age, Bill Rowan remembers back to his growing up period in suburban London during WWII, he ten years old when the war broke out. Beyond his father Clive enlisting and what his absence meant, Bill saw the war as an adventure, the specific events more anticlimactic for him compared to the fear driven into the populace of what could happen. Even with the nightly German air raids and bombs actually dropped in their neighborhood, he saw the bomb sites as a playground from which to collect shrapnel and with his newfound friends to destroy whatever survived the bombs. While his younger sister Susie was too young to comprehend fully what the war meant, his mid-teen sister Dawn went on as a teenage girl with raging hormones is apt to focus on, namely boys, or in wartime young men of the military variety, she often feigning the option of death compared to not being with someone, most specifically a Canadian soldier training nearby. And while Bill's mother Grace was ill-prepared emotionally to be without Clive, she had to grow up quickly to deal with leading the family through the changing times. With Dawn, Grace could see her own teen period a bit more clearly due to the war and what she would have done differently if she had to do it all over again.",
          "Bill is your average young boy, living in London with his parents and two sisters. His should be a conventional childhood but it is September 1939 and the UK is at war with Germany. In the next few years Bill will grow up with the fear and devastation of war, but also some fond memories."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "wC_NAIUBmFo8GYv0boQw",
        "_score": 12.739464,
        "title": "Saints and Soldiers",
        "year": 2003,
        "genders": [
          "Action",
          "Drama",
          "War"
        ],
        "score": 6.7,
        "directors": [
          "Ryan Little"
        ],
        "writers": [
          "Geoffrey Panos",
          "Matt Whitaker"
        ],
        "synopsis": [
          "The movie opens as the Allies discover the bloody remains of the Malmedy Massacre. We soon learn how the Germans attacked the unarmed prisoners, killing most of them. Several of the soldiers escape and hide out in a bombed-out house. There's \"Deacon\" (Allred) the ex-missionary who is haunted by something from his past that prevents him from sleeping for days at a time. He's also a crack rifleman. Joining him in escaping are Gould (Polinsky), the medic and a boy from Brooklyn, who seems suspicious of everyone, \"Shirl\" (Bagby) a tough soldier from Louisiana with a lust for killing Germans, and Sgt Gunderson (Holden) from Chicago, who takes command of the group.With the rescue of a British pilot, Winley (Heyborne), the group is complete. The obvious distrust/dislike between Winley and Shirl causes friction, but when the group finds out that Winley holds vital intelligence that will greatly aid the Allies in the ongoing \"Battle of the Bulge\", they agree to get him across 20 miles behind enemy lines to army intelligence.Several close encounters with Germans ensue. Deacon's psychosis continues to escalate as his visions intensify. We find out that in a recent skirmish, Deacon accidentally killed 2 woman and 6 children while trying to take out a sniper. We get to learn more about the lives of the soldiers and in one telling scene, the deep religious feelings of Deacon and contrasted with the agnostic Gould as each of them tells the story of holding a dying soldier.The men stumble upon a remote house occupied by a French woman and her child. They are warmly welcomed by the woman who provides them shelter and food. A massive winter storm slows the group as they hole up at the woman's place. Winley tries to to take off alone and a German patrol soon shows up at the house. The soldiers attack the Germans while the sharp-shooting Deacon misses an escaping German at point blank range twice. The German is caught by Winley and returned to the group. As they argue about whether they should execute the prisoner, Deacon recognizes him as a German he once encountered in his missionary work. He attributes his missing the escaping German to a divine intervention.During the night, Deacon allows the German to escape in exchange for some information about troop movements. The soldiers leave the next morning but Gunderson is shot and killed by a German patrol. A full scale fight ensues and Winley is wounded. Shirl is shot carrying Winley to safety and the two finally make peace just before Shirl dies.The three survivors are approached by a German soldier as they try to revive Winley. It turns out to be the same German that Deacon had let escape the night before. He allows them to escape and they grab an abandoned jeep and head toward the Allied lines. Disguised as German medics with a wounded soldier, they work through their way through the German lines. The Americans, thinking they are German begin shooting at them and the Germans are firing at them from behind as well. Deacon tries to hold off the Germans while Winley escapes with Gould, but is shot and killed in the fire fight. His dying vision is of the family he accidentally killed.Winley and Gould make it to Allied command and the critical information helps stop the German's offensive leading to an Allied victory in the Battle of the Bulge. Gould finds Deacon's body and takes his Bilble, thanking Deacon for saving his life."
        ],
        "summaries": [
          "Four American soldiers and one Brit fighting in Europe during World War II struggle to return to Allied territory after being separated from U.S. forces during the historic Malmedy Massacre.",
          "After surviving a massacre in Malmedy, a location behind the German army in Europe, four American soldiers with only one weapon rescue the British pilot Oberon Winley (Kirby Heyborn) in a tree and they move together, trying to reach the allied forces and save a great number of allied soldiers from a German attack with the information got by Winley in his flight. While marching, each soldier discloses inner secrets to the rest of the group.",
          "Based on actual WWII events, the award-winning \"Saints and Soldier\" tells the dramatic story of a small band of Allied soldiers trapped behind enemy lines with information that could save thousands of allied lives. Outgunned and ill-equipped, they must now battle a frigid wilderness and roving German troops to smuggle the critical intelligence back to allied territory. In mid-December 1944, Hitler's Army charges through the Ardennes Forest in Belgium, initiating the offensive that will come to be known as the Battle of the Bulge. The German soldiers open fire on the unarmed prisoners, in the tragic event now known as the Malmedy Massacre. Corporal Nathan \"Deacon\" Greer, his friend Gordon Gunderson and a handful of others survive the massacre by playing dead and escaping into the nearby woods. The small band of soldiers come across stranded British intelligence officer Oberon Winley, who has valuable information to be delivered to Allied forces, increasing the urgency of their already desperate situation. The group forms a fragile bond as they begin to trust each other. But the constant threat of capture, as well as mounting suspicions of a German sympathizer within the group, threaten to tear them apart. Now with few weapons, no food and a strained camaraderie, this tiny band must take on the unforgiving winter and a forest filled with enemy troops to fight their way back to Allied occupied territory.",
          "Four American soldiers fighting in Europe during World War II are separated from U.S. forces during the historic Malmedy Massacre. Most of their fellow soldiers are slaughtered by German forces, leaving them stranded and without support behind enemy lines."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "qi_NAIUBmFo8GYv0boEv",
        "_score": 12.678275,
        "title": "The Majestic",
        "year": 2001,
        "genders": [
          "Drama",
          "Romance"
        ],
        "score": 6.9,
        "directors": [
          "Frank Darabont"
        ],
        "writers": [
          "Michael Sloane"
        ],
        "synopsis": [
          "During the early 1950s, Peter Appleton (Jim Carrey), an up-and-coming young screenwriter, is accused of being a Communist because he attended an antiwar meeting in college years before, a meeting he claims he only attended to impress a girl. In an instant, his new film is pushed back for a few months, the credit is given to someone else, his movie star girlfriend leaves him, and his contract with the studio is dropped.His career in ruins, he gets drunk and accidentally drives his car off a bridge while trying to avoid an opossum. When he wakes up, his memory is lost and he is in a small town called Lawson after being fished out by Stan Keller (James Whitmore) who takes him to the local doctor named Doc Stanton (David Ogden Stiers). The townsfolk believe him to be Luke Trimble, one of the town boys killed in World War II 9 years before, and embrace him as a symbol of hope. \"Luke\" is at first mildly hesitant to embrace this life but he eventually settles in to \"his old life\", and with his \"father\" Harry (Martin Landau) and his \"girlfriend\" Adele Stanton (Laurie Holden), starts to restore The Majestic theater, an old movie house that had been closed because of hard times.Meanwhile, in Washington, D.C., Congressional committee member Elvin Clyde (Bob Balaban) is convinced that Appleton's disappearance is proof that he is a Communist. No one in Hollywood knows about the accident. Clyde sends two federal agents to search for him. Back in Lawson, not everyone believes that \"Luke\" is back. Bob Leffert (Karl Bury), a one-handed soldier who knew the real Luke and did not like him not only is convinced that Peter is not Luke, he also believes that this stranger is setting the town up for more heartbreak. Others question where Luke has been for so long, and what he has been doing in the interim.A few days later, the town throws a welcome home party for \"Luke\" headed by Mayor Ernie Cole (Jeffrey DeMunn). The town then asks him to play the piano which he used to do when he was a kid. But instead of playing one of the classics he was taught to play, he eventually falls into a roadhouse boogie tune. On his way home, he runs into Bob, who confronts him with the suspicions he has had about \"Luke\", and then punches him when Peter makes a remark about how the war must have changed him. Finally Peter, Harry, Adele and the rest of the townsfolk succeed in rebuilding The Majestic. In the event, Peter also convinces the town to finally display a memorial that President Franklin D. Roosevelt had commissioned for after the war, but that the town did not have the heart to erect.Peter regains his memory when the Majestic shows a movie he wrote called \"Sand Pirates of the Sahara.\" At the same moment, Harry has a heart attack before the reel change. Moments later, Doc reveals that Harry's lungs have flooded and that he will die soon. At Harry's death bed, Peter lets him die believing that he is really his son.Immediately after the funeral, he tells Adele that he is not Luke. The whole town discovers the truth when federal agents Ellerby (Daniel von Bargen) and Saunders (Shawn Doyle) confront him publicly after two boys discover his car washed up on the beach. When Sheriff Cecil Coleman (Brent Briscoe) asks if he can help the federal agents with something, the agents present Peter with a summons to appear before Congress.That night at the Majestic, Peter's agent advises him to \"admit\" and then denounce his past associations with the Communist Party, and presents him with a list of named \"Communists\" that he could read before the court to clear his name. Initially, Peter reluctantly agrees to this plan, but an argument with Adele and a letter he finds that was written as a sort of \"goodbye letter\" from the real Luke (voiced by Matt Damon) trying to explain to Adele that he knows he is dying for a real cause inspire Peter to instead confront the committee.At the hearing headed up by Congressman Doyle (Hal Holbrook) which is televised with the citizens of Lawson also watching, Peter makes an impassioned speech about American ideals, which wins the crowd over. Fearing a political backlash, the lawmakers let him go free. Peter then finds out that it was in fact the girl that he went to the college meeting with years before that named him to the committee (it is revealed that she had since become a producer for Studio One).Peter then returns to Lawson, fearing an unwelcome reception. To Peter's surprise, he receives a hero's welcome from the town's citizens, who have come to respect Peter as an individual. In an epilogue, Peter settles in Lawson, marries Adele, and they have a son."
        ],
        "summaries": [
          "In 1951, a blacklisted Hollywood writer gets into a car accident, loses his memory and settles down in a small town where he is mistaken for a long-lost son.",
          "Peter Appleton is an ambitious young screenwriter working for HHS Studios during Hollywood's Golden Age--1951 in particular. \"Ashes to Ashes\" is about to be released, and he's dating its attractive star, Sandra Sinclair. Just when everything seems to be going his way, it is discovered that he (unwittingly) attended a Communist meeting during college when dragged there by his girlfriend at the time; thus, heavy suspicion settles over him and he must stand before Congress. Afraid of what might happen if they don't, HHS cancels Appleton's contract and aborts the film's release. Appleton promptly plunges into self-pity and spends nearly a whole night at a bar, then drives intoxicated through the streets of California until he plummets into a stormy river and is knocked unconscious. He washes up on the beaches of a small town called Lawson. The citizens are pleasant and likable, but the town is depressed and lifeless after losing 62 of its sons in World War II. One of them, Luke Trimble, was Missing in Action, and miraculously, Peter bears a striking resemblance to the black-and-white photos: close enough to fool even Luke's father Harry. And the alcohol and blow to the head have brought on amnesia, so Peter decides that he must be who they think he is. Besides, it's not a bad life: Luke's beautiful girlfriend, lawyer Adele Stanton, is all over him; the town has sudden sprung back to life with excitement, and he and his \"father\" rebuild a movie palace Harry used to run, The Majestic. Unfortunately, Peter's memory returns in time for G-men to track him down.",
          "Jim Carrey plays Peter Appleton, an egoistic studio scriptwriter in post-WWII Hollywood. Appleton's career is just getting off the ground when his name comes to the attention of a Congressional committee investigating the Communist affiliations of prominent Americans. Finding himself blacklisted by his studio, Appleton drinks too much, then goes for a long drive. He awakens on a deserted beach near a small town, but besides not knowing where he is, he doesn't know who he is or where he's supposed to be. The residents of Lawton, the small town, are calling him \"Luke Trimble,\" because Appleton bears an uncanny resemblance to their much-beloved hometown boy. In the weeks that follow, the townspeople \"remind\" Appleton why Luke was so well-liked, and finds himself living up to a new set of values he never possessed prior to his accident--and liking himself the better for it.",
          "The Back Story: The loss of so many young men in WWII by one town is reminiscent of the real-life tragic story of Bedford, Virginia. After many years, how would the townsfolk of a tightly-knit community react if one of their lost Johnnies came marching home?",
          "In this Capra-esque drama set during the 1950s Blacklist, ambitious young screenwriter Peter Appleton (Jim Carrey) loses his job and his identity, only to find new courage, love, and the power of conviction in the heart of a small town's life.",
          "Peter Appleton is a scriptwriter during the 1950s who is falsely suspected of being a Communist by many Hollywood film people. When this gets the film he was working on canceled, he gets drunk, gets into a freak car accident, and ends up in a small California town suffering from amnesia. He goes to stay in a rundown movie theater, where he learns the magic of experiencing a movie in it. But before long, the Communist hunters track him down and order him to testify before a Senate hearing committee."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Xy_NAIUBmFo8GYv0bnUr",
        "_score": 12.419258,
        "title": "To Be or Not to Be",
        "year": 1983,
        "genders": [
          "Comedy",
          "Drama",
          "War"
        ],
        "score": 6.8,
        "directors": [
          "Alan Johnson"
        ],
        "writers": [
          "Thomas Meehan",
          "Ronny Graham",
          "Edwin Justus Mayer"
        ],
        "synopsis": [
          "In Warsaw, Poland, in 1939, a famous Polish actor, Frederick Bronski (Mel Brooks), runs a theater and its troupe of actors and staff. Most of of the Bronski Theatre's routines are comic in nature: a very popular sketch is titled \"Naughty Nazis\" and features Bronski himself playing Adolf Hitler acting buffoonish, singing about how he plans to take over Europe a piece at a time.Bronski's wife, Anna (Anne Banckroft), always plays second fiddle to her husband: he doesn't see her as an equal and even resorts to putting his wife's name on the playbill in parentheses.Germany invades Poland and the war soon comes to Warsaw. One of the theater staff asks Bronski if a few Jewish friends can hide out in the basement of the theater. He reluctantly agrees. When the Gestapo forces Bronski to cancel the Naughty Nazis sketch because it insults Hitler, Bronski announces that he'll perform his \"world famous Highlights From Hamlet\" routine.On stage, he begins to recite the play's famous \"To be or not to be...\" scene and a young Polish army office suddenly stands up and begins to walk out. Bronski is crushed (and actually gives a great performance instead of his usual below-average acting). The man, Lt. Andre Sobinski (Tim Matheson), meets with Anna in her dressing room -- the line \"To be or not to be\" was a signal for him to sneak backstage. Sobinski himself is an adoring and devoted fan of Anna's and is deeply smitten with her.One night, officials from the Gestapo arrive at the theater and demand that all Jewish cast and staff report to their headquarters and register. At first, Bronski refuses but when the Gestapo threaten to shut down the theater, he gives in. One of the staff, Anna's dresser Sasha, is a gay man. Arriving in Anna's room at night, she notices a pink triangle on his coat which he tells her is the shameful symbol that all gay men must wear under Nazi law, just like Jews having to wear a gold star of David.Warsaw is quickly overrun by the German Wehrmacht. The Bronskis home is seized by the Nazis and they go to live with Sasha. Sobinski, who is on assignment in England, is at a pub with a large group of other Poles who are mourning the fall of their country. One of the men, Professor Siletski (Jose Ferrer), is able to travel easily between Allied territory and Occupied Poland. When asked to take word to the families of the soldiers at the pub, he agrees, having all the men write down names and addresses. Sobinski asks Siletski to deliver a message to Anna, however he becomes suspicious when Siletski initially says he hasn't heard of her. Siletski backpedals a bit and says he'll deliver the message, a simple \"to be or not to be.\"Sobinski meets with British officers and his own superiors, telling them that anyone from Warsaw, like Siletski claims, would definitely know who Anna Bronski is. Sobinski's superiors inform him that Siletski is actually a traitor and spy working for the Third Reich. All the people whose names he collected will be hunted down and executed as Polish underground members. Sobinski asks to be sent back to Warsaw to hunt down Siletski.At the theater, Sasha suddenly runs in having been chased through the streets. The Gestapo is rounding up homosexuals in addition to Jews. Since the theater will be meticulously searched, Sasha hides by dressing like Anna in a large musical number where Anna will join Bronski onstage. The number comes to a halt when Sasha's wig and hat fall off and he is immediately recognized by the Gestapo and arrested. The theater is also shut down and locked up indefinitely.Sobinski is able to steal into Warsaw and locates Bronski at Sasha's home. Anna is not there, having been summoned to Prof. Siletski's office at Gestapo headquarters. Sobinski tells Bronski about Siletski's plan: Siletski plans to turn the names he collected over to the head of the Warsaw Gestapo, Colonel Erhardt. Because Siletski and Erhardt have never met, Sobinski and Bronski devise a plan to have Bronski impersonate Erhardt and get the list from Siletski. The uniforms that the company uses for the Naughty Nazis sketch will be used to gather Siletski and bring him to the Bronski Theatre where a fake Gestapo office will be set up for the ruse. Siletski is brought to the fake office and meets with Bronski. He hands over the list and reveals that he'd printed up a duplicate list to be forwarded to Nazi HQ in Berlin. Bronski needs to stall for more time, but while he does he accidentally reveals that the chair he's sitting in is a prop from the theater. Siletski sees through the ruse and pulls out a pistol. Threatening to shoot Bronski in the back, he escapes into the theater. He's eventually found behind the curtain onstage and shot dead by Sobinski.With the death of Siletski complicating the situation, Bronski agrees to impersonate the dead professor and go back to Gestapo HQ, free Anna and find the duplicate list. He dresses like Siletski and wears a false goatee and meets Anna in Siletski's room. Waiting there for him is Erhardt's adjutant, Captain Schultz, who is to take him to meet with his commandant. Bronski asks for a private moment with Anna, finds the duplicate list and burns it; at the same time he confronts her angrily about her \"affair\" with Sobinski. She reminds him that he has to meet with Erhardt to continue the ruse and he reluctantly agrees. He also remembers to leave word at the desk that Anna can leave any time.Bronski is brought to Erhardt's office. Erhardt, a loud and brash and buffoonish type, asks him for the list. Bronski says that he's still compiling it but does have the names of 2 members of the Polish underground -- both names are prisoners that were executed earlier. Erhardt becomes confused and takes out his anger on Schultz. During the meeting, Erhardt also tells a few jokes about the crabby nature of the Fuhrer, which Bronski uses to his advantage in cowing the cantankerous Colonel.Meanwhile, two of the theatre staff are transporting the body of Siletski in a steamer trunk. They hit a bump and the trunk falls out of the back of the truck. Two Nazi soldiers find the body inside and it is returned to Gestapo headquarters. Anna herself is summoned to meet with Erhardt, who is smitten with her. He tells her that Hitler himself is coming to Warsaw to see the Bronski theatre troupe perform an exclusive show and that the theatre will be temporarily reopened. She asks him to release Sasha, but is flatly refused since he's scheduled for transport already.Bronski later arrives at Erhardt's office and Anna is released. However, Erhardt has other plans for Bronski: he has Bronski wait in his office with the dead body of Siletski. Bronski, having brought a 2nd fake goatee with him, uses a shaving kit in Erhardt's bathroom to shave Siletski's chin and attach the fake goatee. When Erhardt comes back in with goons to interrogate Bronski, Bronski challenges Erhardt to tug on the dead Siletski's beard. It comes off in Erhardt's hand. Believing that Bronski is Siletski, he also agrees to Bronski's demand to let Sasha go. Just as Bronski is about to leave, some of Bronski's staff arrive dressed as Nazis and tell the already flustered Erhardt that they've discovered a plot to assassinate the Fuhrer. Though they do not know that Bronski has already bluffed his way out of trouble, they pull off Bronski's fake beard anyway as proof and take Bronski and Sasha with them.Back at the theater, Anna tells everyone about the Fuhrer's impending visit. They all agree that they must flee Poland before their ruse is really discovered. They plan to sneak out of the theatre during a clown car number, then disguising themselves as SS officers and leave in the trucks and cars the real SS arrived in. Bronski himself will be disguised as Hitler, while one of his actors, Lupinsky, will recite Shylock's speech about Jewish heritage from The Merchant of Venice as a distraction for Hitler's elite guard, who are to be stationed outside his theatre box. Included in the escape will be all the Jews that have been hiding in the theatre.The performance goes off with few problems. Anna is unexpectedly met at the theater by Erhardt who continues to flirt with her. Lupinsky gives an impassioned reading of Shylock's monologue and is taken into \"custody\" and leaves with Bronski. After the clowns have all exited and Bronski is outside, he goes back inside to see what's delaying Anna. Erhardt is astonished to meet Hitler face-to-face and is left a babbling idiot when Bronski tells him he knows about a joke he'd cracked at Fuhrer's expense.The troupe drives to the airport. Most of them are able to board the Fuhrer's private plane but they are discovered by the nearby guards. Everyone makes it aboard, including Anna's little Shih-Tzu and they take off. Their compass is broken and they fly until they run out of fuel. They crash land in a large field. Bronski suggests that he go outside first in case they've landed in German-occupied territory. He finds a small pub and goes inside, still dressed like Hitler. The pub is British and the customers and staff are all shocked.Later, Bronski and Anna meet with British officials and are granted asylum in England until the war ends. Bronski requests that his troupe be allowed to perform, specifically Bronski's Highlights From Hamlet sketch. While in front of a respectful audience, he recites \"To be or not to be...\" and a young man suddenly rises and begins to excuse himself. Bronski is flustered. Before the closing credits roll, the cast all take congratulatory bows while the actors' names flash on the screen."
        ],
        "summaries": [
          "At the onset of WW2, a Polish actor's family and the Polish Resistance help the troupe of a theatre escape Poland and the invading Nazis.",
          "A bad Polish actor is just trying to make a living when what should intrude but World War II in the form of an invasion. His wife has the habit of entertaining young Polish officers while he's on stage which is also a source of depression to him. When one of her officers comes back on a Secret Mission, the actor takes charge and comes up with a plan for them to escape.",
          "A Polish actor (Frederick Bronski) and his wife (Anna) are renowned actors in Poland at the start of WWII. In the opening, Anna has been receiving flowers from a young pilot who always sits in the second row during the performances, so decides to meet with Lt. Sobinski backstage during her husband's rendition of the soliloquy \"To Be, or Not to Be.\" It is during one of these interviews that word comes of invasion by the Nazis, and everything spins out of control. Sobinski is in England with a band of Polish resisters when he is sent back to Poland on a mission to save the lives of all the Polish Underground. He goes to Anna after parachuting into the country, and the rest of the movie unfolds with a comedic air as Sobinski, the Bronskis, and the theater troupe try to get out of Poland alive."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "1C_NAIUBmFo8GYv0bpM2",
        "_score": 12.016476,
        "title": "The Philadelphia Experiment",
        "year": 2012,
        "genders": [
          "Action",
          "Adventure",
          "Mystery"
        ],
        "score": 4.1,
        "directors": [
          "Paul Ziller"
        ],
        "writers": [
          "Andy Briggs",
          "David Sanderson"
        ],
        "synopsis": [],
        "summaries": [
          "In 1943 a secret government cloaking project goes awry vanishing a navy destroyer. In 2012, the destroyer reappears, setting off a series of events threatening to destroy the world.",
          "In 'The Philadelphia Experiment', a secret government research project tries reviving the World War II \"Philadelphia Experiment,\" which was an attempt to create a cloaking device to render warships invisible. When the experiment succeeds, it brings back the original ship (the Eldridge) that disappeared during the first test in 1943 - which brings death and destruction to the 21st century. It's up to the sole survivor (Lea) of the first experiment and his granddaughter (Ullerup) to stop it.",
          "Military arms manufacturer Grey Water has purchased the rights to a top secret WWII government project called The Philadelphia Experiment which was tasked with discovering the secrets behind invisibility. They have resurrected the project, with the current project team believing they now have the capability. However, in the demonstration, what happens is that the Eldridge, a WWII warship that mysteriously went missing in 1943 and that was associated with the original project, suddenly appears. With the Eldridge comes its one sole survivor on board, Lieutenant Bill Gardner. Gardner is able to escape from the confines of the warship. A secondary side effect of the experiment is that the Eldridge now, on a whim, disappears and then reappears elsewhere on the globe. Gardner's current task is to figure out what happened so that he can make his way back to 1943. Helping him is who he learns is his now adult granddaughter, Molly Gardner, whose fiancé, Deputy Sheriff Carl Reed, is trapped inside the now traveling Eldridge, he who was the first responder on the scene when the Eldridge first appeared. Kathryn Moore, the ruthless administrator of the project for Grey Water, wants to make the Eldridge and everything associated with it go away to protect her name and that of the company, which means destroying the Eldridge and killing Gardner with the help of the singularly minded mercenary for hire, Hagan. However, the chief contracted scientist on the team, Richard Falkner, does whatever he can to stop Moore and save Gardner since he knows that destroying the Eldridge will have catastrophic consequences."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Yy_NAIUBmFo8GYv0boUx",
        "_score": 11.95493,
        "title": "Black Book",
        "year": 2006,
        "genders": [
          "Drama",
          "Thriller",
          "War"
        ],
        "score": 7.7,
        "directors": [
          "Paul Verhoeven"
        ],
        "writers": [
          "Gerard Soeteman",
          "Paul Verhoeven"
        ],
        "synopsis": [
          "At the Kibbutz Stein in Israel in 1956, school teacher Rachel (Clarice van Houten) is reunited with Ronnie (Halina Reijn), a friend from The Hague during World War II. After Ronnie leaves, Rachel reflects on her adventures during the final days of the war.In 1944, Rachel hides from the Nazis in a farm in the Dutch countryside. In exchange for hiding her, they expect her to learn Bible verses. One day, a crippled Allied bomber drops its payload on the farmhouse, killing everyone except Rachel. Rob (Michiel Heisman), a young man from a neighboring farm, hides her in the family's greenhouse. That night, Van Gein (Peter Blok), a police officer, arrives to tell them that the Nazis know that Rachel is in the area and will hunt her down. He agrees to help Rachel and Rob escape to the Allied controlled southern part of Holland. Rachel visits her father's lawyer, Smaal (Dolf de Vries). He gives her enough money and jewels to live on for a year but warns her not to trust people so easily. Van Gein leads Rachel and Rob to a dock where other Jews wait to leave. Rachel is reunited with her parents and brother, who is recovering from an emergency appendectomy. Van Gein does not accompany the Jews on the boat trip. That evening, the boat is ambushed by a Nazi patrol boat. The Nazis immediately open fire; only Rachel survives the massacre. Before drifting down the river, she sees the Nazis loot the corpses.Rachel is found by Resistance fighters who smuggle her into The Hague by disguising her as a typhoid victim and placing her in a coffin that if properly \"sealed\" has sizable air holes. She is taken to a soup kitchen run by another member of the Resistance, Gerben Kuipers (Derek de Lint) and given the new name of Ellis de Vries. Eventually she is made a part of the Resistance's plans to smuggle in British guns and rations. The smugglers are led by Hans Akkermans (Thom Hoffman), an expert marksman. He and Ellis are to pose as husband and wife so the Nazis will not search their luggage on the train; the luggage is actually full of weaponry. But when the Nazi soldiers on the train clearly do intend to search all baggage, a new plan is needed. Ellis takes the bags and enters a private compartment occupied by SD Colonel Müntze (Sebastian Koch). The Nazis don't search Müntze's compartment. Ellis and Müntze are clearly attracted to each other and she accepts an offer to visit him at his office. Hans is clearly jealous.A truck carrying the British guns crashes in front of the soup kitchen. Kuiper's son, Tim (Ronald Armbrust) was driving and is arrested by the Gestapo. While the others go into hiding, Ellis arranges a meeting with Müntze hoping that she can persuade him to release Tim. Knowing he is an avid stamp collector, she takes some rare Dutch stamps to him. He invites her to a Nazi party. There she sees SS commandant Günter Franken (Waldemar Kobus) and recognizes him as the Nazi who led the ambush against the refugee boat. Although she is sickened at his sight, she manages to sing at the party later. She and Müntze return to his suite to make love. He intuits that she is Jewish from her dyed blond hair but has fallen in love with her. She accepts a job in his office and begins work the following day. There she meets Ronnie, who is Franken's secretary/sex partner. Franken gives them a report indicating that Tim has confessed everything and is to be executed, however, Müntze refuses to sign the execution order.Ellis sees Smaal at Nazi headquarters and learns that he and Müntze have negotiated a cease fire -- if the Resistance ceases its attacks against the Nazis, the Nazis will cease its violent reprisals against Dutch civilians. However, when a hidden microphone placed by Ellis in Franken's office reveals that Franken and Van Gein have been working together to kill and rob Jews trying to escape into Allied territory, a controversy amongst the Resistance fighters ensues. Van Gein is heard asking where Franken gets his information as to where the Jews are hiding, which Franken refuses to answer. Ellis wants vengeance for her family but Kuipers refuses to risk breaking the truce because his son will be killed. He betrays a level of anti-semitism when he asks if Jewish lives are any more important than Dutch lives. Behind Kuipers' back, Hans and several others agree to kidnap Van Gein and make it look like he went underground to protect himself. Hans tries to drug Van Gein with chloroform but it doesn't work because the medicine has passed its expiration date. When Van Gein nearly escapes, they are forced to kill him and dump his body in the canal. That night, Müntze confronts Ellis about her participation in the Resistance.Smaal procures the building plans for the Nazi headquarters from a friend at city hall; the building used to be a bank. A plan is devised to sneak into the building during a party in honor of Hitler's birthday. Using information given to him by Ellis, Müntze accuses Franken of hoarding property and valuables confiscated from Jews, a capital offense. When a search of Franken's safe comes up empty, Franken accuses Müntze of negotiating with terrorists -- the Resistance. Müntze is sentenced to death, and Franken announces that forty hostages will be executed in retaliation for the murder of Van Gein. The rescue effort will now be more complex, and Ellis insists that Müntze be one of those liberated because she is in love with him. That night, she leaves a coal chute door open for Hans and the others to enter, then goes to sing at the party. The Resistance members enter the building and free many of the prisoners. However, they are then ambushed by Nazi soldiers. Only Hans and one other Resistance member survive. Franken takes Ellis to his office and uses the hidden microphone, which he knows about, to make it seem like Ellis has been collaborating with him against the Resistance. Kuipers vows to kill her. But Franken already intends to, along with Müntze. That night, Ronnie uses her body as a diversion while another sympathetic soldier frees Ellis and Müntze from their cells.A few days later, the Germans surrender and World War II (in Europe) ends. Ellis and Müntze make their way back to The Hague. They go to see Smaal, who they believe to be the one who had betrayed the Resistance fighters and Jews to Franken. He denies it and claims to have proof of the real culprit which he intends to take to the Canadian military government controlling the city. However, before he can do so, an unknown assailant kills Smaal and his wife. Resistance fighters trap Müntze and Ellis, although she takes Smaal's notebook. Franken attempts to escape by boat with the loot taken from the Jews but Hans kills him.Muntze, in the custody of the Canadian army, is sentenced to death by his former commanding officer, General Käutner, who argues to his Canadian counterpart that Nazi officers still have the authority to punish their own officers for misconduct. Müntze is executed for his contact with Communists in the Resistance. Ellis is kept in a pen with other Dutch accused of collaborating with the Nazis. She and her fellow prisoners are treated deplorably by other local residents, an incident that is broken up by Hans, who berates his countrymen for acting like their Nazi occupiers during the war. Hans, who is now considered a hero of the Resistance, finds Ellis and takes her to his office. On the way, they distribute some chocolate bars to children. In his office, he shows her the money and valuables he took from Franken and reveals that Müntze was executed. Ellis breaks down in tears. Hans tells her that he is giving her a sedative but actually injects her with a lethal amount of insulin. He was the traitor in the Resistance and feels he must kill Ellis to cover his tracks. But when he goes to his window to accept the cheers of an adoring crowd, Ellis wolfs down a chocolate bar to counteract the insulin and escapes with Smaal's black book.She takes the evidence to Kuipers, who is at a nearby mass grave where the body of his son has been uncovered. They leave to find Hans, who is trying to escape the city with the Jewish money and valuables. They find him on a country road, using the same method that was used to smuggle Rachel into the Resistance -- the coffin with the hidden vent. Although he offers to give some of the money to them, Kuipers and Ellis seal off his air supply and let him suffocate to death. On the banks of the river, they debate what to do with the money.In 1956, at the Kibbutz Stein, which was founded with the Jewish money, Rachel and her family disappear behind the fences as armed Israeli soldiers arrive to guard it from an unseen enemy, marking the beginning of the Suez Crisis.In this movie appears Christian Berkel who will later play the role of Fritz Shimon Haber in Haber (2008)."
        ],
        "summaries": [
          "In the Nazi-occupied Netherlands during World War II, a Jewish singer infiltrates the regional Gestapo headquarters for the Dutch resistance.",
          "Israel 1956. Rachel, a Jew, rather unexpectedly meets an old friend at the kibbutz where she is working as a teacher. It brings back memories of her experiences in The Netherlands during the war, memories of betrayal. September 1944. Rachel is in trouble when her hiding place is bombed by allied troops. She gets in contact with a man from the resistance and joins a group of Jews who are to be smuggled across the Biesbosch by boat to the freed South Netherlands. Germans from a patrol boat murder them all however. Only Rachel is able to escape. She is rescued by a resistance group under the leadership of Gerben Kuipers. When Kuipers' son is captured after trying to smuggle weapons, he asks Rachel to seduce SS-hauptsturmführer Ludwig Müntze. Soon she will find out the attack in the Biesbosch wasn't a coincidence.",
          "A young Jewish girl is hiding from the Nazi's during the second world war in The Netherlands. After her hiding place is literally blown, she escapes with her rescuer, a young sailer. Thesame night, as she is hiding with the sailer, she is warned by the dutch resistance that their hiding place is located by the Germans and they're on their way. They run the next day with this man to cross over to liberated areas. That night the boat sails onto a trap of the Germans and they kill every person on it. Rachel escapes and joins the resistance. Under the false name Ellis de Vries she meets a SS-official Ludwig Muntze on a train smuggling weapons. After the son of the resistance leader is captured the meeting comes in handy. She goes to the head quarters to meet him again and gain his trust. He soons falls for her and joins his office as a spy. But when someone within the resistance betrays her she is now seen as the bad guy from both sides. All that's left to do is run with the man she learned to love and find a way to prove her innocence by finding the real betrayer.",
          "Dutch VIP Van Gein, who has excellent German connections, runs a countryside escape route, mainly used by Jews who have been hiding themselves and considerable valuables. A boat full of them is suddenly raided by the Nazis. Rare survivor Rachel Stein joins fellow Jew Gerben Kuipers's spectacularly successful Amsterdam resistance, which includes champion sharpshooter Hans Akkermans. She volunteers to gain entrance to the Nazi HQ by seducing a high officer. Several dangerous games of cat and mouse ensue, exacting bloody tools on both sides. Ultimately traitors are found out, but not necessarily in time.",
          "Set during the end of WWII, Black Book is the story of a Dutch Jewish girl who narrowly survives the war in Holland. She joins the resistance to find out who betrayed her family after all of them were killed in an attempt to reach the liberated south.",
          "In 1944, in the occupied Holland, the Jewish Rachel Stein is hiding from the Nazis in a house of a Christian family. When her hiding place is bombed, Rachel escapes by chance, but she is found by a stranger called Van Gein that invites her to join a group of Jews in a boat to escape to Belgium on the next night. He advises her to bring money and jewels for her survival and very few luggage. Rachel visits lawyer and friend of her family Wim Small that gives her a large amount for her travel. When she meets the refugees, she finds that her family is in the group. While crossing the swamp, a Nazi patrol boat arrives and kills the fugitives, but Rachel is the only one to survive. Later she joins a cell of resistance leaded by the Dutch Gerben Kuipers under the identity of Ellis de Vries; after meeting the Nazi Officer Ludwig Müntze in a train, Kuipers proposes Ellis to work as a spy seducing Müntze. During her assignment, Rachel recognizes Günther Franken as the commander of the attack to the boat of refugees and later she discovers that the murders are part of a scheme with a traitor in the resistance team."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "hC_NAIUBmFo8GYv0bosz",
        "_score": 11.840986,
        "title": "The Way Back",
        "year": 2010,
        "genders": [
          "Adventure",
          "Drama",
          "History"
        ],
        "score": 7.3,
        "directors": [
          "Peter Weir"
        ],
        "writers": [
          "Slavomir Rawicz",
          "Peter Weir",
          "Keith R. Clarke"
        ],
        "synopsis": [
          "During WWII Janusz (Jim Sturgess), a young Polish officer held by Soviets as POW, is interrogated by NKVD (Stalinist secret security police). When the Russians cannot force him to admit he is a spy, they bring his wife in and coerce statements from her condemning Janusz. He is sentenced to 20 years in one a Gulag forced labour camp in remote Siberia.At the camp, Janusz meets an American Mr. Smith (Ed Harris), an actor Khabarov (Mark Strong), a hardened Russian criminal Valka(Colin Farrell), Polish artist Tomasz (Alexandru Potocean), a Latvian priest Voss (Gustaf Skarsgård), a Pole suffering from night blindness Kazik (Sebastian Urzendowsky), and an accountant from Yugoslavia Zoran (Dragos Bucur). Khabarov secretly tells Janusz that he is planing to escape south to Mongolia, passing Lake Baikal. It turns out that it's just Khabarov's fantasy to keep his own morale high, but Janusz decides to implement the plan. He escapes with Mr. Smith, Valka, Voss, Tomasz, Zoran, and Kazik during a severe snowstorm that they rely on to cover their tracks.During the second night of their escape Kazik loses his way back to the group and fire while looking for wood and dies. He's buried that morning by the group. After many days of travel across the snows of Siberia they reach Lake Baikal. There they meet a Polish girl named Irena (Saoirse Ronan), who tells them that her parents were murdered by Russian soldiers and about her escape from a collective farm near Warsaw. Not all the details of her story how she ended up so far away from Europe check out (e.g. Warsaw is still under German occupation), but it turns out that she tried to conceal a more tragic experience. The group let's her join them.When they reach an unpatrolled border between Russia and Mongolia Valka decides to stay, as he still sees Russia as his home country, and Josef Stalin as a hero. The rest continue to Ulaanbaatar, but soon they see images of Stalin and a red star. They realize Mongolia is now a Communist state and they are safe. They decide that they must continue to India. As they continue south, they cross the vast Gobi desert, and face a severe lack of water, sandstorms, skin burned to red-flesh, blisters, and sun strokes. Irena collapses several times and dies, soon followed by Tomasz. Smith seems near death too, but motivated by Janusz rejoins him, Zoran, and Voss. All four find a puddle of muddy water and avoid death.When they get close to the Himalayas, they are guided to a Buddhist monastery, where they are fed and sheltered, regaining their strength. They are advised to wait three months, until spring, to finish the trip to Lhasa, But Smith. the American, decides to go to Lhasa immediately to join American military mission fighting next to Chinese against Japan. The other three continue towards the Himalayas and they soon reach India.At the end of the film, 45 years later and after the fall of communism in Poland, Janusz returns home to reunite with his wife. For all those years he wanted to see his wife again so he could forgive her and she could forgive herself."
        ],
        "summaries": [
          "Siberian gulag escapees travel four thousand miles by foot to freedom in India.",
          "In 1939, three men attempt to flee communist Russia, escaping a Siberian gulag. This movie tells their story and that of four others who escaped with them and a teenage girl, Irena Zielinska, who joins them in flight. The group's natural leader is Janusz Weiszczek, a Pole condemned by accusations secured by torturing his wife, spent much of his youth outdoors, and knows how to live in the wild. They escape under cover of a snowstorm: cynical American Mr. Smith, Russian thug Valka, comedic accountant Zoran, pastry chef Tomasz Horodinsky, who draws, Priest Andrejs Voss, and Polish Kazik, who suffers from night blindness. They face freezing nights, lack of food and water, mosquitoes, an endless desert, the Himalayas, as well as many moral and ethical dilemmas throughout the journey towards freedom.",
          "In 1939, Polish soldier Janusz Weiszczek (Jim Sturgess) is accused of espionage by the Soviet Union. His wife is tortured and Janusz is sentenced to spend twenty years imprisoned in a Siberian gulag. When Janusz is assigned to work in the mines, he feels that the only chance to survive is escaping from the camp. He plots to break out with bitter American Mr. Smith (Ed Harris); the funny Yugoslavian accountant Zoran (Dragos Bucur); the Polish chef and aspirant artist Tomasz Horodinsky (Alexandru Potocean); the Polish Kazik (Sebastian Urzendowsky), who has night blindness; and the Latvian Priest Andrejs Voss (Gustav Skarsgård), and is forced to allow Russian criminal Valka (Colin Farrell) in the group of escapees. Along their journey, they face snow storm, mosquitoes, hunger, the desert, sand storm, thirsty and they meet fugitive teenager Irena Zielinska (Saoirse Ronan), who joins the group.",
          "A small band of multicultural convicts stages a daring escape from a World War II-era Siberian gulag, and embarks on a treacherous journey across five countries in a desperate race for freedom and survival. Adapted from author Slavomir Rawicz's gripping memoir \"The Long Walk: The Story of a Trek to Freedom\", Writer, Producer, and Director Peter Weir's sweeping P.O.W. drama stars Jim Sturgess, Colin Farrell, Ed Harris, and Saoirse Ronan.",
          "1939, shortly after the Soviet invasion of Poland. Sentenced to twenty years of imprisonment in a Stalinist forced-labour Gulag camp, Janusz, a young Polish army officer, sets foot in frozen Siberia. Amid harsh and inhumane detention conditions, Janusz would rather risk life and limb to take his chance in the unforgiving wilderness, and before long, plans his escape with a group of equally desperate anti-Soviet convicts. And, as the team flees the horrible prison, a peril-laden journey to freedom in the heart of winter commences. Now, thousands upon thousands of kilometres of hostile terrain await the audacious POWs. Is escape only the beginning?",
          "In 1940, seven prisoners attempt the impossible: escape from a brutal Siberian gulag. Thus begins a treacherous 6000-kilometre trek to freedom across the world's most merciless landscapes. They have little food and few supplies, but together, they must withstand nature at is most extreme."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "sS_NAIUBmFo8GYv0bpk4",
        "_score": 11.7148,
        "title": "Labyrinth of Lies",
        "year": 2014,
        "genders": [
          "Drama",
          "History"
        ],
        "score": 7.3,
        "directors": [
          "Giulio Ricciarelli"
        ],
        "writers": [
          "Elisabeth Burghardt",
          "Giulio Ricciarelli",
          "Amelie Syberberg"
        ],
        "synopsis": [
          "In 1958, Johann Radmann is a young and idealistic public prosecutor who takes an interest in the case of Charles Schulz, a former Auschwitz extermination camp commander who is now teaching at a school in Frankfurt am Main. Radmann is determined to bring Schulz to justice, but finds his efforts frustrated because of the many former Nazis who are serving in government and looking out for one another.Radmann's boss, the prosecutor-general Fritz Bauer, puts him in charge of investigating former workers at the Auschwitz camp. The U.S. occupation forces give him access to their files, and he discovers there were 8,000 workers. He goes after Josef Mengele, who lives in Argentina, but flies back to West Germany to visit his family. After the authorities block Radmann's attempt to issue an arrest warrant, his boss warns him off and orders him to concentrate on lower-profile suspects. The department invites Mossad agents to visit, and shares its information with them. As a result, Adolf Eichmann is kidnapped and spirited away to Israel where he is tried, convicted and executed for his crimes. Having pulled off this coup, Israel declines to pursue Mengele.Meanwhile, Radmann allows himself to be seduced by Marlene, a seamstress who, benefiting from Radmann's connections, starts a business as a dress designer. Radmann reaches a crisis when he discovers his own father was in the Nazi party. When he tells Marlene that her father too was in the party, she ends their relationship. By the end of the film, however, there is a chance she will have him back. He resigns his official post and goes to work for an industrialist. There he is again confronted with the dilemma: do what is right; or do what the system requires you to do?When he finds this means working with a colleague who had defended a former Nazi he was investigating, Radmann walks out. His idealism has suffered from hard encounters with the real world; at every turn, the \"system\" wants compliance, but he wants justice. He comes to understand that the only thing that can ease the horror is not justice, but attention to the lives and stories of those who suffered. Growing out of the simplistic right/wrong moralizing, he comes to understand life as more complex, and seeks to repair all the damage, large and small, he inflicted in his zeal.After going to Auschwitz to say kaddish, the Jewish mourning prayer, for a friend's two daughters who were killed there, he goes back to work for the West German state prosecutor. The film ends with the opening of the trial of several hundred former Auschwitz workers."
        ],
        "summaries": [
          "A story that exposes the conspiracy of prominent German institutions and government branches to cover up the crimes of Nazis during World War II.",
          "The year is 1958. The war has been over for thirteen years and the Federal Republic of Germany is not only recovering but even booming. But where are the Nazis? Who has ever heard of the death camps? It looks as if everything is for the best in the best of all possible worlds in this land of milk and honey - At least, until the day journalist Thomas Gnielka reports on the recognition by a German-Jewish artist of a local schoolteacher, a former guard at the Auschwitz concentration camp - At least, until Johann Radmann, a young prosecutor, decides to investigate the case - Nobody knows it yet but this is the dawn of a new era. Even if the road to awareness will be long and rocky.",
          "In late-1950s Frankfurt--in the aftermath of the shocking Nuremberg trials, thirteen long years after the end of WWII, and with Germany eager to return to normalcy--the idealistic and ambitious young public prosecutor, Johann Radmann, daringly accepts a case about a Waffen SS guard in Auschwitz. Now--as more than 8,000 people worked at the nightmarish death camp, and with the infamous war criminal, Josef Mengele, enjoying a tranquil life in Argentina--the righteous attorney undertakes the herculean task to unearth evidence in the mounds of dusty files at the U.S. Army Document Center. Teachers, doctors, lawyers, workers, neighbours, and fathers, almost everybody has a skeleton in the closet. What will it take to find the truth in the labyrinth of silence?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "AC_NAIUBmFo8GYv0boEv",
        "_score": 11.394188,
        "title": "Focus",
        "year": 2001,
        "genders": [
          "Drama",
          "Romance"
        ],
        "score": 6.7,
        "directors": [
          "Neal Slavin"
        ],
        "writers": [
          "Arthur Miller",
          "Kendrew Lascelles"
        ],
        "synopsis": [],
        "summaries": [
          "In the waning months of World War II, a man and his wife are mistakenly identified as Jews by their anti-Semitic Brooklyn neighbors. Suddenly the victims of religious and racial persecution, they find themselves aligned with a local Jewish immigrant in a struggle for dignity and survival.",
          "WWII. In Brooklynite Lawrence Newman's world, many around him do not understand why Christian society based United States would be in war against Christian society based Germany. A milquetoast, Lawrence, a Presbyterian and WWI vet, has been working for the same company for twenty years and is only at a mid-level job overseeing the steno pool, is unmarried, and is still living at home with his invalid but overbearing widowed mother. At work, he turns down the job application of Gertrude Hart, as he believes she is trying to hide being Jewish. He is not anti-Semitic per se, but does not have the backbone to stand up to anyone or any group that is, or do anything about the world that does not negatively affect him personally, like the rape he secretly witnessed committed by one of his neighbors. Regardless, he can't stop thinking about Gertrude. He soon understands her anger in not being hired as he begins to face discrimination, even in what he would have considered the most unlikely places, when he gets a new pair of glasses which make him look Jewish. It isn't until he runs into Gertrude again and begins to spend time with her that he gets a clearer picture of the issue and what he needs to do as a start to live a happy life in a peaceful world free of discrimination, even if it is at an initial personal cost."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "qS_NAIUBmFo8GYv0boMw",
        "_score": 9.725254,
        "title": "The Notebook",
        "year": 2004,
        "genders": [
          "Drama",
          "Romance"
        ],
        "score": 7.8,
        "directors": [
          "Nick Cassavetes"
        ],
        "writers": [
          "Jeremy Leven",
          "Jan Sardi",
          "Nicholas Sparks"
        ],
        "synopsis": [
          "In a modern-day nursing home, an elderly man named Duke (James Garner) begins to read a love story from his notebook to a female fellow patient (Gena Rowlands).The story begins in 1940. At a carnival in Seabrook Island, South Carolina, local country boy Noah Calhoun (Ryan Gosling) sees seventeen-year-old heiress Allie Hamilton (Rachel McAdams) for the first time and is immediately smitten. She continuously refuses his persistent advances until their well-meaning friends lure them together; they then get to know each other on a midnight walk through empty Seabrook.Noah and Allie spend an idyllic summer together. One night, a week before Allie is to leave town, she and Noah go up to an abandoned house called The Windsor Plantation. Noah tells her that he hopes to buy the house, and Allie makes him promise that the house will be white, with blue shutters, a walk-around porch, and a room that overlooks the creek so she can paint. They intend to make love for the first time, but are interrupted by Noah's friend Fin (Kevin Connolly) with the news that Allie's parents have the police out looking for her. When Allie returns home, her disapproving parents ban her from seeing Noah again. Allie fights with Noah outside and the two decide to break up. Allie immediately regrets the decision but Noah drives away. The next morning, Allie's mother reveals that they are going home that morning. Allie frantically tries to find Noah, but is forced to leave without saying good-bye. The Hamiltons then send Allie to New York, where she begins attending Sarah Lawrence College. Noah, devastated by his separation from Allie, writes her one letter a day for a year, only to get no reply as Allie's mother keeps the letters from her. Noah and Allie have no choice but to move on with their lives. Allie continues to attend school, while Noah and Fin enlist to fight in World War II. Fin is killed in battle.Allie becomes a nurse for wounded soldiers. There, she meets the wealthy Lon Hammond, Jr. (James Marsden), a well-connected young lawyer who is handsome, sophisticated, charming and comes from old Southern money. The two eventually become engaged, to the joy of Allie's parents, although Allie sees Noah's face when Lon asks her to marry him.When Noah returns home, he discovers his father has sold their home so that Noah can go ahead and buy The Windsor Plantation. While visiting Charleston to file some paper work, Noah witnesses Allie and Lon kissing at a restaurant, causing Noah to go a little crazy, convincing himself that if he fixes up the house, Allie will come back to him.While trying on her wedding dress in the 1940s, Allie is startled to read about Noah completing the house in the style section of a Raleigh newspaper and faints. She visits Noah in Seabrook and he invites her to dinner, during which Allie tells Noah about her engagement. Noah questions whether Allie's future husband is a good man and she reassures Noah that he is. Later in the evening, Noah invites Allie to come back tomorrow.In the present, it is made clear that the elderly woman is Allie suffering from dementia, which has stolen her memories and Duke is her husband. Allie does not recognize their grown children and grandchildren, who beg Duke to come home with them. He insists on staying with Allie.The next morning, Allie and Noah go rowing on a nearby lake and begin to reminisce about their summer together. As a rain storm starts Noah rows to shore, where Allie demands to know why Noah never wrote to her. After the revelation that Noah had indeed written to Allie, they share a passionate kiss, before making love into the night.The next day, Allies mother appears on Noah's doorstep, telling Allie that Lon has followed her to Seabrook after Allie's father told him about Noah. Her mother takes Allie out for a drive to show her that there had been a time in her life when she could relate to Allie's present situation. On returning to Noah's, she hands her daughter the bundle of 365 letters that Noah had written to her. When alone, Noah asks Allie what she is going to do; Allie is confused and confesses that she doesn't know. Noah asks her to just stay with him, admitting it is going to be really hard, but he is willing to go through anything because he wants to be with her. Confused as ever, Allie drives off.Allie drives to the hotel and confesses to Lon, who is angry but admits that he still loves her. He tells her that he does not want to convince his fiancée that she should be with him, but Allie tells him he does not have to, because she already knows she should be with him.The film goes back to the elderly couple, and Duke asks Allie whom she chose. She soon realizes the answer herself; young Allie appears at Noah's doorstep, having left Lon at the hotel and chosen Noah. They embrace in reunion.Elderly Allie suddenly remembers her past before she and Noah/Duke joyfully spend a brief intimate moment together; after originally finding out about her illness, she had herself written their story in the notebook with the instructions for Noah to \"Read this to me, and I'll come back to you.\" But soon Allie relapses, losing her memories of Noah yet again. She panics, and has to be sedated by the attending physician. This proves to be too difficult for Noah to watch and he breaks down. The next morning, Noah is found unconscious in bed and he is rushed to the hospital; he later returns to the nursing home's intensive care ward. He goes to Allie's room later that night, and Allie remembers again. The next morning, a nurse finds them in bed together, having both died peacefully holding each other's hands. The last scene shows a flock of birds flying away."
        ],
        "summaries": [
          "A poor yet passionate young man (Ryan Gosling) falls in love with a rich young woman (Rachel McAdams), giving her a sense of freedom, but they are soon separated because of their social differences.",
          "In a nursing home, resident Duke (James Garner) reads a romance story to an old woman (Gena Rowlands) who has senile dementia with memory loss. In the late 1930s, wealthy 17-year-old Allie Hamilton (Rachel McAdams) is spending summer vacation in Seabrook. Local worker Noah Calhoun (Ryan Gosling) meets Allie at a carnival and they soon fall in love with each other. One day, Noah brings Allie to an ancient house that he dreams of buying and restoring and they attempt to make love but get interrupted by their friend. Allie's parents do not approve of their romance since Noah belongs to another social class, and they move to New York with her. Noah writes 365 letters (one a day for a year) to Allie, but her mother Anne Hamilton (Joan Allen) does not deliver them to her daughter. Three years later, the United States joins the World War II and Noah and his best friend Fin (Kevin Connolly) enlist in the army, and Allie works as an army nurse. She meets injured soldier Lon Hammond (James Marsden) in the hospital. After the war, they meet each other again going on dates and then, Lon, who is wealthy and handsome, proposes. Meanwhile, Noah buys and restores the old house and many people want to buy it. When Allie accidentally sees the photo of Noah and his house in a newspaper, she feels divided between her first love and her commitment with Lon. Meanwhile, Duke stops reading to the old lady since his children are visiting him in the nursing home.",
          "In a care facility, Duke (James Marsden), a resident, has to get permission to read to fellow resident, Ms. Hamilton (Gena Rowlands), on a daily basis, as Ms. Hamilton's health is deteriorating, she who has Alzheimer's. The story is always the same one, which he reads out of his notebook, and which she sometimes remembers that she has heard before, is captivated by but cannot remember how it turns out. It details the love affair between Noah (Ryan Gosling) and Allie (Rachel McAdams) beginning in 1940 in Seabrook Island, South Carolina, when Allie was 17 and on the brink of her college life, most likely at Sarah Lawrence in faraway New York. Their relationship was improbable because of their differing social classes and outlooks which led to their relationship being characterized by constant arguments with each other out of their passion. While Noah was a carefree and working class local who had a 40-cent/hour job at a lumber yard, Allie was from a privileged family, her mother (Joan Allen) who grew up in Seabrook Island and where they were staying only for the summer. There were many obstacles to a Noah/Allie happy ending, most specifically WWII and her parents, especially her mother, who did not approve of the relationship and did whatever she could to end it. That happy Noah/Allie ending is not a guarantee due to these obstacles. As the story progresses and as the daily realities of present day occur, the reason why Duke feels the need to tell Ms. Hamilton the story and what he hopes she gets out of it become more and more evident.",
          "With almost religious devotion, Duke (James Garner), a kindly octogenarian inmate of a peaceful nursing home, reads daily a captivating story from the worn-out pages of his leather-bound notebook to a fellow Alzheimer's-stricken woman (Gena Rowlands). To keep her company, Duke recounts the fascinating love affair of the impecunious but poetic country boy, Noah (Ryan Gosling), and the affluent city girl, Allie (Rachel McAdams), unfolding, little by little, a lumber-scented Southern summer romance beneath the trees of late-1930s North Carolina. More and more, the silver-haired patient finds herself immersed in the strangely alluring fairy tale of the young ardent lovers' highs and lows as if the silent manuscript possessed the unfathomable power to penetrate the opaque clouds that shroud her sad soul. But, what does the future have in store for Allie and Noah? Are all summertime idylls doomed to fail?",
          "The movie focuses on an old man (James Garner) reading a story to an old woman (Gena Rowlands) in a nursing home. The story he reads follows two young lovers named Allie Hamilton (Rachel McAdams) and Noah Calhoun (Ryan Gosling), who meet one evening at a carnival. But they are separated by Allie's parents who disapprove of Noah's unwealthy family, and move Allie away. After waiting for Noah to write her for several years, Allie meets and gets engaged to a handsome young soldier named Lon (James Marsden). Allie, then, with her love for Noah still alive, stops by Noah's 200-year-old home that he restored for her, \"to see if he's okay.\" It is evident that they still have feelings for each other, and Allie has to choose between her fiancé and her first love.",
          "An old man (James Garner) in a nursing home reads a story to an old woman (Gena Rowlands) each day. The story he reads follows two young lovers named Allie Hamilton (Rachel McAdams) and Noah Calhoun (Ryan Gosling). They met one evening at a carnival many years ago. But Allie's parents separate Noah and Allie. They disapprove of Noah's lack of wealth, and move Allie away. After waiting for Noah to write her for several years, Allie meets and becomes engaged to a handsome young soldier named Lon (James Marsden). In a local newspaper, Noah's picture catches Allie's eye. He is standing in front of his fully restored, 200-year-old home. The article is filled with praise for his accomplishments. Allie's heart nearly bursts. The last time she saw this house it was a rotted decaying shamble. She stood enfolded in Noah's arms in the great entryway and listened to his plans to buy and restore this house. Just the way she wanted it. With her love for Noah still alive, the picture pulls at her heart. She has to go back, see if Noah is okay, and tell him about her marriage. They both think the echo deep in their hearts, the one that has lasted all these years, is not shared by the other. The cry they could not stifle. It wasn't over for me."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "jy_NAIUBmFo8GYv0bocx",
        "_score": 9.527387,
        "title": "Captain America: The First Avenger",
        "year": 2011,
        "genders": [
          "Action",
          "Adventure",
          "Sci-Fi"
        ],
        "score": 6.9,
        "directors": [
          "Joe Johnston"
        ],
        "writers": [
          "Christopher Markus",
          "Stephen McFeely",
          "Joe Simon"
        ],
        "synopsis": [
          "Bright headlights cut through a thick sheet of snowflakes. A scientist, bundled as warmly as possible, treks through the sleet. Two other men, in matching black cold-weather uniforms, approach the scientist. He leads them to an excavation site which is easily the size of a football field; at the center of the site appears to be a giant wing and fuselage. The black-suited men cut through the fuselage of the mystery craft and enter. Inside they find the remains of a massive, frozen ship. One of the men brushes away at the snow and sees a shimmering red, white, and blue shield encased in ice.Tonsberg, Norway, 1942:Two caretakers for an ancient Viking ruin listen as their town is overrun by Nazis. Suddenly the front door blasts open and in flood multiple Nazi agents. One of the caretakers is killed in the blast and the other frantically begs that the soldiers leave him in peace. They pay no attention to the old man and instead open the building's crypts one-by-one. They come to one sarcophagus whose lid is too heavy to lift. A dark figure appears in the exploded entryway. Johann Schmidt (Hugo Weaving), a high-ranking Nazi and leader of the HYDRA sect, nonchalantly enters. He crosses the room, comes to the difficult-to-open sarcophagus and easily pushes the lid free. Within he finds the skeletal remains of an old Viking clutching a glass cube (the Tesseract). The caretaker pleads for Schmidt to leave it. Schmidt scoffs and tells how this cube would be the jewel of Odin's treasury if it weren't a fake. He smashes it on the floor and goes to the caretaker, asking where the real cube is hidden. The caretaker initially refuses but under threat of harm to his family, he relents, gesturing to a hidden drawer across the room, part of an ancient carving the size of the wall. Schmidt pries the drawer open and finds the real, glowing cube concealed within. Schmidt orders his men to shell the city and then shoots the luckless caretaker.At a recruiting station in Brooklyn, Steve Rogers (Chris Evans), a 20-something, 90 lb, 5-foot tall asthmatic eagerly awaits the opportunity to enlist in the United States Army. The army doctor gives a once-over to Steve's medical file, which reads like that of a 90 year old man, and rejects Steve's application as the military 4-F, as this is his fourth failed attempt to enlist.Distraught, Steve heads to the movies. He envies the enlisted men featured in the pre-show newsreel, and watches as other audience members tear up. A loud-mouthed, impatient movie-goer begins yelling at the screen \"Start the movie! I didn't pay to see this crap!\" Steve tells the man to shut up, and is surprised as the man turns around, stands up and towers above him. In the alley behind the theater the bully savagely beats the scrawny Steve, who bravely fights back, but is easily overpowered. When his opponent asks him why he won't simply give up, the bloodied Steve says \"I can do this all day.\" James \"Bucky\" Barnes (Sebastian Stan), Steve's best friend, comes running to the alley. He swiftly kicks the bully away and tends to Steve, who is annoyed that Bucky showed up and got rid of the bully just as Steve got his second wind. \"Bucky\" is now an enlisted-man. His application was accepted and he's been assigned to the 107th infantry.In a celebratory mood, Bucky invites Steve to go dancing with a pair of girls on a double date. Bashfully, Steve tags along. The four head to the World's Fair in Queens. While Bucky canoodles with his dates, Steve watches as playboy inventor Howard Stark (Dominic Cooper) unsuccessfully demonstrates a flying car. Steve breaks away from the group and goes to another recruiting station. Bucky catches up with him and asks how Steve intends to forge his application this time. Unbeknownst to them both, Dr. Abraham Erskine (Stanley Tucci) while passing by, eavesdrops on their conversation. He is fascinated by the gumption of Steve. Bucky wishes Steve good luck on his latest application and Steve heads in to the recruiting station for his fifth physical. Inside Steve sits on an examination table and grows nervous when an MP enters the room, and is soon followed by Dr. Erskine. Dr. Erskine has all of Steve's prior applications on file. Concerned by Steve's failed applications, Erskine tests his character by asking if his insistence on applying for military service is driven purely by a desire to kill Nazis. The young man sincerely reveals that he is not a killer at heart, but does not like \"bullies\" regardless of their origin; he also shows little concern when Erksine reveals that he is German by birth. Won over by Steve's strong will and unwavering conviction, Erksine accepts his latest application.In a secret military installation high in the Alps, Johann Schmidt brings the glowing cube to Dr. Arnim Zola, his Hydra weapon specialist. The cube's seemingly limitless power enables Schmidt and Dr. Zola to power unstoppable energy guns and cannons.Meanwhile, Steve has been enlisted into basic training under the careful watch of Dr. Erskine and Colonel Chester Phillips (Tommy Lee Jones). He and his platoon are told that they are candidates for the government's latest Super Soldier program. Phillips is unimpressed with Steve and is vexed by Dr. Erskine's interest in him. During basic training Steve meets a beautiful but driven British officer, Peggy Carter (Haley Atwell), who seems to pity him. Despite being the smallest and weakest of the platoon, Steve demonstrates the greatest spirit, selflessness and ingenuity, especially when his platoon are charged with retrieving a flag from the top of a tall pole: as the other, more fit men in the company fail the task one by one as they try to climb up the pole, Steve casually pulls the pin holding it up, taking the flag when the pole crashes to the ground. Phillips, still unconvinced, tosses a grenade into the group during calisthenics and they all scatter. Phillips is surprised when Steve alone leaps on top of it, willing to sacrifice himself to save the others, before discovering that the grenade was a dummy. Phillips concedes to Erskine's decision.That evening, Dr. Erskine speaks with Steve. The two bond over a bottle of Schnapps and Dr. Erskine reveals that this is not his first time performing this experiment. He tells a story of how, prior to his emigration to the US, he was ordered by Johann Schmidt to create a serum that would give a man god-like strength. Dr. Erskine created an early version of the serum he intends to use on Steve, only when Schmidt injected himself his body's skin corroded away, leaving him as a sinewy red skeleton. Undeterred by the risk, Steve agrees to follow through with the procedure.The following morning Steve and Peggy wind their way through Brooklyn and come to a stop in front of an old antique shop. Along the way Steve points out various parts in Brooklyn where he's been beaten up. She asks him why he never ran away. He responds that running away, in his mind, was an invitation for further abuse.The two enter the antique shop, exchange pass-codes with an old woman manning the register, and descend into a secret military bunker concealed within. Peggy leads Steve to the heart of the bunker where they find Dr. Erskine preparing a medical capsule along with Howard Stark, and Colonel Phillips rubbing elbows with senators and dignitaries. Steve is told to remove his shirt and sit in the capsule. Stark describes that the procedure will first mean injecting muscle re-generators into Rogers' major muscle groups which will then be bombarded with \"vita rays.\" Erskine has made no secret of the pain Steve will endure but promises he'll come out stronger. Carter bids Steve good luck and joins Phillips in the overhead viewing chamber. Erskine's serum is injected into Steve's muscles and Steve is enclosed within the vita ray capsule. The capsule glows brightly, Steve yells in pain but also tells them to continue and the procedure is quickly completed. When the capsule is shut down, Steve comes out a foot taller and a hundred pounds heavier with solid muscle, which is just the most superficial aspects of his body artificially raised to the maximum human potential.Everybody, including Phillips, celebrates the success of the procedure, and descends from the viewing chamber to congratulate Erskine. A lone dignitary, in actuality a German spy named Heinz Kruger (Richard Armitage), stays behind, placing a small satchel on a chair. Moments later the viewing gallery explodes. Kruger descends the stairs and fatally shoots Dr. Erskine twice. He swiftly kills the guards and flees onto the streets with Peggy in hot pursuit. Steve tends to a dying Dr. Erskine, who has just enough energy to point to Steve's heart before he dies. Steve bolts out of the bunker, in pursuit of Kruger.In the street Peggy pursues Kruger, and easily kills his getaway driver. Kruger steals a taxi and aims to run over Peggy. Steve arrives in the nick of time, saving her from being killed by the on-coming taxi. Steve pursues the taxi on foot, running faster than a normal human can (and not suffering the fatigue even a healthy man would). Displaying superhuman agility, he leaps onto the roof of the taxi, dodges Kruger's gunfire and the two come to a crashing stop at the Brooklyn docks. Kruger shoots at Steve, who holds the star-imprinted door of the wrecked cab in front of him as a shield. Kruger flees to his Hydra sub, which dives underwater just as Steve arrives. Steve dives after the sub, punches a hole through the cockpit's glass and yanks Kruger to the surface. Kruger tells Steve that he is the first of many, that Rogers can \"cut off one head,\" but two more take it's place.\" He then kills himself with a cyanide capsule hidden in a fake tooth, letting out one last \"Heil HYDRA!\" before dying.Meanwhile, Schmidt and Dr. Zola are visited by a trio of Hitler's top commanders, tasked with inspecting Schmidt's operation. They ridicule Schmidt, saying that the Nazi party no longer takes him and HYDRA seriously due to his obsession with magic and the occult and playfully refer to him as \"The Red Skull\", a name that infuriates Schmidt. Schmidt takes the three to his weapons lab where they are shown his unstoppable energy weapons and a strategic map of Europe dotted with targets. One of the three notices a target hovering over Berlin and confronts Schmidt. Schmidt quickly vaporizes the three Nazi officers. Schmidt announces that HYDRA has disbanded from the Nazi party and is now enemies with the world.The following day Phillips and Carter pick up the remains of Dr. Erskine's lab. Both are despondent because the only person capable of producing the serum was Erskine himself. Steve is eager to go the front lines of the European Theatre but Phillips would rather he be a lab-rat than a soldier in his army. Steve is approached by a senator holding a newspaper of the prior day's events, emblazoned with a front-page photo of Steve chasing down Heinz Kruger. Steve has become an overnight celebrity and the Senator has an idea that will be mutually beneficial.Steve is enlisted in the USO (United Service Organizations), and travels around the Midwest, promoting war bonds and performing musical numbers in a shoddy red, white and blue costume while carrying a triangle-shaped shield bearing the stars-and-stripes. He takes on the name \"Captain America\" and the show includes a theme song written specifically for him, features dancing girls and a short segment where he punches out Hitler, played by an actor. Captain America becomes an overnight success, spawning comic books and black and white movies. His antics drum up revenue for the USO.Steve is soon taken overseas, to Italy, where he is to continue entertaining the troops. Upon his arrival the surly and war-torn men tease him and tell him to get lost. He is soon met by Carter, who along with Phillips, is overseeing European Theatre of the war. She tells him that the men are unhappy because many men from their division, the 107th Infantry, have been killed in battle. Steve realizes that this is Bucky's division, and quickly runs to see Phillips. Phillips is unable to find Bucky's name on his casualty list and tells Steve to go back to his job as a movie star and a cheerleader. Steve asks Carter where the men, and Bucky, are being held. She shows him a map, and a known HYDRA weapons factory 30-40 miles behind enemy lines. Steve hastily pulls on a pair of army trousers and leather jacket over his Captain America costume, and a blue helmet with a white 'A' stamped on the front. He aims to steal a jeep and drive into HYDRA's back yard, but she has a better idea.Howard Stark flies them both over the battlefield in his private plane. Steve surmises that Stark and Carter have a relationship and bashfully withholds his feelings for her. Just as anti-aircraft guns from HYDRA begin firing on Stark's plane, Steve parachutes in, while the other two escape back to safety. Steve stealthily makes his way into the HYDRA base, taking out numerous guards in the process.Inside, Schmidt and Zola are manufacturing enough weapons to wipe out every capital in the world. Steve makes his way to the holding cells where he sees hundreds of imprisoned men from the 107th. He frees the men and tells them to make a \"messy\" exit. Under the leadership of the \"Howling Commandos\" the prisoners manage to overpower their captors, steal guns and tanks, and escape from the facility, destroying much of it. Schmidt watches Steve by CCTV, and quickly realizes that he must be Erskine's man. He quickly activates several explosive charges that will level the base.Steve makes his way through the facility and happens across Bucky, who is tied down to an operating table, and has quite obviously been tortured. Steve also notices an oversized tactical map mounted on the wall, with various marked installations. Steve frees Bucky, who is surprised to see that Steve is taller than him, and commits the map to memory.The two head up the catwalks and find themselves face to face with Schmidt on a retractable bridge. Rogers punches Schmidt, who surprisingly stands his ground. Schmidt plays with his face, which has apparently come free from his skull, and quickly peels it away as a mask. The Red Skull stares back at Rogers and Bucky and swiftly enters an elevator. In the elevator The Red Skull tells Arnim Zola to meet him at another one of Hydra's bases and to take his car. The Red Skull escapes the exploding facility in a strangely-designed private plane while Zola sneaks away in Schmidt's roadster. Inside Steve and Bucky have a huge divide to cross to their freedom. Bucky crosses a trembling, buckling support beam and manages to cross to safety moments before the beam plummets into the fire below. Left with no other option, Steve backs up as far as he can and leaps over the burning chasm.Back at the 107th base camp, Phillips dictates a letter to his typist, telling how Rogers disappeared the prior night and likely perished during the battle. At that, Phillips berates Agent Carter for causing this loss and notes that unlike the indispensable Stark, she herself can be punished. Carter attempts to justify her actions, but Phillips bluntly dismisses her opinions considering that the loss of Rogers, the only successful test subject of Project: Rebirth, would be ample justification to close down their organization. Just then, Rogers arrives, with nearly 400 survivors of the 107th carrying samples of the Red Skull's technology including some combat vehicles leaving the base in a fervor. Rogers submits himself to Phillips for disciplinary action for going out in direct violation of orders, but is forgiven. At this success, Bucky calls for cheers for Rogers, who has truly become Captain America.The news of \"Captain America's\" success on the battlefield has swept over the world, but Rogers does not appear for his medal from Congress. The reason for that absence is in London, where Steve gives Phillips and Carter his best recollection of the HYDRA base map and tells them that he intends to go to those bases and destroy them one by one, and wishes to recruit a team of men made up of those he liberated in Italy. Steve meets the Howling Commandos in a bar and they eagerly accept the offer. While there all the men are surprised as Peggy enters dressed in a form-fitting cocktail dress. She ignores all the men, including Bucky, and flirts with Steve, telling him that she'd love to have a dance with him some day.The next day Steve is summoned to the Brooklyn bunker to see Phillips and Stark. Steve is approached by a beautiful female officer who wishes to thank him for his service the best way she knows how. Peggy walks in on Steve kissing the enlisted-woman and angrily storms away. Steve apologetically follows her to Stark's lab, insisting that he gets nervous around women and asks why he should apologize if Carter and Stark have a thing going. Stark quickly shoots down the rumored relationship and takes Steve to his weapons engineering lab. He remarks that Rogers has become attached to the triangular shield, which Steve says is a handy tool in the field. On a table are several prototype shields with sophisticated components, however Steve finds a plain, circular shield on a lower shelf. Stark explains that the shield is made of a metal called \"vibranium\", which is lighter than steel and is vibration resistant and will absorb heavy impacts. He holds the shield in front of him and asks Peggy for his opinion. She playfully/scornfully fires a clip from a .45 pistol at the shield, which Steve ducks behind. The shield passes the improvised test admirably. As she walks off, Steve passes a sketch of a uniform to Stark.Steve dresses in red, white and blue fatigues, dons a blue form-fitting helmet and stows the newly-colored shield onto his back. Captain America and his soldiers, including Bucky, make their way across Europe, flattening Hydra's bases one by one, with Rogers becoming quite skilled at using the shield as a projectile weapon and also discovering that it can ricochet off several surfaces and lot lose any velocity. News of his exploits reach the Red Skull and Zola. The Skull is furious, referring to Rogers as a \"simpleton with a shield\" and murders the last man alive at one of his destroyed facilities.High in the Alps, Steve and his men have a mission to capture Zola in his personal train. Three members of the team, Cap, Bucky and Gabe Jones (Derek Luke), zip-line across a massive chasm and storm the train car by car. Soon Cap and Bucky are cornered by heavily armed Hydra soldiers. They narrowly defeat the soldiers, however Bucky is tossed from the train and plummets into an icy river below. Zola is apprehended.Zola sits in a prison cell and is visited by Colonel Phillips, who brings him a steak dinner. Zola rejects the meal, convinced that it must be poisoned. Phillips shrugs and eats it himself. He tells Zola that he broadcast an easily decipherable message, which has certainly been intercepted by HYDRA, saying that Zola had defected. He also knows that Zola is easy to bargain with since he's the sole HYDRA agent they've captured who hasn't taken his cyanide capsule to avoid disclosing information. Zola, fearing that the lie will result in his death by the Red Skull, gives in to Phillips and tells him information of the Red Skull's only remaining HYDRA base.Rogers sulks in a war-ravaged bar. Carter arrives and comforts Steve over the loss of his best friend. Steve realizes that Dr. Erskine's serum rapidly regrows dead cells, making it impossible for him to get drunk. The two flirt a bit and talk about having a dance, once again.Rogers and his team prepare a battle plan to take down Red Skull at his headquarters. Rogers, dressed in a new uniform, mounts a Harley and charges the base. He easily dodges HYDRA soldiers and tanks and finds himself within the base, surrounded by a HYDRA army. He is taken into custody and led to the Red Skull's private weapons lab. Red Skull asks what makes Steve so special. Steve says \"Nothing, I'm just a kid from Brooklyn,\" moments before members of his team zip-line into Red Skull's office.A climatic firefight ensues, as hundreds of soldiers under the direction of Phillips and Carter storm the base, killing many HYDRA soldiers. Red Skull flees to his private hangar, in which a gigantic flying wing, powered by the Tesseract, is preparing for take off. Steve attempts to catch up with the plane on foot, but is unable. Phillips and Carter arrive in the Skull's roadster, and the three take off after the plane. Just as Steve is about to leap onto the plane Peggy stops him and kisses him. Steve leaps from the roadster onto one of the plane's massive wheels. He sneaks into the craft where he finds dozens of kamikaze planes/missiles, each labeled with a different major American city. Hydra soldiers soon enter the room and Steve battles them, taking out numerous men and tiny planes. One of the planes, labeled New York, drops free. Steve takes off after it and manages to commandeer the craft and crashes it back into the flying wing after throwing the pilot through its rearward mounted propeller.Inside the large cockpit, Captain America and Red Skull have a fisticuffs battle. Red Skull fires his cube-energy pistol at Steve who easily deflects the shots using his shield. A shot is deflected into one of the cockpit's center consoles which contains the glowing blue cube. The console is damaged and Skull lifts the cube into the air. Suddenly a portal opens above him, showing starry space. The Red Skull glows brightly and is seemingly disintegrated. His remains are swept up into the cosmos. The cube, still glowing brightly, drops to the ground and burns its way down through the plane's hull before plummeting into the ocean below. Steve mans the plane's controls and radios Carter. He tells her that the plane is on a flight-path that will take them to the Eastern Seaboard. He tells her that their dance will have to wait. He pushes the plane into a dive and crashes it into a glacier below. Peggy can only hear static.Steve awakens in a 1940's hospital. An old-fashioned radio transmits the play-by-play of a Brooklyn Dodgers game. He gets up, looks out the windows and watches as the hospital door opens. A young nurse (Amanda Righetti) who bares a striking resemblance to Peggy enters. She waits for a response from Steve, who looks her over suspiciously. He asks why the radio is playing a game from May 1941... specifically, a game that he knows he attended. She reaches into her pocket and withdraws a two-way radio. Two tall soldiers in black uniforms enter the room, and Steve easily tosses them through a wall. Steve steps through the hole and is surprised to see that the 'hospital' is in fact a movie-set. He runs through the dark corridors, pushes a door open, and finds himself in a modern skyscraper bustling with people in business suits. He flees the building and finds himself in Times Square, circa 2011. He peers around, shocked by his surroundings, and watches as numerous matching black SUVs encircle him.Nick Fury (Samuel L Jackson) appears and carefully speaks to Steve. He tells him that he's been asleep, in ice, for 70 years, in a state of suspended animation. The hospital set was meant to gradually introduce him to modern society. Still perplexed, Steve breathes heavily and sadly tells Fury that he had a date, as he realizes everyone else he used to know in the 1940s is long dead or very old now.In a post-credit scene, Steve is in an old-fashioned gym. He pummels a punching bag so hard that he knocks it off its chain and sends it flying across the room. Fury enters the gym and asks Steve if he's had trouble sleeping. Steve cynically asks if Fury has come with another mission. Fury replies in the affirmative.Suddenly we see images of all the superheroes, who include Steve/Captain America, Thor (from the movie of the same name), Tony Stark (from the 'Ironman' movies), Hawkeye, Black Widow, Bruce Banner (from 'The Incredible Hulk') and other Shield agents preparing for battle. Fury tells him that \"they're up.\" His personal mission to build an army of superheroes is complete, previewing The Avengers."
        ],
        "summaries": [
          "Steve Rogers, a rejected military soldier, transforms into Captain America after taking a dose of a \"Super-Soldier serum\". But being Captain America comes at a price as he attempts to take down a warmonger and a terrorist organization.",
          "It is 1942, America has entered World War II, and sickly but determined Steve Rogers is frustrated at being rejected yet again for military service. Everything changes when Dr. Erskine recruits him for the secret Project Rebirth. Proving his extraordinary courage, wits and conscience, Rogers undergoes the experiment and his weak body is suddenly enhanced into the maximum human potential. When Dr. Erskine is then immediately assassinated by an agent of Nazi Germany's secret HYDRA research department (headed by Johann Schmidt, a.k.a. the Red Skull), Rogers is left as a unique man who is initially misused as a propaganda mascot; however, when his comrades need him, Rogers goes on a successful adventure that truly makes him Captain America, and his war against Schmidt begins.",
          "During World War 2, Steve Rogers tries to enlist but is repeatedly rejected for his frail and sickly condition, however a scientist notes his determination and allows him to be accepted. What Steve doesn't know is that this scientist is in charge of a government project to create super soldiers, in which Steve is to be the first, but the colonel in charge of the project can't see what the scientist does in this scrawny runt - a strong inner character. Meanwhile, Johann Schmidt, head of a German science division known as HYDRA, knows this scientist and fears the success of his project in America. It could mean trouble for the Germans, so he sends a man to infiltrate and see if it's a success, and \"take care\" of the scientist if it is. It is, and he does, but not without Steve and his new abilities chasing him down. With the doctor dead, no more American supermen will be forthcoming, and Steve quickly becomes a mere U.S. war drive propaganda tool called \"Captain America.\" His role is useful, if undignified, but he soldiers on with it dutifully till hearing of his best friend's unit's capture, for which he promptly heads out to rescue them. During this rescue, he meets the diabolical Schmidt, and the two become each other's arch nemesis.",
          "At the outset of World War II, Steve Rogers wants nothing more than to join the army. The only problem is that he can't pass the physical. He's tried several times under different names without success. Dr. Abraham Erskine notes his eagerness and recruits him for an experimental project. Rogers is soon transformed, both mentally and physically, into a super soldier where he eventually faces off against the Nazi organization Hydra and its head, known as Red Skull.",
          "Steve Rogers, a weak, sickly young man eager to fight is repeatedly rejected from the war-until a seemingly \"crazy\" scientist recruits him in a new experiment to turn the tides. He is transformed into the super soldier the world needs, but no one believes it. He is used as an empty face for propaganda until his comrades, including hid best and only friend, are captured by the Red Skull, a Nazi general who wants to use the Tesseract for evil. \"Captain America\" breaks into Red Skull's HQ with the help of Peggy Carter and Howard Stark, and Captain America saves everyone. And everyone begins to realize what Captain America can really do.",
          "During WWII, Steve Rogers constantly tries to enlist himself into the Army with the intention of protecting mankind. After being denied in several cities, Rogers is finally enlisted through service for a special military division dubbed the Strategic Scientific Reserve. Proving his worth, Rogers is selected by kindly Dr Abraham Erskine to take part in his Super Soldier experiments. Transformed, Rogers is super strong and fast and is dubbed as Captain America. After a brief career in propaganda and saving his best friend, Rogers begins to take the fight to the evil forces of the Nazi organization HYDRA and its dictatorial leader Red Skull, who seeks a source of dangerous power to help him destroy the world."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Vy_NAIUBmFo8GYv0bnkt",
        "_score": 9.296072,
        "title": "Map of the Human Heart",
        "year": 1992,
        "genders": [
          "Adventure",
          "Drama",
          "Romance"
        ],
        "score": 7,
        "directors": [
          "Vincent Ward"
        ],
        "writers": [
          "Louis Nowra",
          "Vincent Ward"
        ],
        "synopsis": [
          "This 1993 film is a love story about a young eskimo boy, Jason Scott Lee, and a metisse (French for half breed) girl, Anne Parillaud, set in Arctic Canada. The story begins pre WWII with the main characters as children and the beginning of their love, continues through WWII with their love truly and fully blossoming, and ends sometime after the war with the eskimo boy, now an old alcoholic man meeting a young woman. What sets this apart from most love stories is how it ends, rather how it doesn't end. It doesn't end with your typical \"and they lived happily ever after\" finale. SPOILER ALERT: don't read on if you haven't yet seen it.It finishes with love at the final end being unfulfilled, never really resolved. Although I'll have to say that there is a parallel ending - probably insisted upon by the producers - that shows the audience what it would've been liked had everything worked out. That scene notwithstanding, the story unfolds quite innocently, midway becomes joyful as the two young people, the boy and the girl now a young man and young woman in their prime of their life, consumate the relationship that was always meant to be although there is an outside force which threatens and ultimately thwarts their \"happy ever after\" scenario. Toward the end, the film turns a bit depressing, the story showing us how disappointing things turned out. The young woman, the alcoholic old man meets, is very special in his life (not a love interest) and the timing of his meeting with her makes it all more tragic.Although other reviewers thought this film corny I credit it for being closer to life than a lot of other Hollywood big budget movies. Things didn't work out - how many times has that happened in our own personal lives? This of course with the tacked on alternative pseudo ending aside.It's a long film but well worth the sit. Don't expect to leave it uplifted but moved. Beautiful cinematography and well paced direction. The scenes of the polar animals and night bombings of Germany are quite compelling. The love scene on the blimp will stay forever in one's mind. Out of 5 stars I'd give it a 4 simply because it did get slow at times and because of the phony happy ending toward the end.Cameo appearances from John Cusack and Jeanne Moreau."
        ],
        "summaries": [
          "Arctic, 1965: Avik tells his story starting 1931. A mapmaker flies Avik, then a preteen Eskimo boy with TB, to a hospital in Montreal, where he meets Albertine. They meet again when Avik joins WWII in UK.",
          "Fantastic improbabilities, happenstance and the undying bridge of love are part of this romantic fantasy about an Inuit who crosses years, oceans and the ravages of WWII to find his childhood love, a Metis girl, but finds that their cultures are the most difficult spaces to gap.",
          "In 1931, a chartist lands a plane in the Arctic to map unrecorded regions. He takes an Eskimo boy with tuberculosis back to civilisation where he is healed and indoctrinated in a Catholic foster home. The Eskimo meets a \"half-breed\" girl (father was French, mother was Indian) and they fall in love. They are separated and the Eskimo returns to the Arctic. Years later he encounters the chartist again and sends a message to his love via the chartist. He joins the air force to fight Hitler, and runs into her again, but there are obstacles that threaten his friendships and relationships."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "2i_NAIUBmFo8GYv0bnwu",
        "_score": 8.728038,
        "title": "Seven Years in Tibet",
        "year": 1997,
        "genders": [
          "Adventure",
          "Biography",
          "Drama"
        ],
        "score": 7.1,
        "directors": [
          "Jean-Jacques Annaud"
        ],
        "writers": [
          "Heinrich Harrer",
          "Becky Johnston"
        ],
        "synopsis": [
          "The introduction shows the young Dalai Lama receiving gifts from Tibetan monks. One gift he receives, an ornate music box, has special meaning to him, as he is still a young child.The progress of Heinrich Harrer through India and Tibet on his trek across the high plateau to Lhasa is interwoven with the story of the young Dalai Lama growing into an 8 year old boy who becomes the spiritual leader of Tibet, with a thirst for western knowledge and later into an adolescent. The Dalai Lama is portrayed by three different actors as he grows up.Harrer (Pitt) and his pregnant wife Ingrid (Ingeborga Dapkunaite) are briefly shown being driven to the train station in Graz, for Harrer's departure on an expedition to Nanga Parbat. It becomes evident that Ingrid resents his departure. At the station Harrer barges through the crowds, dragging his wife by the hand, and shows his resentment of Peter Aufschnaiter's selection as leader of the expedition.Harrer at the train station in 1939 appears hostile to the Nazi Party, taking their flag with reluctance. The real-life Heinrich Harrer admitted he had Nazi sympathies at the time which he later regretted. Harrer's arrogance and self-sufficiency become apparent as he sits by himself on the train journey to India.The expedition begins climbing the mountain Harrer, Aufschnaiter, and the expedition group begin climbing Nanga Parbat. Harrer falls, injuring his leg, but hides his injuries from the group. Harrer places Aufschnaiter's life in danger by his inability to pull him safely up a cliff due to the pain of his injury; this worsens their relationship. After an avalanche, Aufschnaiter orders the group to retreat back to the base, despite Harrer's determination to reach the summit.While descending from the mountain, Harrer encounters a Tibetan traveller who gives him a photograph of the Dalai Lama for his protection. On reaching the base, they learn that Germany has invaded Poland, and they are arrested by the British and taken by truck to Dehra Dun prison camp. Harrer writes to Ingrid in Austria, telling of his capture; she responds with divorce papers and tells him she wishes to re-marry. Harrer's son Rolf is now two. Harrer makes several unsuccessful escape attempts. Eventually Aufschnaiter manages to steal a British uniform and several of the prisoners escape. The members of the group go separate ways, with Harrer heading for northern India.On reaching northern India in 1943, Harrer steals food from a religious offering, but is later violently sick from food poisoning. The rest of the group, apart from Aufschnaiter, have been recaptured. Aufschnaiter plans to travel to China to find work.They cross the border into Tibet and set out east, but are met by two men on horseback who tell them they must turn back. Aufschnaiter attempts to speak to them in Tibetan, which he learned while in prison, but is told that foreigners are strictly forbidden in Tibet. On reaching the next town and requesting food, they are confronted by the same two men. They learn that one of them is the garpon, leader of the province, and that the reason that foreigners are forbidden from Tibet is that there is a threat of attack from outside forces. Harrer attempts to appease the garpon by offering him the photo of the Dalai Lama, but they are forced to return towards India, escorted by two guards who are told to shoot them if they try to escape.Harrer and Aufschnaiter are escorted to a small town near the border with India where they trade what little they have in return for food. Harrer persuades Aufschnaiter to trade a watch that he received from his father for climbing Mont Blanc. Seeing one of the guards trying on a Chinese army uniform, he offers him his \"German army boots\" while actually giving him crampons. The guard takes a liking to the \"boots\" and puts them on. Harrer and Aufschnaiter escape to the mountainside where the guards, clad in the heavy crampons and uniforms, are unable to follow.While recovering from the escape, Aufschnaiter discovers that Harrer has deceived him about not having a watch to trade, and is furious at Harrer's selfishness. Harrer, first indifferent, after a while begs forgiveness, offering Aufschnaiter all three of his watches and his wedding ring. Aufschnaiter declines the ring, but Harrer insists, stating \"I didn't deserve it either.\" The two then start on their way over the high Tibetan plateau to Lhasa.The arduous journey to Lhasa (including footage secretly captured by director Jean Jacques Annaud in Tibet) causes Harrer to reflect on his son Rolf and the Tibetan custom that the longer and more difficult the journey in a pilgrimage, the greater the repentance of past sins. High in the Himalayas, Harrer and Aufschnaiter are abducted by bandits, but they escape on horseback. Harrer and Aufschnaiter are forced to kill their horses and eat the meat raw.In Lhasa, the pair encounter pilgrims travelling to Lhasa. They are only allowed to join the group after saying they have \"special permission\" and showing one of the pilgrims the instruction sheet from their first aid kit. As the Tibetan they show it to cannot read English, he allows the two men to join the pilgrims.In Lhasa, Harrer and Aufschnaiter cover their faces to avoid recognition as foreigners. When they try to steal food, Kungo Tsarong, played by Mako, seeing the condition of the travellers, invites them to stay at his home.Tsarong asks for permission for the explorers to remain in Lhasa. The conversation is overheard by the secretary to the regent, Ngawang Jigme (B. D. Wong). Jigme offers Harrer and Aufschnaiter a gift of new clothes, and at the guest quarters of Tsarong's home a Tibetan tailor named Pema Lhaki arrives to measure the two men. Not having seen a woman for several years, they immediately attempt to win her affections.Settled in Lhasa, Harrer continues his attempts to impress Pema Lhaki by demonstrating his climbing techniques and showing a scrapbook containing his achievements back in Austria in skiing and his gold medal at the 1936 Winter Olympics. Lhaki is seemingly unimpressed, stating that climbing is a foolish pleasure and informing Harrer that Western civilization is very different from Tibet, where a man is more respected for abandoning his ego.Harrer, still interested in the Tibetan tailor, rips out a jacket pocket as an excuse to visit her and have it repaired. Harrer enters the store to find Aufschnaiter already there. The three go ice skating together, and Harrer realises that Aufschnaiter has succeeded in winning the Tibetan woman's love.The foreigners have been observed through a telescope by the young Dalai Lama from the nearby Potala Palace. Ngawang Jigme visits the Chinese embassy in Tibet and becomes acquainted with the Chinese ambassador. He has been sent by the Tibetan government to persuade Chinese officials to stop sending financial gifts to Tibetan monasteries as they are becoming suspicious of Chinese intentions. The Chinese official hints that Jigme could gain advancement by offering his services to the Chinese.By May 1945, Harrer visits Aufschnaiter and Pema Lhaki to congratulate them on their marriage. They discuss the activities of the Chinese Communist Party. Lhaki asks Harrer about his life in Lhasa, and he reveals he is very busy and moved out of Tsarong's house five months ago into his own settlement. But he has not found love, and shows his resentment over Aufschnaiter's marriage.Returning to Lhasa, where he has been hired to survey the city, he is told by Ngawang Jigme that World War II is now over. Heinrich immediately begins packing for home when Kungo's elderly wife arrives with a letter for him from Austria. The letter is from his son Rolf, telling him to stop writing. A depressed Harrer receives another letter, this time from the `Great Mother` of the Dalai Lama.In a beautiful Deyangsar courtyard, Harrer greets the Great Mother (played by Jetsun Pema, the sister of the living 14th Dalai Lama). She gives him instructions on how to behave when in the presence of the Lama, who has learned of Harrer's presence in Lhasa and would like to meet him personally.Harrer enters the interior halls of the Potala Palace. Turning into a dark chamber, he sees the mysterious Dalai Lama seated on a throne at the end. Entering behind the Great Mother, he bows repeatedly, much to the amusement of the young Lama. Harrer walks up to the throne, and the Dalai Lama plays with Harrer's mop of blond hair, calling him a yellow head. Shortly afterwards, the Dalai Lama asks the surprised Harrer if he can build him a movie cinema at the palace. He also wants Harrer to teach him about western civilization and become his private tutor during the building process.Harrer immediately begins building the theatre, but encounters a problem, as the workers refuse to harm the worms in the earth while digging, believing that each could have been their mother or a loved one in a past life. Harrer again visits the Dalai Lama, who emphasizes that religious concerns are paramount, and that he must honor them and find a solution. As the movie house is built, Harrer begins tutoring the boy in world geography and the ways of the west.Harrer and Aufschnaiter with a number of important monks and ministers attend a festival near a river, where they meet Ngawang Jigme to celebrate his promotion to the position of minister. At a Christmas party, Harrer returns Aufschnaiter's old watch. Harrer had come across it by chance at a shop and retrieved it as a gift to Aufschnaiter, along with a note thanking him for his friendship. Soon afterwards, a Tibetan turns on the radio and a Chinese announcer proclaims that they plan to invade Tibet. The party breaks up, and an evil omen at night casts a shadow on what is to come.At a meeting with the cabinet, the regent states that Tibet recognizes no foreign sovereign and banishes all Chinese officials from Tibet, including those at the Chinese embassy. As the crisis grows, the Dalai Lama has a terrible nightmare of Chinese atrocities near the Tibetan border in Taktser, his birthplace, with monasteries being burnt down and monks being forced to kill each other. He seeks comfort with Heinrich Harrer, who tells him it was a dream, only to find soon after that the Chinese have indeed crossed the Tibetan frontier, burnt Taktser, and are advancing.Three Chinese generals fly to Lhasa to speak with the Dalai Lama, and against Harrer's request Ngawang Jigme raises the Chinese flag, saying that Tibet should embrace the enemy if it cannot defend itself. Monks have spent many days creating a sand mandala to welcome the generals, who show their disrespect by wiping their feet on it. Despite the Dalai Lama's speech to them that Tibet is a peace-loving nation, the head of the Chinese delegation dismisses religion as \"poison\", and war soon breaks out on the Tibetan frontier at Chamdo.Ngawang Jigme is sent to Chamdo with a small Tibetan army to defend against the Chinese attack, but many Tibetans are killed. Jigme makes the decision to surrender after just 11 days and then blows up the Tibetan ammunitions dump, destroying any hope of a counter-attack. During a treaty signing in Lhasa, Kungo Tsarong tells Harrer that if Jigme had not destroyed the weapons supply, Tibetan guerillas could have held the mountain passes, buying time to appeal to other nations for help. As the Chinese take control of Tibet and the Chinese flag flies at Lhasa, Harrer visits Ngawang Jigme to condemn him for his surrender, and insults him by returning the jacket he received as a gift.Despite the Chinese invasion, the Dalai Lama, now fifteen years old, is formally enthroned as the spiritual and temporal leader of Tibet. Harrer pays a final visit to the Lama on top of the Potala and prays with him. As he leaves the palace, he is given a gift of the music box which was shown to be so dear to the Dalai Lama at the beginning of the film.Harrer bids farewell to Aufschnaiter and Pema and returns to Austria in 1951 to visit his son Rolf, now a young boy. Although his son initially refuses to see him, Harrer leaves the musical box as a gift for him and watches him lovingly from the crack in the door. In the film finale, Harrer gradually comes to know the son he has thought about all the years while he was in Tibet and trains him like himself in the art of climbing mountains. Having reached the top of a mountain, Harrer is shown with a Tibetan flag planted beside him at the peak."
        ],
        "summaries": [
          "True story of Heinrich Harrer, an Austrian mountain climber who became friends with the Dalai Lama at the time of China's takeover of Tibet.",
          "After the deaths of 11 climbers, Austrian Heinrich Harrer (Brad Pitt) decides to add glory to his country and to the Austrian pride by climbing Nanga Parbat in British India, and leaves his expectant wife behind. An egoist and a loner, he does not get along with others on his team, but must bend to their wishes after bad weather threatens them. Then WWII breaks out and they are arrested and lodged in Dehra Dun's P.O.W. Camp. He attempts to break out several times in vain, but finally does succeed along with Peter Aufschnaiter (David Thewlis), and they end up in the holy city of Lhasa--a place forbidden to foreigners. They are provided food and shelter, and Peter ends up marrying tailor Pema Lhaki, while Heinrich befriends the Dalai Lama. They meet regularly; while he satiates the child's curiosity about the world, including Jack the Ripper and 'yellow hair'; he is exposed to the teachings of Lord Buddha, He even constructs a movie theater, while getting news of the end of the war, his divorce, and his son's refusal to communicate. But nothing will prepare him for the devastation about to descend when Communist China decides to attack, leading to the deaths of over 1 million Tibetans, the destruction of over 6000 monasteries, and betrayal from their very own people.",
          "Brad Pitt stars as the arrogant Heinrich, a famed Austrian mountain climber who leaves behind his wife and infant son to head a Himalayan expedition in 1939, only to fall into the hands of Allied forces as a prisoner of war. He and a fellow escapee, Peter Aufschnaiter (David Thewlis), make their way to the Forbidden City in Tibet, where Peter finds a wife and Heinrich befriends the Western culture-obsessed teenage Dalai Lama (Jamyang Jamtsho Wangchuk), the spiritual leader of his Buddhist nation. As Heinrich waits out the war, his friendship with the Dalai Lama begins to transform him from haughty to humble, but a crisis with China looms.",
          "Heinrich Harrer journeys to the Himalayas to climb mountains, leaving his wife behind in Austria. War breaks out while he's gone and he is placed in a prisoner-of-war camp. Harrer escapes to Tibet where he befriends the child Dalai Lama and witnesses the Tibetan/Chinese confrontation escalate.",
          "Heinrich Harrer is an Austrian mountaineer who is forced to be a hero for the Nazi propaganda. He leaves Austria in 1939 to climb a mountain in the Himalayas. Through a series of circumstances (including POW camp), he and fellow climber Peter Aufschnaiter become the only two foreigners in the Tibetan Holy City of Lhasa. There, Heinrich's life changes forever as he becomes a close confidant to the Dalai Lama."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "oy_NAIUBmFo8GYv0bo40",
        "_score": 8.453099,
        "title": "Garbo: The Spy",
        "year": 2009,
        "genders": [
          "Documentary",
          "Biography",
          "History"
        ],
        "score": 7.2,
        "directors": [
          "Edmon Roch"
        ],
        "writers": [
          "Maria Hervera",
          "Isaki Lacuesta",
          "Edmon Roch"
        ],
        "synopsis": [],
        "summaries": [
          "A compelling account of Juan Pujol, an extraordinary Spanish double agent during WWII who helped change the course of history."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "FC_NAIUBmFo8GYv0bnQr",
        "_score": 8.191328,
        "title": "The Life and Times of Rosie the Riveter",
        "year": 1980,
        "genders": [
          "Documentary",
          "History",
          "War"
        ],
        "score": 7.2,
        "directors": [
          "Connie Field"
        ],
        "writers": [
          "Lola Weixel",
          "Margaret Wright",
          "Lyn Childs"
        ],
        "synopsis": [],
        "summaries": [
          "Documentary about women working in factories during WWII and resultant loss of jobs after the war. Five women tell their stories. Fascinating clips of racist, sexist propaganda of the era."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "oC_NAIUBmFo8GYv0bpI1",
        "_score": 8.16616,
        "title": "My Best Enemy",
        "year": 2011,
        "genders": [
          "Comedy",
          "Drama",
          "War"
        ],
        "score": 6.7,
        "directors": [
          "Wolfgang Murnberger"
        ],
        "writers": [
          "Paul Hengge",
          "Wolfgang Murnberger"
        ],
        "synopsis": [],
        "summaries": [
          "A dark WWII comedy about two friends, stolen artwork, and an unfortunate case of mistaken identity as a Jewish man switches places with his Nazi best friend in order to survive"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ty_NAIUBmFo8GYv0bo00",
        "_score": 8.11152,
        "title": "Under the Boardwalk: The Monopoly Story",
        "year": 2010,
        "genders": [
          "Documentary",
          "History",
          "Sport"
        ],
        "score": 6.2,
        "directors": [
          "Kevin Tostado"
        ],
        "writers": [
          "Kevin Tostado",
          "Craig Bentley"
        ],
        "synopsis": [
          "The classic board game that has been played by over a billion people in the last 75 years, MONOPOLY® is a worldwide cultural phenomenon. Under the Boardwalk: The MONOPOLY Story is a feature-length documentary that captures fascinating stories about the game and those who play it, with narration provided by Zachary Levi, star of NBCs Chuck and the Disney animated film, Tangled. \"Under the Boardwalk\" focuses on the MONOPOLY national and world championships that are held around the world every four years. Leading up to the exciting coronation of a new champion at the most recent World Championship in Las Vegas, the filmmakers follow some of the most colorful players in the game.In addition to the competitive arena, the game of MONOPOLY provides a wealth of other interesting stories. Few people realize that the game began as an anti-capitalist political platform thirty years before it evolved into a game about getting rich and took the world by storm in the depths of the Great Depression. This documentary looks at how MONOPOLY was transformed and why it has become so popular, investigates the psychology of the game, and lets viewers in on the best strategies for winning.As a cultural phenomenon, MONOPOLY has a colorful history of secretly helping WWII POWs escape, influencing movies and television since its inception, and being part of all kinds of interesting world records and trivia. And no film about this classic board game would be complete without meeting a few of the quirky collectors of all things MONOPOLY.MONOPOLY began by bringing friends and families together, and now, through its universal language and World Championships, helps bring the whole world together."
        ],
        "summaries": [
          "Shows how the classic board game has become a worldwide cultural phenomenon, and follows the colorful players who come together to compete for the coveted title of Monopoly World Champion.",
          "Ever since the 1930s, no board game has had the lasting worldwide success of Monopoly. Although it started as a protest simulation, the game evolved to be a welcome wish fulfilling fantasy of being a financial high roller in the Great Depression. In this film, the history of the game is retold with its tremendous popular culture influence and the little idiosyncrasies that grown around it. In addition, we are introduced to various players who are compete around the world for the real cash prizes that go far beyond $200."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "9i_NAIUBmFo8GYv0bo40",
        "_score": 8.018767,
        "title": "Bless Me, Ultima",
        "year": 2012,
        "genders": [
          "Biography",
          "Drama",
          "History"
        ],
        "score": 6.3,
        "directors": [
          "Carl Franklin"
        ],
        "writers": [
          "Rudolfo Anaya",
          "Carl Franklin"
        ],
        "synopsis": [],
        "summaries": [
          "A drama set in New Mexico during WWII, centered on the relationship between a young man and an elderly medicine woman who helps him contend with the battle between good and evil that rages in his village."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Ty_NAIUBmFo8GYv0bo40",
        "_score": 7.9661,
        "title": "Hannah Free",
        "year": 2009,
        "genders": [
          "Drama",
          "Romance"
        ],
        "score": 6.5,
        "directors": [
          "Wendy Jo Carlton"
        ],
        "writers": [
          "Claudia Allen"
        ],
        "synopsis": [
          "Hannah (Sharon Gless) is spending her final years in a nursing home, recalling memories from her past, all built around the relationship with her one true love, Rachel. Unable to walk and confined to her bed, Hannah recalls her childhood with Rachel back on a farm in Michigan. Now Rachel is comatose and being kept down the hall in the same home as Hannah, yet Rachels family will not allow Hannah to see her lover of so many years.Throughout the story, Hannah speaks to a younger image of Rachel in her room, and reflects on distraught episodes in earlier years when she left Rachel, such as her time stationed with the WAC in New Mexico during WWII, and when she felt she needed time to be alone by living in Alaska. Those times apart still plague their past: as we later learn, domestic Rachel was married to a man and quite repressed about her love for Hannah, and the butch Hannah felt she needed to escape the religious and sexual repression that surrounded Rachel, so she took another lover in the WAC and found solitude by fishing in Alaska.In the present, Hannah continues to plead with Rachels family represented by her inhibited granddaughter Marge to see the comatose Rachel. Marge coldly tells Hannah that she was always the source of trouble in Rachels life, especially since she travelled away so often, and does not want Hannah to upset her any further.A high school student named Greta shows up for a typical assignment of interviewing the elderly about their past. Hannah rattles off some basic facts about growing up during the Great Depression and serving as a WAC in WWII, as well as some of her many travels. Hannah rather casually invites Greta in on her conversations with the fantasy Rachel, and Greta relates somewhat to her situation since her mother died, and she still talks to her. Having made a connection, which they both sense is augmented by their lesbian identities, Greta tells Hannah she will help her visit Rachel later that night.As promised, Greta arrives in the middle of the night, helps Hannah into a wheelchair, and absconds with her to Rachels room, where she lay in a coma connected to life support machines. Hannah tells Greta how they were together all their lives, even when they were apart. Suddenly a nurse enters and insists that Hannah leave because the family has not given permission, but Greta tells the nurse that Rachel is her great-grandmother, and that she thus represents the family to allow Hannah to visit.Hannah recalls further memories of her happier times with Rachel, including her return from Alaska, during which time Rachel had twins and became a widow. One of her twins was named Marge, whom we slowly realize is the child who became Gretas grandmother, the mother of Gretas deceased mother. When Greta confronts Marge about allowing Hannah to see Rachel, she explains how she relates to Hannah as a lesbian, but Marge persists with her resistance to allowing Hannah and Rachel to spend time together.Hannah has more talks with Greta about her life, and gives her a suitcase full of her writings, which include an unpublished novel. Hannah comments how Rachel always wanted their love to be private, while Hannah wanted to let the world know, and to save their stories for posterity. She recalls times when they passionately made love, and times when they simply played checkers. She also recalls that later in life, Rachel gave up her privacy and began telling people of her love for Hannah, despite the resistance she faced. By their middle age, the two were known as a couple, and Hannah remembers what comfort that gave her.Despite their mutual happiness, Hannah went through another impulse to leave Rachel for some time, as she remembers. Since they had become public with their relationship and lived together for many years, Rachel cannot understand why Hannah needs to escape again, to which Hannah can only reply that she needs to get out of Michigan, she wants to try something new. Rachel gives Hannah the ultimatum that if she leaves again, she does not want her to ever come back, and Hannah quietly promises that she will try to stay.Hannah receives a letter from her former lover in New Mexico and sends a thoughtful response. Just then, Greta arrives to tell Hannah that she has read her novel and she thinks she can get it published. Greta further reveals that she met Hannah when she was much younger, and that she helped give her the courage to come out in the past few years. Greta recalls how painful it was to watch her mother slowly die after the car accident that mortally wounded her, thereby explaining why Marge is so deeply aggrieved about now seeing her mother in a similar condition. Greta explains that she knew at some point she had to turn off her mothers life support and let her go. Now, Greta says, Hannah can do the same for Rachel.Greta helps Hannah to Rachels bedside, and again sees the younger vision of Rachel in the room, asking Hannah to let her die in peace. Greta suddenly hears Rachels voice as well, and now that they both know she wants to pass away, they plan to turn off her life support. Marge enters at that moment and stops them, but Hannah encourages her to understand how they are doing the right thing. Marge too hears Rachel asking to be let go, and surrenders to the inevitable. Hannah climbs into Rachels bed and tenderly wraps herself around her lovers body, taking off Rachels oxygen mask as Greta turns off the machines.Hannah remembers another day from her childhood with Rachel, running across a field together."
        ],
        "summaries": [
          "A film about a lifelong love affair between an independent spirit and the woman she calls home.",
          "Hannah and Rachel grew up in the same small Midwestern town, where traditional gender expectations eventually challenge their deep love for each other. Hannah becomes an adventurous, unapologetic lesbian and Rachel a strong but quiet homemaker. Weaving back and forth between past and present, the film reveals how the women maintained their love affair despite a marriage, a world war, infidelities, and family denial."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "6S_NAIUBmFo8GYv0bnot",
        "_score": 7.9118958,
        "title": "Circle of Friends",
        "year": 1995,
        "genders": [
          "Drama",
          "Romance"
        ],
        "score": 6.6,
        "directors": [
          "Pat O'Connor"
        ],
        "writers": [
          "Andrew Davies",
          "Maeve Binchy"
        ],
        "synopsis": [
          "This is a charming romance about three girls from an Irish village whose coming of age happens as they all attend college in Dublin not long after WWII. Seemingly unmarriageable Benny is the daughter of a wealthy shopkeeper mortified by the attentions of her dad's shop assistant, while her Dublin beau, Jack, is a wealthy star athlete and medical student. Their story centers on the hardships of a long-distance relationship.Orphan Eve was raised by nuns and put through college by the village's patron family. Her Dublin beau is Aidan, who is deliberately given no backstory by the creators of the film. Neither is self supporting, and they work side by side to make a cottage in the woods -- Eve's inheritance from her dad -- livable.They soon discover that celibate cohabitation before they can afford to marry is harder than they believed.Nan, raised in a family suffering from domestic violence, believes she can glamourize herself to snare a powerful gent and then raise her standard of living. She is the love object of Simon, son and heir of the patron family of her village. Her plan to get pregnant, marry, and become the new mistress of the manor house falls flat when Simon buys her off to end the affair.Benny is soon in the throes of despair when her father dies, her pursuer is more forceful about inheriting both her and her dad's business, and Jack breaks off the relationship when Nan fibs that he is the father of her child.Eve manages to straighten everything out except Benny's pursuer, whom she gets rid of herself by discovering he has been stealing from the family business. At the conclusion, Jack and Benny are to marry, Eve and Aidan are to remain celibate cohabiters of the cottage until they can afford to marry, and Nan goes abroad on Simon's money to deal with her pregnancy."
        ],
        "summaries": [
          "3 women, who've been friends since childhood, meet at university in Dublin in 1957. Student and boyfriend life begins.",
          "'Circle Of Friends' is set in 1950's Ireland. The movie focuses on Benny Hogan and her best friend, Eve Malone. The story centers around Benny and Eve as they enter student life at University College, Dublin. Here Benny and Eve reunite with their childhood friend, the ice-cool Nan Mahon, the 'college belle'. They also encounter the handsome and charming Jack Foley, whom Benny quickly falls for."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ty_NAIUBmFo8GYv0bocx",
        "_score": 7.4216557,
        "title": "Rambo",
        "year": 2008,
        "genders": [
          "Action",
          "Adventure",
          "Thriller"
        ],
        "score": 7,
        "directors": [
          "Sylvester Stallone"
        ],
        "writers": [
          "Art Monterastelli",
          "Sylvester Stallone",
          "David Morrell"
        ],
        "synopsis": [
          "The film begins with real-life footage of Burma soldiers committing genocide and other atrocities, and shows how they force young boys into becoming soldiers. At an abandoned rice paddy, Lt. Aye (Aung Aay Noi) and a bunch of Burmese soldiers force captured civilians out of a truck. One soldier walks into the muddy paddy and throws a few mines into the water. The soldiers order the civilians to go across the swamp. As they do, one person is blown up by one of the mines. The rest reach the safety of the terraces at the other end and are ordered to run back through the field. When they refuse, they are shot to death by the soldiers.During the opening credits, we see John Rambo (Sylvester Stallone) catching snakes in a jungle in Thailand. He also uses a bow-and-arrow to shoot a fish and then gives it to some fisherman passing by in their boat. Rambo and his helpers go to a village where the owner pays Rambo for the snakes he captured. His only complaint though is for Rambo to get more pythons, since he keeps bringing back cobras.While Rambo puts the snakes away, Michael Burnett (Paul Schulze) approaches him and introduces himself. Michael is a missionary, and he was told that Rambo is the boatman who knows the river best. Rambo says that its true, and Michael wants to hire him to bring him and his group to Burma. Rambo says that its a war zone, but Michael says that this is his fifth time going in and they are all aware of the dangers involved. Rambo asks him if they're bringing any weapons with them. Michael says no, and Rambo tells him that they're not going to change anything. Sarah (Julie Benz), one of the missionaries, tells Michael that she'll try to persuade him. Sarah tries her best to convince Rambo to transport them to Burma, but he still refuses. He tells her to go home instead.Back in Burma, Lt. Aye's soldiers raid a village and take all the children hostage. The women cry and beg for their loved ones. Aye tells them that the boys will now be soldiers for the Burmese Army. He also threatens that if any of the women try to get help from the rebels, they'll come back and cut out their tongues.In Thailand, Rambo and goes to his boat when he sees Sarah waiting for him. She again pleads with him to transport them to Burma, and he still refuses. She says that trying to save a life won't waste his, and he must still believe in something. After Sarah leaves, Rambo thinks about it and then changes his mind.The next day, Rambo and the missionaries travel down the river in his boat. Sarah thanks Rambo again for helping them, and then asks him what his name is. He says John, and she asks him where he's from. Rambo says that he's from Arizona, and he hasn't been back since he was drafted and served in the Vietnam War back in 1967. Sarah asks him if he's at least a little curious as to how his home has changed, but he tells her that he doesn't have a reason to be curious. He also mentions that his father might still be alive back home. Before Sarah returns to her seat, Rambo says that they shouldn't go on, and that they can turn back whenever she wants.At night, while the missionaries sleep, Rambo orders his passengers to be silent. Michael asks him what's wrong, and Rambo tells him he sees a nearby pirate camp on the shore. He tells everyone to get down and be quiet so they can hopefully pass by unnoticed. They're almost in the clear, but the pirates spot them and open fire at them. Rambo stops the boat and tells everyone to keep their heads down. If they look the pirates in the eye, they'll be killed. The pirates' boat pulls up to them and several men hold everyone at gunpoint. They say that they're trespassing in their territory, and they have to pay them money. Rambo says that he'll pay him whatever they want from the boat, but then the pirates see that Sarah is female. They order Sarah to come with them, and Rambo offers them anything else but her. Tension escalates, and Rambo suddenly pulls a pistol and shoots all the pirates. One pirate is still alive, and so Rambo unloads his last bullets into his head. Michael voices his disapproval over what just happened, and so Rambo grabs him by the throat and harshly tells him that if he didn't kill them, they would all be dead and Sarah would've been raped and probably killed as well. Rambo says that they're going to turn back, but Sarah wants them to continue on since they're so close. Rambo eventually agrees to go on, and they arrive in Burma the next day.While the missionaries get out, Michael says that he has to report Rambo for killing the pirates. He also says that they're going to take another way out instead of his boat, and so he doesn't have to wait for them. Sarah gives Rambo a crucifix as a way of saying thank you for what he did. All the missionaries take off and hike to a village. As they do, Rambo travels back and comes across the pirate boat again. He douses it with gasoline and then lights it on fire, allowing it to explode with the dead pirates still on board.The missionaries get to the village, where they are greeted by the locals. One missionary is a dentist, and he inspects everyone's mouths. Another missionary hands out bibles and starts to preach about god while another missionary records him with his video camera. Sarah walks to where Michael is, where hes treating peoples wounds. Sarah looks at the people waiting to be looked at by Michael, who are missing legs and arms as a result of anti-personnel mines meant to permanently wound instead of kill.Suddenly, explosions begin to rip through the village. Aye and his soldiers have arrived, and they proceed to slaughter everyone in sight. One missionary gets his legs blown off by an explosion. The unarmed civilians are shot to death. Some soldiers set the people on fire with flamethrowers. Children are brutally shot to death, and a soldier throws a woman's child into a burning hut. During the massacre, the remaining missionaries try to run away, but they are beaten and captured by the soldiers. Aye watches as the village burns and the ground is littered with corpses.Some time passes, and Rambo dreams about what has happened to him in the past. He is woken up by Arthur Marsh (Ken Howard), who calls out his name. Arthur apologizes for coming to him like this, but he wouldn't come if it wasn't important. Arthur is a reverend at the Colorado church where the missionaries are from. Before they left, Michael told him that Rambo was going to transport them to Burma. It's been a week since they were supposed to be back, but they never showed up. Arthur has been in contact with some Karen rebels, and they have a good idea of where they were taken. Rambo believes that they're probably dead, and recommends that Arthur talks to someone at the U.S. embassy in Thailand. He already has, and they won't help him in time. He has hired a bunch of mercenaries for a rescue mission, and he wants Rambo to take them to the same spot where he dropped off his people. Rambo agrees to do it, and forges a large machete for himself.The next day, Rambo transports the mercenaries down the river. They are made up of Diaz (Reynaldo Gallegos), Reese (Jake La Botz), En-Joo (Tim Kang), and School Boy (Matthew Marsden) and are lead by Lewis (Graham McTavish), who constantly complains on how slow they are moving. Reese passes the time by singing, which annoys everyone else. The others pass the time with jokes and the like. Lewis tells Rambo that his boat is \"a piece of shit\", and he could swim there faster than they are going. Rambo stares him down, but Lewis says that he does not impress him. School Boy introduces himself to Rambo, saying that he got his name in sniper school and he hasn't been able to get rid of it (regardless of how many people he's shot).They eventually get to the spot where Rambo dropped off the missionaries. Lewis is angered when they find out the rebels have only sent two people (one is their guide, the other is a young boy). Reese also becomes nervous when their guide tells them that they face more than 100 Burmese soldiers. Lewis asks the mercenaries if any of them are carrying explosives. School Boy is the only one, and he's carrying a claymore mine. Rambo docks and grabs some blades, but Lewis tells him to stay with the boat. Rambo says that his men stay with the boat, but Lewis still orders him to remain behind.The guide takes the mercenaries through the jungle and they come across an old bomb that was dropped from a plane during World War II, which didn't explode when it hit the ground. After a long hike, they come to the paddy where the Burmese soldiers forced their captives to run among the mines they threw in the water. Flies are swarming around the dead bodies, a severed head has been impaled on a stake, and some corpses have been hanged as a warning to the rebels. Everyone is disgusted by the slaughter, and the guide warns them to watch where they step, since there are still mines around, and then sends the boy home to report what has happened.More Burmese soldiers arrive with more captives to play the running game. The mercenaries hide as the soldiers force another group civilians out of the truck and take their money. A soldier throws more mines into the swamp between them and the mercenaries. The soldiers force the civilians to run across to the other side. Scared, all the civilians dash across to the other side without being killed by the mines. The soldiers order them to run back across to where the truck is, but they are too scared to move. The soldiers try to scare them into running again by firing at them. School Boy wants to fire at them, but Lewis says that if they start shooting, it will attract the other soldiers at the nearby base (which is where the missionaries are). Rambo suddenly appears out of the jungle and shoots all the soldiers using his bow-and-arrow, killing them with deadly precision. The last soldier is shot in the leg and in the head, which causes his body to fall in the water, landing on one of the mines and exploding.The mercenaries are astounded at how easily and effectively Rambo killed the soldiers. The guide says that he can take them to the base, but Lewis and the others are ready to split. Rambo aims an arrow at Lewis' eye and is held at gunpoint by Reese and En-Joo. Rambo tells Lewis that none of them want to be there, and they can \"live for nothing or die for something.\" School Boy is with Rambo, and soon the others agree to continue on.Back at the base, soldiers throw food at women locked in cages, and Aye inspects the captured missionaries. One of them looks him in the eye, which causes Aye to order one of his men to feed him to the pigs.Later that night, the mercenaries drive to the camp using the truck stolen from the soldiers Rambo killed. The guide is dressed as a soldier and drives them to the gate. It's raining, and once the guard recognizes the truck he lets them enter. School Boy sneaks up on a guard by the gate and stabs him. He then sets up his sniper rifle and waits. Rambo and the mercenaries plan to rescue the missionaries and move out at precisely 1:15 AM. One by one, they each jump out of the truck at different points, taking up positions of attack. Most of the soldiers are busy in a hut, watching captured women dance and throwing things at them. Rambo finds Michael and another missionary in a cage, with a dead missionary nearby (still being eaten by the pigs). He frees them and tells them to stay put until he comes back. Sarah remains held captive, tied up underneath a hut. The soldier who lives in the hut drinks some alcohol and walks off. At Aye's hut, a soldier brings him a young boy and Aye strokes his hair. He then shuts the door, implying that he'll have sex with the boy.The soldiers in the main hut get more rowdy and start throwing the dancers off the stage. One Burmese officer takes a woman for himself and runs off to his hut. He roughs her up a bit and she crawls underneath the hut. En-Joo happens to be there, and when the soldier looks underneath he is stabbed to death by En-Joo. Rambo meets up with Reese, and tells him to retrieve Michael and the missionary he freed. Diaz frees some of the caged women and they make their way towards the gate. Rambo eventually finds where Sarah is, but the drunken soldier comes back and takes her upstairs. He throws her on the floor and is about to rape her when Rambo sneaks up behind him and rips his throat out with his bare hands. School Boy kills the guards at the gate with his sniper rifle, which allows the others to escape.At 1:15 AM Rambo and Sarah aren't back yet. Lewis and the others are ready to leave, but School Boy says that they should wait for them. Michael also doesn't want to leave without Sarah, but Lewis throws him down and threatens him with his knife. They all decide to run off and leave Rambo behind.Rambo and Sarah get to the gate, but are held at gunpoint by two soldiers. Rambo jumps on Sarah to shield her from being shot. One soldier is blasted in the chest and goes flying back. The other soldier has his head blown off and his body flies back like a rag doll. School Boy had stayed behind to wait for them. He tells them that it will be dawn in an hour, and so they take off running into the jungle.When dawn comes, the soldiers find the dead soldiers and sound the alarm. Lt. Aye comes across the corpse of the officer who had his throat ripped out. They all mount up and take off into the jungle with dogs. While the mercenaries and the remaining missionaries run in the jungle, Lewis steps on a mine and his leg is shredded. Also, their guide has run off and ditched them. Michael tells the others to make a stretcher from the bamboo around them, and they carry Lewis out with them.Elsewhere, School Boy hears the dogs the soldiers have and realizes that they are tracking them. Rambo takes his Claymore mine and ties a piece of Sarah's shirt around his boot. He then has School Boy fire off a shot and orders them to get to the boat without him. The mercenaries hear the shot and pick up the pace while the soldiers also move faster. Rambo runs by himself through the jungle while the soldiers with the dogs chase after him. Rambo reaches the old WWII bomb and sets up the Claymore mine on it. He quickly covers it up and runs off again. The soldiers with the dogs are lead to the mine and bomb. When they inspect it closer, they pull the tripwire, exploding the Claymore & the large bomb which kills all the soldiers around it and destroys a good chunk of the jungle. Rambo is knocked off his feet by the blast but continues on to the boat.School Boy and Sarah almost make it to the boat when they stop suddenly. Sarah asks him what's wrong, and School Boy shows her with his sniper scope. Lewis and the others made it to the boat, but so have Aye and his men. The soldiers brutally beat the mercenaries and missionaries. Aye then personally walks to each one and viciously beats them with a bamboo stick. Lewis calls him a pussy, and so Aye jams the bamboo stick into his leg wound. School Boy also sees somewhere behind him that there's a jeep with a mounted .50 caliber machine gun in the back. The soldiers line up everyone and prepare to kill them. School Boy says that there's nothing they can do. Slowly, Rambo appears behind the soldier using the mounted machine gun and decapitates him with his blade. He then grabs the heavy machine gun and blasts the soldier in the front seat, splattering his body everywhere. Rambo opens fire on the other soldiers. The .50 caliber cannon's power is devastating, sending their body parts flying in the air. Lewis and the others fight back and kill off the soldiers around them. More Burmese soldiers come, but Rambo continues to mow them down into nothing.The guide comes back with Karen rebel soldiers, joining the battle. Aye calls in support from an army gunboat, which fires upon the rebel soldiers. During the carnage, Diaz is set on fire by a flamethrower and Aye kills a missionary before running off. Lewis kills a soldier that was about to throw a grenade. Unfortunately, the grenade falls near En-Joo, and the explosion kills him. Lewis is shot in the shoulder by a soldier, but the pacifist Michael tackles the soldier and beats him to death with a rock. Rambo is shot through the shoulder by one of the soldiers on the gunboat. He sees another truck full of Burmese soldiers coming straight for him, and so Rambo annihilates the soldiers by firing at them with the .50 caliber gun. He then fires upon the ship, causing one guy's head to explode, and the guide blows it up with an RPG launcher.Aye runs off by himself into the jungle, but is stabbed through the abdomen by Rambo with his blade. As Rambo looks at the man with his trademark snarl, he suddenly slices the man's abdomen open and kicks his body down a hill. Rambo stands on top of the hill, looking down upon the survivors of the battle. Sarah looks around for Michael, and is relieved to find him alive. Lewis is still alive, as is School Boy, but Reese's corpse is seen nearby. Michael waves to Rambo as he stands by himself and nurses his shoulder wound.Next, we see Rambo back in the USA walking down a highway, wearing his green army jacket and carrying a bundle over his shoulder. Rambo makes his way to a mailbox which has \"R. Rambo\" stenciled on it. The film ends with him looking back at the paved road from which he came, and then finally walking back to his home along a dirt road towards the Rambo farm."
        ],
        "summaries": [
          "In Thailand, John Rambo joins a group of mercenaries to venture into war-torn Burma, and rescue a group of Christian aid workers who were kidnapped by the ruthless local infantry unit.",
          "Vietnam veteran John Rambo has survived many harrowing ordeals in his lifetime and has since withdrawn into a simple and secluded existence in Thailand, where he spends his time capturing snakes for local entertainers, and chauffeuring locals in his old PT boat. Even though he is looking to avoid trouble, trouble has a way of finding him: a group of Christian human rights missionaries, led by Michael Burnett and Sarah Miller, approach Rambo with the desire to rent his boat to travel up the river to Burma. For over fifty years, Burma has been a war zone. The Karen people of the region, who consist of peasants and farmers, have endured brutally oppressive rule from the murderous Burmese military and have been struggling for survival every single day. After some inner contemplation, Rambo accepts the offer and takes Michael, Sarah, and the rest of the missionaries up the river. When the missionaries finally arrive at the Karen village, they find themselves part of a raid by the sadistic Major Pa Tee Tint and a slew of Burmese army men. A portion of the villagers and missionaries are tortured and viciously murdered, while Tint and his men hold the remainder captive. Concerned by their disappearance, the minister in charge of the mission gathers a group of mercenaries and pleas Rambo transport them with his boat, since he knows their last exact location. But Rambo can't stay behind: he joins the team where he belongs, to liberate the survivors from the clutches of Major Tint in what may be one of his deadliest missions ever",
          "In this latest Rambo installment, John Rambo has retreated to a simple life in a rural Thai village near the Burmese border, capturing snakes for local entertainers, and transporting roamers in his old PT boat. Following repeated pleas, Rambo helps ferry a group of Christian aid workers into war-torn Burma, where the local Karen villagers are regularly tortured and massacred by Major Tint's sadistic soldiers. The humanitarian mission is going well, until the village is attacked and the missionaries are kidnapped, and Rambo is once again asked to transport - but this time a group of mercenaries, assembled by the missionaries' minister on a deadly rescue mission. This time he doesn't stay behind.",
          "In Thailand, John Rambo is living peacefully capturing snakes and transporting people and cargo in an old boat. When a group of Christian missionaries asks to be transported to the war zone in Burma to help the locals, the reluctant Rambo only accepts when Sarah Miller presents her point of view about their humanitarian mission. Rambo leaves the group in the requested location, but the village where they are working is attacked by the sadistic army of Major Pa Tee Tint, the locals are slaughtered and the missionaries are abducted. Later a member of their church meets Rambo and asks him to transport a group of mercenaries hired to rescue the missionaries.",
          "In Thailand, John Rambo is living peacefully capturing snakes and transporting people and cargo in an old boat. But when he joins a group of mercenaries to venture into war-torn Burma, and rescue a group of Christian aid workers who were kidnapped by the ruthless local infantry unit. Rambo refuses, but is convinced by another member, Sarah Miller, to take them up there. When the aid workers are captured by the Burmese army, Rambo decides to venture alone into the war zone to rescue them.",
          "Living peacefully somewhere in the green jungles of Thailand, nearly two long decades after the Afghan rescue mission in Rambo III (1988), the unstoppable killing machine, John Rambo, seems to have managed to put the bloodshed of war behind him. However, everything is about to change, when a dauntless team of optimistic missionaries gets captured in war-torn Burma by the vicious militia of the ruthless officer, Major Pa Tee Tint. Now, John has to go back into the mouth of Hell, on a life-or-death operation to save the condemned hostages. Wherever Rambo goes, carnage follows. Is there a point to deny the fact that he still is the perfect killer?",
          "When governments fail to act on behalf of captive missionaries, ex-Green Beret John James Rambo sets aside his peaceful existence along the Salween River in a war-torn region of Thailand to take action. Although he's still haunted by violent memories of his time as a U.S. soldier during the Vietnam War, Rambo can hardly turn his back on the aid workers who so desperately need his help."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "iS_NAIUBmFo8GYv0bnkt",
        "_score": 7.117094,
        "title": "Waterland",
        "year": 1992,
        "genders": [
          "Drama",
          "Mystery"
        ],
        "score": 6.6,
        "directors": [
          "Stephen Gyllenhaal"
        ],
        "writers": [
          "Graham Swift",
          "Peter Prince"
        ],
        "synopsis": [],
        "summaries": [
          "In 1974 Pittsburgh, a high-school history teacher seeking closure tells his class about his experiences as teenager in England during WWII.",
          "High-school history teacher Tom Crick is having trouble connecting--with his class, with his wife. He ventures into telling his class stories about his young adulthood in the Fens district in England. The emotional wounds from his younger life wash over him in the present day, affecting his work and his relationships with his students and his wife."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "aC_NAIUBmFo8GYv0bngs",
        "_score": 6.974304,
        "title": "Music Box",
        "year": 1989,
        "genders": [
          "Crime",
          "Drama",
          "Thriller"
        ],
        "score": 7.3,
        "directors": [
          "Costa-Gavras"
        ],
        "writers": [
          "Joe Eszterhas"
        ],
        "synopsis": [
          "Some children grow up believing their parents are perfect. This film asks: what happens when a father is accused of being a notorious Hungarian war criminal 40 plus years after the fact? His lawyer daughter wants to prove he's innocent. In that effort a judge, prosecutor and his lawyer daughter travel to Budapest to meet with a \"surprise\" prosecution witness who will \"nail the coffin\" of the accused man. But, they find this witness is a liar. The lawyer daughter, happy believing she's vindicated her father, travels to meet the sister of a military friend of her father's on her way home. While visiting the woman, she asks the lawyer daughter to retrieve and send to her a pawned, old and beautiful Hungarian music box. Once in her hands the lawyer daughter discovers a horrifying truth hidden inside."
        ],
        "summaries": [
          "A lawyer defends her father accused of war crimes, but there is more to the case than she suspects.",
          "Hungarian immigrant Mike Laszlo has done well for himself since arriving in the USA over 40 years ago after WWII's end. He is particularly proud of his daughter, Ann, a successful lawyer. Following the release of some secret WWII records by the Russians, Mike finds himself accused of being a notorious war criminal. He's convinced it's a Communist plot to discredit him and insists that Ann defend him in court."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "TC_NAIUBmFo8GYv0boMw",
        "_score": 6.838028,
        "title": "The Young Black Stallion",
        "year": 2003,
        "genders": [
          "Adventure",
          "Drama",
          "Family"
        ],
        "score": 5.4,
        "directors": [
          "Simon Wincer"
        ],
        "writers": [
          "Walter Farley",
          "Steven Farley",
          "Jeanne Rosenberg"
        ],
        "synopsis": [],
        "summaries": [
          "A young girl befriends a wild black stallion.",
          "A prequel to the 1979 classic The Black Stallion--a family drama that presents the horse's adventures with a young girl named Neera, who has been separated from her father in Arabia by WWII. Left alone in the desert, she befriends the wild colt whom she names Shetan. Once reunited with her father, however, Neera remains haunted by the images of the lost horse in the desert--one of a few stallions of legend, rumored to be born of the sands, sired by the night sky, drinkers of the wind."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "8y_NAIUBmFo8GYv0bn4u",
        "_score": 6.707831,
        "title": "Train of Life",
        "year": 1998,
        "genders": [
          "Comedy",
          "Drama",
          "War"
        ],
        "score": 7.6,
        "directors": [
          "Radu Mihaileanu"
        ],
        "writers": [
          "Radu Mihaileanu"
        ],
        "synopsis": [],
        "summaries": [
          "In 1941, the inhabitants of a small Jewish village in Central Europe organize a fake deportation train so that they can escape the Nazis and flee to Palestine.",
          "Central Europe, WWII. The village fool of a small Jewish community warns the townsfolk that the Nazis are coming, and advises them to build a fake deportation train to cross the Russian border and get to Palestine. Some Jews are dressed up with German uniforms, and soon they start getting strange ideas about how it feels to be a Nazi; others are infected with the fast-spreading germ of communism. Meanwhile, the Russian border gets closer and closer..."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Ni_NAIUBmFo8GYv0bpI1",
        "_score": 6.5833144,
        "title": "100 Years of Evil",
        "year": 2010,
        "genders": [
          "Adventure",
          "Comedy",
          "History"
        ],
        "score": 4.8,
        "directors": [
          "Erik Eger",
          "Magnus Oliv"
        ],
        "writers": [
          "Olly Blackburn",
          "Erik Eger",
          "Magnus Oliv"
        ],
        "synopsis": [
          "Did Adolf Hitler live on after the war under an assumed identity? Follow the footsteps of Hitler doppelganger Adolf Munchenhauser's life in U.S., where he masterminds McCarthy's communist hunt, the Cuba crisis and the invention of fast food."
        ],
        "summaries": [
          "Did Adolf Hitler survive WWII and live on under an assumed identity? Norwegian researcher Skule Antonsen sides with Spanish documentary filmmaker Idelfonso Elizalde to follow in the footsteps of Adolf Munchenhauser, a Hitler look alike captured by the Allied forces in Berlin 1945. When Munchenhauser is released from Camp Rebecca in 1946, a secret prison camp in the Nevada Desert, he decides to stay in the U.S. Skule digs into Munchenhausers life and hears a lot of stories, but none of them reveal his real identity. Is it possible that Adolf Munchenhuser really was Adolf Hitler? As Skule digs deeper for the truth it becomes clear that there are powerful forces that will do anything to stop him."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "_C_NAIUBmFo8GYv0boIw",
        "_score": 6.4641147,
        "title": "Kukushka",
        "year": 2002,
        "genders": [
          "Comedy",
          "Drama",
          "War"
        ],
        "score": 7.7,
        "directors": [
          "Aleksandr Rogozhkin"
        ],
        "writers": [
          "Aleksandr Rogozhkin"
        ],
        "synopsis": [],
        "summaries": [
          "In WWII, a Finnish sniper is left chained to a rock by German soldiers, while a captain of the Red Army, en route to his court martial, is almost blown up by Russian planes. A Lapp woman gives a shelter to both of them at her farm.",
          "September of 1944, a few days before Finland went out of the Second World War. A chained to a rock Finnish sniper-kamikadze Veikko managed to set himself free. Ivan, a captain of the Soviet Army, arrested by the Front Secret Police 'Smersh', has a narrow escape. They are soldiers of the two enemy armies. A Lapp woman Anni gives a shelter to both of them at her farm. For Anni they are not enemies, but just men."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "CC_NAIUBmFo8GYv0bnst",
        "_score": 6.3694077,
        "title": "Frankie Starlight",
        "year": 1995,
        "genders": [
          "Drama",
          "Romance",
          "War"
        ],
        "score": 6.5,
        "directors": [
          "Michael Lindsay-Hogg"
        ],
        "writers": [
          "Ronan O'Leary",
          "Chet Raymo"
        ],
        "synopsis": [],
        "summaries": [
          "A writer with dwarfism shares the story of his unconventional, though not altogether bad, upbringing as his mother struggled to raise him in the mid-20th century with help from a surrogate father.",
          "This is a story of a man (Walker) living with dwarfism who writes an autobiographical account of his life. Flashbacks show he was conceived by a woman (Parillaud) at the end of WWII as she attempts to smuggle herself to America on a troop ship. Caught, she is put ashore back in her homeland of Ireland where she struggles to bring up her dwarf child. Then comes an ongoing affair with a man (Byrne) who becomes a surrogate father to the boy, teaching him about the stars and planets... and calling him \"Frankie Starlight.\" After that affair she meets a man (Dillon) who takes her and the boy to America, but they are misfits in the prairie lands of the West and soon return home to Ireland where the boy grows to manhood as a writer.",
          "This is an enigmatic story of a man (Walker), suffering from dwarfism, who writes an autobiographical account of his life. Flashbacks show how he was conceived by a French woman (Parillaud) at the end of WWII as she attempts to smuggle herself to America on a troop ship. Caught, she is put ashore in Ireland where she struggles to bring up her dwarf child. She has a short affair with Jack Kelly (Byrne), an officer from the ship she stowed away on, who becomes a surrogate father to the boy, teaching him about the stars and planets. Then she meets Terry (Dillon), a drifter who also remembers her from the ship. He takes her and her boy to America, but they are misfits on the western prairie and soon return to Ireland, where the boy grows to manhood as a writer. An interesting twist at the end brings it together beautifully."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Oy_NAIUBmFo8GYv0bnst",
        "_score": 6.3498974,
        "title": "Les Misérables",
        "year": 1995,
        "genders": [
          "Drama",
          "History"
        ],
        "score": 7.5,
        "directors": [
          "Claude Lelouch"
        ],
        "writers": [
          "Victor Hugo",
          "Claude Lelouch"
        ],
        "synopsis": [
          "This movie is basically the original story of Les Miserables, used in the time of World War Two. Basically an ex boxer, an ex dancer and their daughter are trying to get away from the Nazis (obviously becuse they are Jewish). In that they meet a man who can be referred to as the 20th century Jean Valjean (of the original play). If you know who he is and the original play, you can match up the story and how it is Les Miserables of World War 2. During the course of the film the family is seperated but in the end they continue to live out the original story of Les Miserables and reunite with the help of Henry Fortin (or Jean Valjean). There are a few differences between the original play and this one that are left out but the beautiful drama of a story still lives within the horrors of World War 2 and have the same impact as it should."
        ],
        "summaries": [
          "A variation on Victor Hugo's classic novel by means of the story of a man whose life is affected by and somewhat duplicated by the Hugo story of the beleaguered Jean Valjean.",
          "Henri Fortin is poor and iliterate former boxer. Ziman is rich Jewish lawyer from Paris. During WWII they meet when Fortin agrees to drive Ziman's family to Switzerland. Intrigued by Victor Hugo's novel \"Les Miserables\", Fortin asks the Zimans to read that book to him during the travel. Before the end of movie every main character would see his character in situations similar to those in Hugo's novel.",
          "A variation on Victor Hugo's classic novel by means of the story of a man whose life is affected by and somewhat duplicated by the Hugo story of the beleaguered Jean Valjean."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "OC_NAIUBmFo8GYv0boky",
        "_score": 6.240358,
        "title": "War of the Dead",
        "year": 2011,
        "genders": [
          "Action",
          "Adventure",
          "Horror"
        ],
        "score": 4.1,
        "directors": [
          "Marko Mäkilaakso"
        ],
        "writers": [
          "Marko Mäkilaakso",
          "Barr B. Potter"
        ],
        "synopsis": [
          "March 1942. Captain Martin Stone (Andrew Tiernan - 300, The Pianist) leads an American unit on a mission to destroy an enemy bunker; joining forces with an elite platoon of Finnish soldiers; Cpt. Niemi (Jouko Ahola - Kingdom of Heaven) and Ltnt. Laasko (Mikko Leppilampi). The troops are torn apart by the same enemy soldiers they had killed a few minutes earlier in an ambush. The living dead? Evil forces? Or SS experiments gone wrong?"
        ],
        "summaries": [
          "A platoon of American and Finnish soldiers is driven deep into a Russian forest where its Captain discovers a terrifying secret.",
          "This is a movie set during WWII and involves Captain Stone and a platoon of American and Finnish soldiers on a mission to find a bunker held by the Germans. On the way there they come under fire and at the same time run in to some German soldiers that seem to be \"undead\". How is this possible? Their platoon is almost completely killed off apart from a few of them, including Capt. Stone. They move on and run in to another survivor, a Russian soldier. They all try to survive and end up at the bunker they were meant to take out. But once inside they find out just how the German soldiers became the \"undead\"."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "7C_NAIUBmFo8GYv0bpE1",
        "_score": 6.240358,
        "title": "Remembrance",
        "year": 2011,
        "genders": [
          "Drama",
          "Romance",
          "Thriller"
        ],
        "score": 7.2,
        "directors": [
          "Anna Justice"
        ],
        "writers": [
          "Pamela Katz",
          "Anna Justice"
        ],
        "synopsis": [],
        "summaries": [
          "A Polish man rescues a Jewish woman during the chaos of WWII, but they become separated until a chance encounter over 30 years later in New York reunites them.",
          "Die Verlorene Zeit (Remembrance) depicts a remarkable love story that blossomed amid the terror of a German concentration camp in 1944 Poland. This impossible passion fuels the courage of a Polish prisoner who manages to rescue his Jewish girlfriend. Against all odds, they escape the camp and survive a treacherous journey to freedom. But during the chaos of the end of the war, they are forcibly separated and each is convinced that the other has died. More than 30 years later in New York, the happily married 52-year-old woman accidentally finds out that her former Polish lover is still alive. And she must see him again."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "gy_NAIUBmFo8GYv0bpc3",
        "_score": 6.240358,
        "title": "Brothers of War",
        "year": 2015,
        "genders": [
          "Drama",
          "War"
        ],
        "score": 4.4,
        "directors": [
          "Mike Carter"
        ],
        "writers": [
          "Mike Carter"
        ],
        "synopsis": [
          "Farm boy, Jake (Daniel Attwell), lives for girls, guns and adrenalin; his younger brother, Greg (Rory Finn), loves poetry. The tensions and bitter rivalry between the two finally erupt into bloody, life-changing violence. With the dark clouds of war looming over Englands green and pleasant land, it is Greg who unexpectedly signs up for front line battle in France.Against a backdrop of chaos and uncertainty, Greg discovers a world of uncompromising brutality. His journey through war-torn France exposes the very best and very worst of human nature along with the realisation that, no matter how far you run, the past will always find a way of catching up with you."
        ],
        "summaries": [
          "With the world on the brink of WWII, a violent rivalry over the same woman tears two brothers apart. Seeking redemption, the younger brother escapes to the front lines of battle.",
          "Farm boy, Jake, lives for girls, guns and adrenalin; his younger brother, Greg, loves poetry. The tensions and bitter rivalry between the two finally erupt into bloody, life-changing violence. With the dark clouds of war looming over England's green and pleasant land, it is Greg who unexpectedly signs up for front line battle in France. Against a backdrop of chaos and uncertainty, Greg discovers a world of uncompromising brutality. His journey through war-torn France exposes the very best and very worst of human nature along with the realisation that, no matter how far you run, the past will always find a way of catching up with you."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "qi_NAIUBmFo8GYv0boUx",
        "_score": 6.1352143,
        "title": "72 metra",
        "year": 2004,
        "genders": [
          "Drama",
          "Action",
          "Thriller"
        ],
        "score": 6.5,
        "directors": [
          "Vladimir Khotinenko"
        ],
        "writers": [
          "Aleksandr Pokrovsky",
          "Valeri Zalotukha",
          "Vladimir Khotinenko"
        ],
        "synopsis": [],
        "summaries": [
          "Every second is precious for a Russian submarine crew, as they are stranded 72 meters below the ocean's surface.",
          "The film begins in the 1980s Soviet Union. Two best friends, Orlov and Muravyev, are serving at the Black Sea Navy Base in Sevastopol, Crimea. Both fall in love with one beautiful girl Nelly, and their friendship suffers a first blow. Because she picks Muravyev, his friend Orlov struggles with an inferiority complex and becomes a secretive alcoholic. After the collapse of the Soviet Union in 1991, both friends are transferred to the Northern Fleet on the Polar Ocean. One day their sub is performing a routine training. A disturbed WWII mine slowly moves on a collision course with the sub. A mighty blast knocks down everyone inside the wrecked sub, 72 meters below the sea level. Then ensues a nerve-racking struggle for survival."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Ey_NAIUBmFo8GYv0boEv",
        "_score": 6.0989256,
        "title": "Werckmeister Harmonies",
        "year": 2000,
        "genders": [
          "Drama",
          "Mystery"
        ],
        "score": 8,
        "directors": [
          "Béla Tarr",
          "Ágnes Hranitzky"
        ],
        "writers": [
          "László Krasznahorkai",
          "Béla Tarr",
          "Péter Dobai"
        ],
        "synopsis": [
          "Werckmeister Harmonies is an allegory of the post WWII Eastern European political systems told as a b&w filmmatic poem with 37 long single camera shots.The film was made post the end of the cold war in Hungary 2000 it is based on a 1989 book \"The Melancholy of Resistance\" written during the time of the iron curtain by László Krasznahorkai. It examines the brutalisation of a society its political systems and dogmas through the metaphor of a decaying circus whale and its star performer. It is set in a desolate, isolated small town in Hungary during Soviet times.The film starts with János Valuska, a simple citizen, conducting a poem and dance with drunken bar patrons. The dance is of the total eclipse of the sun, which disturbs than silences the animals, but it finishes with the grand return of the warm sunlight.A reoccurring theme is the transitions from darkness to light. In the opening scene the light represent the warm sun of self determination which transitions to the people thrown out through a door in to the dark of night. The circus arrives like a Trojan Horse in the darkness of night. There is a wonderful poetic scene were the lead character walks in and out of the shadows .The film is in b&wHis uncle György is a composer, and therefore one of the elite. György observes the imperfection and compromise of the musical scale (as defined by Andreas Werckmeister a historical theorist). György proposes changes to the scale to make it more harmonious. György's utopian approach to music represents a flawed naive idealism that never can be achieved, it is not developed any further in the film or the book. It is just a statement that human governance will always be flawed. A less cryptic name for the film might be The Inevitably Flawed Paradox of Human Governance but that would destroy the enigma that this film is. It is an acknowledgement even when light of self government comes there will still be flaws because we are human.György's estranged wife tries to leverage her political and social status by giving György a list of names to sign up for the \"clean up the town movement\", this with the blessing of the police chief.However a stuffed smelly circus whale and its star performer, Prince, comes to town this is used a metaphor for a bloated political system and the unseen Prince who represents the power of politically inspired, emotive dogma.János philosophises about God and the beast (each viewer will interpret this differently).The post office workers are unsettled by the ominous disturbing signs of the circuses arrival and are disturbed by the cloud that settles over each town it visits (a reference to the spread of the externally imposed centralised monolithic government system onto the Soviet buffer nations, just after the war).György's struggling cobbler brother gets the list and passes it on to the agitated throbbing masses in the town square who are unhappy at public services failing.György's former wife sleeps with the drunk gun toting chief.The presence of the whale and the Prince stir up the masses.\nJános overhears the circus master losing control of his faceless Prince, who is becoming drunk with his own voice of revolutionary dogma. The circus master disowns him. The Prince, now free, inflames the masses.The people riot.The film is shot as a beautiful but disturbing visual poem. Long single shot scenes with a hypnotic and rhythmetic pace build up to the disconnected yet peaceful observation of the thuggish destruction of the hospital and its patents and the brutal inhumanity of the rioters, which almost seems normal and natural. You almost become one of the rioters as you get swept up in this pointless crowd-think not knowing or caring where it is going. Social upheaval does not always need a reason.When the rioters finally come to beating a helpless old naked patent they see their impotent sad and powerless selves. The sick helpless patents in the hospital are a mirror of the rioters themselves.After the riot János comes across the diary of a rioter it explains that the rioters did not know what they were angry with; so they were angry at everything, than it recounts the mobs horrendous rape of two working class post office girls.János comes across his killed cobbler uncle who got naively involved in the riot. János is told, by his cobbler uncles wife, to leave town for his own safety.He is intercepted by a helicopter. He finds himself committed to a mental institution with caged beds (a tool of the time for dealing with political dissidents). János appears drugged and broken.György his composer uncle is evicted from their society house but gets to live in a shed in the garden whilst György's former wife, with her new status as a collaborator, now occupies the big house with the police chief. The intelligentsia is displaced by political opportunism.György tells a vacant János, in the ward, that IF he is released from the mental institution they can live contentedly together in the shed with his piano, János just stares.It finishes with György looking directly into the eye of the whale than, walking away and looking back at the now sad and dishevelled whale, destroyed by the rioters the night before, its rotting carcass slowly enveloped by the fog which gets whiter and brighter.The camera pans up as warm bright sunlight returns............The director worked closely with the author. The book looks at the myopic petty interpersonal effects at roots of the situation however the film instead examines the overview of the forest. Like the film the book has paragraphs a chapter long. It spends 5 pages on a decaying corpse but not that of the whale.Gerard Hosier"
        ],
        "summaries": [
          "A naive young man witnesses an escalation of violence in his small hometown following the arrival of a mysterious circus attraction.",
          "This story takes place in a small town on the Hungarian Plain. In a provincial town, which is surrounded with nothing else but frost. It is bitterly cold weather - without snow. Even in this bewildered cold hundreds of people are standing around the circus trailer, which is put up in the main square, to see - as the outcome of their wait - the chief attraction, the stuffed carcass of a real whale. The people are coming from everywhere. From the neighboring settlings, even from quite far away parts of the country. They are following this clumsy monster as a dumb, faceless, rag-wearing crowd. This strange state of affairs - the appearance of the foreigners, the extreme frost - disturbs the order of the small town. Aambitious personages of the story feel they can take advantage of this situation. The tension growing to the unbearable is brought to explosion by the figure of the Prince, who is pretending facelessness. Even his mere appearance is enough to break loose destructive emotions...",
          "The story takes place in Hungary, shortly after WWII. Events center around young János Valuska. Trustworthy, caring and respectful, János enjoys a modest yet peaceful existence with his close knit, extended family. Undaunted by cosmic events that will soon overshadow the whole community, the artistically inspired János directs and narrates a performance for a motley crew of intoxicated misfits in a local bar. Shortly thereafter, a new exhibit featuring a great whale and a foreign prince arrives in town. Apparently, this public display has already caused much commotion in neighboring towns, and once again trouble appears to be brewing. Aunt Tünde tries to organize a committee to restore order. Uncle György, a reclusive reactionary, wants nothing to do with this 'media circus', but in order to avoid confronting his wife directly, he reluctantly agrees to be the chairman. János goes to see the whale and eventually realizes that the exhibit is indeed a diabolical threat to the community, but he still does not understand how or why. Events reach a frightening climax when a mob of angry citizens ransack a hospital. When all the smoke and debris has finally settled, János is left even more clueless than he had been to start. The film insinuates that the Soviets deliberately provoked social unrest in Hungary so as to provide context for a justifiable military takeover. Those who naively cooperated with the Soviets became puppets. Others who opposed the Soviets were either killed or ostracized. The big 'fish out of water' represents the elite members of Hungarian society, who were rendered utterly powerless and useless."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "0i_NAIUBmFo8GYv0bpU3",
        "_score": 6.034206,
        "title": "Secrets of War",
        "year": 2014,
        "genders": [
          "Drama",
          "Family",
          "History"
        ],
        "score": 7.1,
        "directors": [
          "Dennis Bots"
        ],
        "writers": [
          "Tanja Chung",
          "Jacques Vriens",
          "Karin van Holst Pellekaan"
        ],
        "synopsis": [
          "The kids in the film are named Lambert (Joes Brauers), Tuur (Maas Bronkhuyzen), and Maartje (Pippa Allen). Lambert's family are cooperative with the German occupiers, which makes them unpopular with many of their fellow villagers, but makes it possible for Lambert's father to be installed as the village mayor. Lambert's elder brother has joined the Hitlerjugend (Hitler Youth) and their father is trying to persuade Lambert to do the same. Lambert is not really interested in doing so, but his father gives him a model train set as enticement (he may have already had the train set, but it's not clear) and promises him a very nice locomotive for the set if he will do it.\nLambert's best friend Tuur doesn't seem to care if Lambert joins the Hitlerjugend or not, but he learns one night that his parents and elder brother are members of the local resistance network. His family does not know that he has become aware of their secret.\nBefore Tuur learns his family's secret, tomboy Maartje enters the picture. Maartje has moved to the village and is staying with her uncle's family. She isn't interested in befriending the girls in the village, and instead inserts herself into Lambert's and Tuur's friendship. Lambert welcomes Maartje, but Tuur isn't real crazy about having her around. Tuur begins to warm up to Maartje as she proves she isn't a girly-girl. One day when Lambert cannot join the other two, Maartje shares with Tuur that she is a Jew (which the audience has already been given clues to figure out) and she swears him to secrecy.\nKnowing that Maartje is a Jew whose real name is Tamar, and after learning that his family is in the resistance, and with Lambert's family collaborating with the Germans, Tuur begins avoiding Lambert. One Sunday after Tuur promises Lambert that they will hang out together, Tuur tells Lambert that he must help his little sister with her homework. Lambert goes to the farm where Maartje is staying and sees Tuur and Maartje playing with Maartje's pet pig, which was supposed to have been turned over to the Germans with all of the other pigs in the country to feed the German Army. Lambert tells his father that Maartje has a pig, and when the Germans go to confiscate the pig, they of course discover that Maartje is a Jew and they arrest her and her host family. Lambert has a club foot and a distinctive footprint, which Tuur saw in the mud outside Maartje's barn, so he realizes that Lambert was the one that betrayed Maartje. Tuur becomes enraged and assaults Lambert, and severs their friendship.\nUnder interrogation, Maartje's host family reveals that Tuur's family is part of the resistance, but Tuur's father finds out in time to get his family out of the house and into the countryside. Lambert gets food for Tuur's family to aid them in their successful attempt to cross the border into Belgium. Before leaving, Tuur and Lambert declare their friendship for each other again before parting ways."
        ],
        "summaries": [
          "During WWII, the friendship of two boys is at risk when a girl tells a very personal secret to only one of them.",
          "Summer 1943. Tuur and Lambert are best friends. The surrounding of their idyllic village has no secrets for the teenagers. From the farm of Lamberts dad to the marl caves in the woods - it's their world. But the war is closing in and is about to change their lives forever. Tuur's dad joined the resistance and even his big brother seems to be a part of it. Lambert's family on the other hand choose to obey the Germans. Then a new girl from the city shows up, befriending the boys but telling her secret to only one of them. A choice that separates the boys and ultimately gets her in trouble. Tuur not only risks losing his friendship with Lambert, but even his whole family. He will have to stop at nothing to safeguard both."
        ]
      }
    ]
  }
}
