{
  "took": 159,
  "timed_out": false,
  "_shards": {
    "total": 1,
    "successful": 1,
    "skipped": 0,
    "failed": 0
  },
  "hits": {
    "total": {
      "value": 29,
      "relation": "eq"
    },
    "max_score": 67.61908,
    "hits": [
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Fi_NAIUBmFo8GYv0bpE1",
        "_score": 67.61908,
        "title": "Inside Job",
        "year": 2010,
        "genders": [
          "Documentary",
          "Crime"
        ],
        "score": 8.2,
        "directors": [
          "Charles Ferguson"
        ],
        "writers": [
          "Charles Ferguson",
          "Chad Beck",
          "Adam Bolt"
        ],
        "synopsis": [
          "The subject of Inside Job is the global financial crisis of 2008. It features research and extensive interviews with financiers, politicians, journalists, and academics. The film follows a narrative that is split into five parts.The film focuses on changes in the financial industry in the decade leading up to the crisis, the political movement toward deregulation, and how the development of complex trading such as the derivatives market allowed for large increases in risk taking that circumvented older regulations that were intended to control systemic risk. In describing the crisis as it unfolded, the film also looks at conflicts of interest in the financial sector, many of which it suggests are not properly disclosed. The film suggests that these conflicts of interest affected credit rating agencies as well as academics who receive funding as consultants but do not disclose this information in their academic writing, and that these conflicts played a role in obscuring and exacerbating the crisis.A major theme is the pressure from the financial industry on the political process to avoid regulation, and the ways that it is exerted. One conflict discussed is the prevalence of the revolving door, whereby financial regulators can be hired within the financial sector upon leaving government and make millions.Within the derivatives market, the film contends that the high risks that began with subprime lending were transferred from investors to other investors who, due to questionable rating practices, falsely believed that the investments were safe. Thus, lenders were pushed to sign up mortgages without regard to risk, or even favoring higher interest rate loans, since, once these mortgages were packaged together, the risk was disguised. According to the film, the resulting products would often have AAA ratings, equal to U.S. government bonds. The products could then be used even by investors such as retirement funds who are required to limit themselves to the safest investments.Another point is the high pay in the financial industry, and how it has grown in recent decades out of proportion to the rest of the economy. Even at the banks that failed, the film shows how bank executives were making hundreds of millions of dollars in the period immediately up to the crisis, all of which was kept, again suggesting that the risk/benefit balance has been broken.One topic which few others have addressed is the role of academia in the crisis. Ferguson notes, for example, that Harvard University economist, and former head of the Council of Economic Advisers under President Ronald Reagan, Martin Feldstein, was a director of the insurance company AIG and former board member of the investment bank J.P. Morgan & Co..Ferguson also notes that many of the leading professors and leading faculty members of the economics and business school establishments often derive large proportions of their incomes from either engaging as consultants, or speaking engagements. For example, current dean of the Columbia Business School, Glenn Hubbard received a large percentage of his annual income from either acting as a consultant or through speaking engagements. Hubbard was also affiliated with KKR and BlackRock Financial. Hubbard as well as current chair of Harvard's department of economics, John Y. Campbell, deny the existence of any conflict of interest between academia and the banking sector.The film ends by contending that despite recent financial regulations, the underlying system has not changed; rather the remaining banks are only bigger, while all the incentives remain the same, and not a single top executive has been prosecuted for their role in the global financial meltdown."
        ],
        "summaries": [
          "Takes a closer look at what brought about the 2008 financial meltdown.",
          "'Inside Job' provides a comprehensive analysis of the global financial crisis of 2008, which at a cost over $20 trillion, caused millions of people to lose their jobs and homes in the worst recession since the Great Depression, and nearly resulted in a global financial collapse. Through exhaustive research and extensive interviews with key financial insiders, politicians, journalists, and academics, the film traces the rise of a rogue industry which has corrupted politics, regulation, and academia. It was made on location in the United States, Iceland, England, France, Singapore, and China.",
          "The global financial meltdown that took place in Fall 2008 caused millions of job and home losses and plunged the United States into a deep economic recession. Matt Damon narrates a documentary that provides a detailed examination of the elements that led to the collapse and identifies keys financial and political players. Director Charles Ferguson conducts a wide range of interviews and traces the story from the United States to China to Iceland to several other global financial hot spots.",
          "Narrated by Matt Damon, Inside Job is the first film to expose the shocking truth behind the economic crisis of 2008. The global financial meltdown, at a cost of over $20 trillion, resulted in millions of people losing their homes and jobs. Through extensive research and interviews with major financial insiders, politicians and journalists, Inside Job traces the rise of a rogue industry and unveils the corrosive relationships which have corrupted politics, regulation and academia."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "tS_NAIUBmFo8GYv0bn4u",
        "_score": 65.92929,
        "title": "The Sum of All Fears",
        "year": 2002,
        "genders": [
          "Action",
          "Drama",
          "Thriller"
        ],
        "score": 6.4,
        "directors": [
          "Phil Alden Robinson"
        ],
        "writers": [
          "Tom Clancy",
          "Paul Attanasio",
          "Daniel Pyne"
        ],
        "synopsis": [
          "The story opens during the 1973 Yom Kippur War. Egyptian and Syrian forces are on the verge of defeating Israel. As a last-ditch precautionary measure, a nuclear-armed A-4 Skyhawk is launched to ensure that Israeli ground forces are not completely overrun. The fighter jet is engaged by a Syrian surface-to-air missile battery and shot down. Among the widely scattered wreckage littering the barren desert below is an intact nuke, burrowed deep into the crater left by the crashing debris.Fast-forward 29 years to 2002. U.S. President J. Robert Fowler (James Cromwell) and his national security team are at Mt. Weather, Virginia participating in a nuclear war drill. After the drill, the President dispatches CIA Director William Cabot (Morgan Freeman) on an inspection tour of Russian nuclear sites according to the terms of the START arms treaty.At CIA headquarters in Langley, Virginia, young analyst Jack Ryan (Ben Affleck) is part of a group watching current video of Russian President Zorkin and sarcastically commenting on his recent weight gain. Simultaneously, a shadowy Neo-Nazi group is meeting in Vienna. Their leader, Richard Dressler (Alan Bates) laments the impotence of modern Europe in the face of global dominance by the United States and Russia. On the Golan Heights, an Arab scrap metal dealer is excavating the Israeli plane crash site from 1973. He strikes a hard object a few feet below the ground and realizes it is some type of bomb. Thinking it is valuable, he and his helper carefully finish uncovering the weapon and use a hoist to lift it onto their truck.The next morning, Jack Ryan is lazing in bed with his girlfriend Dr. Cathy Muller (Bridget Moynahan) when he receives an emergency phone call summoning him to Langley. President Zorkin has dropped dead of an apparent heart attack and has been quickly succeeded by Alexander Nemerov (Ciarán Hinds). As Ryan hurriedly dresses, his girlfriend wonders aloud what would constitute an emergency for a \"historian.\" Arriving at CIA headquarters, Ryan is collared by Director Cabot and hustled into a meeting. As part of his analyst job, Ryan had previously prepared an intelligence estimate on Nemerov. Cabot unexpectedly orders Ryan to accompany him on the trip to Russia.In the desert, an international arms dealer named Olson (Colm Feore) meets with the Arab scrap metal merchant and quickly recognizes the type of bomb he sees before him. He tells the Arab that the bomb is worthless, but offers to give him $400 for it since the man lost a son in the war. Once in possession of the weapon, Olson contacts Dressler and offers to sell him the bomb for $50 million.After a brief meeting in Moscow with Nemerov, Ryan and Talbot inspect a Russian nuclear site. Ryan shrewdly notices that three top nuclear scientists are absent from the facility. When questioned by Ryan, the Russian host gives a pat and unsatisfactory explanation. Cabot comments that if someone wanted to build a clandestine nuke, the missing scientists are the exact three they would need.Returning to Washington, Ryan is invited by Cabot to attend a black-tie gala at a posh hotel where President Fowler is speaking. Ryan and Cathy are thoroughly enjoying the evening until the President's speech is interrupted by aides who quickly whisk him away from the podium. A good percentage of the attendees also stand and exit. Ryan and Cabot hurry back to the White House situation room where they learn that Russian forces have shelled the breakaway province of Chechnya with chemical weapons, inflicting massive casualties. Those in the room debate the proper U.S. response, eventually favoring some form of diplomatic recognition for the Chechens. Ryan speaks up and suggests that President Nemerov had nothing to do with the attack, and that a separate hardline faction may have acted without his approval. Ryan's hypothesis falls flat with the others in attendance. After the meeting, Ryan finds a TV in another room and watches Nemerov give a conventional hardline speech justifying Russia's actions. After the speech, however, Nemerov boards an elevator in the Kremlin and angrily queries a senior advisor about the source of the chemical attack. He learns that hardline generals in the military acted on their own, just as Ryan had suggested. Nemerov issues orders to make the generals quietly disappear.In Vienna, Dressler's group meets to discuss their plan for the future of Europe. Dressler is seeking to provoke a nuclear confrontation between the United States and Russia. With the centers of capitalism and communism destroyed, fascism can arise once more in Europe. When one of the men expresses his doubts about the strategy, he is strangled to death.In the meantime, a CIA operative named John Clark (Liev Schreiber) has been dispatched to Russia to investigate the disappearance of the three nuclear scientists. He manages to pinpoint an abandoned Soviet military base in the Ukraine where the men might be working. Cabot sends Ryan to assist him and they manage to penetrate the compound, which shows no signs of current activity. Once inside, they discover that the entire nuclear team has been murdered. There is also clear evidence of nuclear weapons activity, but it looks as if the finished product has already been crated and shipped. Ryan asks a colleague at Langley to track down recent shipping activity from the area, and he reports that a large crate was indeed picked up and sent from Kiev to its final destination by air and sea. That destination was the port of Baltimore.At a dockside warehouse, one of Dressler's true believers uses a forklift to load the refrigerator-sized crate onto a pickup truck. The deadly cargo is delivered beneath Baltimore's NFL football stadium, where it is uncrated and revealed to be a cigarette vending machine with a small nuclear weapon concealed inside. President Fowler is scheduled to attend a game at the stadium later in the day.Ryan calls Cabot to warn him about the threat, not realizing that he is attending the football game with the President. Boarding a helicopter for Baltimore, Ryan keeps trying to get through and finally reaches Cabot. Cabot suddenly realizes with horror that the stadium is the likely target. The President is immediately hustled out and his motorcade speeds away from the stadium, but they are unable to outrun the shock wave from the exploding nuke. The Presidential motorcade is blasted off the highway as Ryan's helicopter is also knocked to the ground. Military rescue personnel retrieve the slightly-injured President from his limousine and put him aboard Air Force One. A stunned Ryan is able to escape from the wreckage of the helicopter. In the distance, he sees a mushroom cloud forming over Baltimore. He can only hope that Cathy is safe.As the President tries to sort things out aboard Air Force One and Nemerov tries to maintain a safe distance from the tragedy, a corrupt Russian Air Force general in the pay of Dressler tells a squadron of his Backfire bomber pilots that the U.S. has attacked Moscow. He orders an attack on a U.S. aircraft carrier in the North Sea. The Backfires launch a salvo of cruise missiles at the ship, destroying the conning tower and one of the elevators. President Fowler orders a retaliatory strike by F-16s against the Russian airbase from which the Backfires were launched. The U.S. and Russia teeter on the edge of nuclear war, just as Dressler had hoped. Each escalation by one side is matched by the other.Convinced that Nemerov didn't order the attack, Ryan urgently requests a soil sample from the blast site. An analysis conclusively proves that the plutonium came from a U.S. nuclear processing facility, not Russia. Ryan manages to locate the mortally injured William Cabot, who suggests that he enlist the help of John Clark in tracing the bomb's origin. Cabot then expires and Ryan, before leaving, takes a plastic bag holding Cabot's effects. Clark, in the Middle East, learns that the plutonium was provided to Israel in 1968. He tracks down the Arab scrap metal dealer, who is dying of radiation sickness. The man tells him that he sold the bomb to Olson, the arms dealer. A CIA hacker is able to penetrate Olson's computer and link him to Dressler.Racing against time as missile silos are opened and strategic bombers are launched, Ryan gets a policeman to drive him to the Pentagon. Using Bill Cabot's pass card, Ryan makes it into the National Military Command Center. He convinces an Air Force General to send a message directly to Nemerov, explaining Dressler's plot and begging him to stand down. Only thirty seconds before missile launch, Nemerov backs away from Armageddon.A few weeks later, as Presidents Fowler and Nemerov are signing a new arms reduction treaty, a series of actions around the world avenge the unforgivable plot that nearly led to WW III. In Damascus, John Clark enters Olson's apartment and slits the arms dealer's throat. In a snowy Russian forest, KGB assassins run the rogue Air Force general to ground and shoot him. And in Vienna, as a panicked Dressler tries to escape his fate, a bomb destroys his car in a fiery blast."
        ],
        "summaries": [
          "CIA analyst Jack Ryan must stop the plans of a Neo-Nazi faction that threatens to induce a catastrophic conflict between the United States and Russia's President by detonating a nuclear weapon at a football game in Baltimore, Maryland.",
          "When the President of Russia suddenly dies, a man whose politics are virtually unknown succeeds him. This change in political leaders sparks paranoia among American CIA officials, so CIA Director Bill Cabot (Morgan Freeman) recruits young analyst Jack Ryan (Ben Affleck) to supply insight and advice on the situation. Then the unthinkable happens: a nuclear bomb explodes in a US city, and America is quick to blame the Russians.",
          "When the President of Russia dies, and his replaced by a man with a cryptic past, putting the United States on alert to rising Cold War fears. When the CIA suspects that renegade Russian scientists are attempting to develop more mobile nuclear weapons, East-West tensions overflow. CIA Director William Cabot (Morgan Freeman) sends his best agent, Jack Ryan (Ben Affleck) into action. What Ryan discovers is that terrorists are planning to provoke a war between the US and Russia, by detonating a nuclear bomb at a football game in Baltimore, Maryland.",
          "The United States is very critical of the Russians' treatment of Chechneya, that are ready to step in, but the new Russian President, who they believe is a hardliner, tells them that this is none of their concern. However, CIA analyst Jack Ryan, who did research on the man, doesn't think he is. But when the Russians continue to attack Chechneya, and the Russian President claims responsibility when in reality he is not, the Americans are ready to go against him. But what they don't know is that there is a third party who is trying to push them into war, which may happen when they detonate a nuclear bomb in the US and people in the Russian Military are in league with this third party and helping him push the two countries to war. But Ryan knows something's going on and is trying to find out what it is before it's too late."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "qS_NAIUBmFo8GYv0bnQr",
        "_score": 40.437904,
        "title": "Zorro: The Gay Blade",
        "year": 1981,
        "genders": [
          "Action",
          "Adventure",
          "Comedy"
        ],
        "score": 6.2,
        "directors": [
          "Peter Medak"
        ],
        "writers": [
          "Hal Dresner",
          "Greg Alt",
          "Don Moriarty"
        ],
        "synopsis": [
          "Set in an indeterminate year of the 1840s, the film opens in a villa in Madrid, Spain, where Don Diego Vega (George Hamilton), the archetypal Spanish Don Juan, is in bed with a beautiful woman who, we learn shortly, is not his wife, but someone else's. The couple are caught by her husband, Garcia, who \"is not in Barcelona\", as they had previously thought. Diego, with considerable panache, fights Garcia and his five brothers with swords. During the fight, Diego's mute servant Paco (Donovan Scott) reads a letter (via gestures) from Diego's father requesting that Diego return to California (then a part of Mexico). Diego and Paco escape by jumping from a high wall directly into a waiting carriage.A few weeks later, Diego and Paco arrive in the village of Los Angeles, where they are met by Diego's childhood friend Esteban (Ron Leibman), who has become capitán of the local guard. We also learn that Esteban has married Florinda (Brenda Vaccaro), for whom the men competed when they were boys.Esteban delivers the sad news that Diego's father was killed a few weeks earlier in a horse riding accident, when his horse was frightened by a turtle. Esteban is acting alcalde in the senior de la Vega's stead until a new one can be chosen by the dons (landowners) of the area.At the meeting of the dons, each introduces himself and where he resides. Each Don's surname is that of a well-known city in California, but none of the surnames and place-names match, with amusing results:\nDon Diego from San Fernando\nDon Francisco from San Jose\nDon Fernando from San Diego\nDon Jose from San Bernardino\nDon Luis Obispo from Bakersfield, who wears an ascotEsteban is elected alcalde, via an obviously fixed election, and gives his inaugural speech to the assembled peasants in the village plaza. He is interrupted mid-speech by Charlotte Taylor-Wilson (Lauren Hutton), a wealthy political activist from Boston. She and Diego meet, and despite their political differences, there is an immediate attraction. Diego is clearly smitten with Charlotte, but she rebuffs his advance for she finds him to be arrogant.Relaxing at the de la Vega villa, Diego receives an invitation to a masked ball to celebrate Esteban's election. He is also given his inheritance, which turns out to be Zorro's black cape, hat and sword. A note from his father tells Diego the truth: his father was Zorro, the legendary hero of the people. Diego decides that it is the perfect costume for the ball.On the way to the ball, Diego witnesses a peasant being robbed by a criminal. Giving chase, Diego confronts and defeats the highwayman, and returns the money to the peasant, instructing him to spread the news that 'El Zorro' has returned.At the ball, Diego (under cover of anonymity) dances with Florinda while the old peasant informs the people outside that Zorro has indeed returned. At the same time, we learn that the robber was in fact Velasquez (James Booth), the area's tax collector, who reports the theft to Alcalde Esteban and points out Diego. A duel ensues, and Diego escapes by again jumping from a high wall, but injures his right foot in the process. Unable to walk without a noticeable limp, he hobbles away. Esteban and Velasquez plan to use the injury to track Zorro down.Later that night, a drunk Florinda attempts to seduce Diego in his bedroom, but Esteban arrives to speak about the events of the evening. Esteban begins to suspect that Diego is Zorro, but Diego is able to convince him that his foot is not injured. Esteban leaves, satisfied.Out of commission due to his injury, Diego can do nothing to help the people as Esteban becomes more and more ruthless in his pursuit of gold. But luck stays with Diego when a few days later, his long-lost twin brother, Ramon (George Hamilton in a dual role) arrives at the family estate for a visit and to also to pay respect to their late father. Ramon, who now calls himself Bunny Wigglesworth, has just returned from the British Royal Navy where he is currently on shore leave for a few weeks. Apparently over 20 years ago, Diego and Ramon's father sent Ramon away to England to a boarding school and from there to the Royal Navy to make more of a \"man\" out of him (after seeing how \"fruity\" that Ramon was). Bunny, speaking with a distinctive English accdent and flamboyantly homosexual, reluctantly accepts the role of Zorro, but he insists on making changes to the costume; he adds fringe and tassels to the hat, makes multi-colored variations to the fabrics and exchanges the sword for a whip.As Diego recovers, his gay brother becomes champion of the peasants and tries to manage Charlotte Taylor Wilson who loves Zorro, but sees Diego as an adversary because of his position as a landowner. The Alcalde and landowners are infuriated and bewildered by Zorro's interference in their business and by his new clothes and different behavior.Meanwhile, the Alcalde's nagging and neglected wife, Florinda, convinces her husband to throw another masquerade ball to show off her extravagant new necklace. Finally healed, Diego decides to go. To throw Esteban off his trail, Diego sends fake notes to all the landowners, telling them that the Alcalde wishes everyone to dress like Zorro. Dressed in the traditional black costume, Diego attends the masquerade ball with Bunny dressed in drag as Diego's female cousin \"Margarita Wigglesworth from Santa Barbara\". Together, with all of the attention the ballroom guards of looking at all the masked men dressed as Zorro, the brothers steal the necklace from Florinda. When Diego 'accidentally' spills some red wine on Florinda's dress, Bunny takes her to her bedroom where he swipes the necklace as she takes it off. It is Bunny who leaves behind the traditional 'Z' written on red lipstick on Florinda's mirror. Afterwards, Bunny then leaves Los Angeles to return to the Royal Navy.Still dressed as Zorro, Diego rushes off to Charlotte Taylor Wilson to give her the necklace and to reveal his true identity, but she beats him to it. She tells him that she loves him, and that she had already figured out that he was Zorro. Their conversation, however, is overheard by a spy who tells the Alcalde that Charlotte can be used as bait to trap Zorro.Esteban arrests Charlotte and sentences her to a public execution. Disguised as a monk, Zorro sneaks into the palace and offers his own life in exchange for hers. Just as Diego is about to executed by the firing squad, his brother swings into the courtyard, dressed in a gold-yellow Zorro costume. Bunny frees Diego and Charlotte, and they rally the peasant crowd to fight the soldiers who eventually turn against the Alcalde as well. In the end, even Florinda abandons Esteban who is overthrown.In the final scene, Bunny waves goodbye to Diego and Charlotte and rides off into the sunset to return to the Royal Navy. Diego and Charlotte then ride off together to discuss their impending wedding and plans for the future."
        ],
        "summaries": [
          "Zorro, the legendary swordsman, has passed on his weapon and his sense of duty to his noble son, Diego, a dashing swashbuckler like his father. But after an injury sidelines Diego, he is forced to hand the mask over to his twin, Ramon.",
          "Mexico, 1840s. When the new Spanish Governor begins to grind the peasants under his heel, wealthy landowner Don Diego Vega follows in his late father's footsteps and becomes Zorro, the masked man in black with a sword who rights wrongs and becomes a folk hero to the people of Mexico. When Vega sprains his ankle and cannot continue his campaign against the corrupt Captain Esteban, his long-lost twin brother Ramon arrives to visit. Bunny was sent off by their father to the British Royal Navy to make a \"man\" of him, for he is flamboyantly gay, and now known as Lt. Bunny Wigglesworth. 'Bunny' agrees to temporarily take his brother's place as Zorro, but opts make changes in the established Zorro persona. Bunny becomes \"the Gay Blade,\" and his new costumes are lemon, plum, and scarlet colored. He insists on using a whip. Bunny also becomes the liaison between Don Vega and the liberal American activist/feminist Charlotte, a long-time critic of Captain Esteban's policies, and who has a crush on her masked hero.",
          "In 1840's Mexico, wealthy landowner Don Diego Vega learns of his late father's secret as Zorro, the masked folk hero, and Vega adopts his new persona. But when Vega is incapacitated by an injury, he asks Ramon, his very gay, long-lost twin brother (now calling himself 'Bunny'), to replace him as the caped hero, who makes some drastic changes to his Zorro persona."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ti_NAIUBmFo8GYv0bnst",
        "_score": 38.75824,
        "title": "Escape from L.A.",
        "year": 1996,
        "genders": [
          "Action",
          "Adventure",
          "Sci-Fi"
        ],
        "score": 5.7,
        "directors": [
          "John Carpenter"
        ],
        "writers": [
          "John Carpenter",
          "Nick Castle",
          "Debra Hill"
        ],
        "synopsis": [
          "On August 23, 2000, an earthquake reaching 9.6 magnitude hits the city of Los Angeles, causing it to be separated from the continental mainland by flooding the San Fernando Valley (now called the \"San Fernando Sea\") and turning it into an island from Malibu to Anaheim. Just prior to this, an American presidential candidate (an obscure reference to Jerry Falwell; played by Cliff Robertson), who is also an out-spoken, Christian theocracist, had made a doomsday prediction of the disaster during his campaign, saying L.A. was a \"city of sin\", and that; \"Like the mighty hand of God, waters will rise up and separate this sinful, sinful city, from our country.\"In the chaos that followed, the candidate is elected as the new President and a new constitutional amendment appoints him for life in office. This President declares that all people not conforming to the new \"Moral America\" laws he sets for the country (banning such things as smoking, alcoholic beverages, red meat, owning firearms, profanity, non-Christian religions (including atheism), and non-marital sex) will lose their citizenship and be deported to Los Angeles Island. Like New York City in Escape from New York, Los Angeles is turned into a penal colony of sorts. A containment wall is built around the shores of the mainland, armed guards and watchtowers are posted everywhere and those sent to the island are exiled permanently.In 2013, Cuervo Jones (Georges Corraface), a Che Guevara-like Shining Path Peruvian Revolutionary, seduces the President's daughter, Utopia (A.J. Langer), via a holographic internet system and brainwashes her into stealing her father's remote control to the \"Sword of Damocles\" super weapon a series of high-tech satellites capable of destroying electronics anywhere on the planet using a focused electromagnetic pulse. The President had threatened to use the system to render enemies of America \"unable to function\", and eventually dominate the world. Utopia gets away in an escape pod from Air Force Three and lands on L.A. Island to be with Cuervo.With the satellites under his control, Cuervo promises to take back America with the assistance of an allied invasion force of Latin American nations that are standing by for his signal to attack. Cuervo threatens that if the President tries to stop him, he'll \"pull the plug\" on the country and demonstrates his power by blacking out the capital (which has been moved to the President's hometown of Lynchburg, Virginia, also the real-life hometown of Jerry Falwell). Cuervo also knows the secret \"world code\", (which is 666), that can activate all the satellites and knock out power for the entire planet.Meanwhile, Snake Plissken (Kurt Russell), is captured for another series of crimes. The Duty Sergeant (Peter Jason) welcomes Snake to the deportation area, but he instead escorts Snake and leaves him in a vacant room. A minute later, the President, the police base camp commander Malloy (Stacey Keech Jr.) and his aide Brazen (Michelle Forbes) arrive and offer him a deal: Snake will go to the island as an exile to retrieve the remote device. The President says he will give Snake a full pardon for all the crimes he has ever committed if he is successful. The President indicates he doesn't care if Utopia is returned or not, saying she is a traitor and \"dead to me\". Initially, Snake refuses to get involved, but to ensure his compliance, Malloy tells Snake that he was secretly infected minutes earlier with the man-made Plutoxin 7 virus which will kill him in 10 hours. If he completes the mission, Snake will be given the antidote.Snake is given a sub-machine gun, a personal holographic projector, a thermal-camouflage overcoat, and a countdown clock for how long he has to live. The virus works fast, and Snake is given a device to records the minutes counting down from 10 hours to find the device and get out before he dies. Like New York, Los Angeles is now in ruins, and a hot-bed of crime. Snake sneaks into the city with a nuclear-powered mini submarine which he soon loses when the unsturdy platform it landed on crumbles, causing the sub to sink into the ocean.Making his way across the island, Snake meets an array of characters. One of them is 'Map to the Stars' Eddie (Steve Buscemi), a swindler who makes a living selling interactive tours of L.A.. Next, Snake runs into, a knife-wielding skinhead (Robert Carradine) who uses corpses for target practice. Snake also passes by Pipeline (Peter Fonda), a hippie surfer who surfs the frequent tidal waves that frequent the coastline.Snake then meets a young woman (Valeria Golino) whom directs him to the location of Cuervo Jones camp, but they both get captured by a group of mutant people and held in the former Beverly Hills hospital where they are threatened by the insane and deformed \"Surgeon General of Beverly Hills\" (Bruce Campbell). Snake uses a knockout dart hidden in his clothing to subdue the Surgeon General and forces his people to release him and the young woman. Snake and the woman escape to a nearby junkyard where after, she reveals her romantic feelings for Snake, she is killed in the cross fire of a gangland shooting.Snake has a run-in with 'Map to the Stars' Eddie again who tries to lead him to Cuervo's camp, only to betray him and Snake is captured. An increasingly sick Snake is brought to the former L.A. arena where he is forced to play basketball by trying to get five two-point basket shots within 10 seconds of each other. Snake manages to defeat the basket shots and earns praise and recogniton from the crowd (similar to in New York when he defeated a rival in a boxing ring). Snake escapes from the arena during another aftershock earthquake and gets away with a little help from Pipeline who shows him how to surf the tsunami waves that wash over the area.Snake hides out on board the former Queen Mary cruise ship located in former Long Beach where he meets local gang leader Hershe Las Palmas (Pam Grier) whom was formerly Bill 'Carjack' Malone, a transsexual and former accomplice of Snake from Cleveland, Ohio, who after hearing about his mission to find the black box remote control device, tells him the Plutoxin virus is a propagandized lie and won't kill him. She agrees to help Snake attack Cuervo Jones main camp to get the remote control device and escape from the island. Snake and Hershe's men commandeer hand gliders and fly to Cuervo's staging area.Snake and Hershe's men land at the former amusement park, Happy Kingdom by the Sea, and in a climatic gun battle, defeats Cuervo by gunning down most of his men and claiming the remote control device. Eddie appears again and offers his help to Snake, despite being a double agent playing both sides. Snake commandeers a police helicopter that lands and grabs Utopia with him as they, along with Eddie, Hersche and her few surviving men, board the helicopter to fly away. But then Cuervo fires a rocket at the helicopter, damaging it and killing Hershe and her men. Eddie manages to shoot and kill Cuervo, but he falls out of the helicopter. Eddie lands on the ground unharmed, but is now facing several of Cuervo's armed and angry men.Snake manages to fly the damaged chopper to the mainland where he and Utopia abandon the helicopter before it crashes. Just then, Commander Malloy, Brazen, and the President appear with a platoon of soldiers. Snake then hands off the wrong remote to the President (similar to what Snake did to Hauk in 'New York') while Utopia is taken to the electric chair for execution, despite her pleas for forgiveness. Snake is relieved, but only more angry then ever when the timer for his life runs out and he learns that the Plutoxin 7 virus was indeed to be nothing more than a fast, hard hitting case of the flu virus, not in the least bit lethal to Snake.Thinking he has control of the satellites, the President tries to use it to stop a Cuban invasion force threatening Florida. Activating the remote, the President hears only Eddie's \"Map to the Stars\" intro over 'I Love L.A.' instead.In anger, the President orders Snake to be executed, but Snake had activated his hologram projector and the Snake that gets shot is an illusion. Snake activates the device, entering the world code (666), against pleas to stop. All over the world, the satellites activate their EMP weapons at the world, thus shutting down every electrical device, and turning the world back into the Dark Ages. At the deportation center, Utopia praises Snake for \"turning off the world\", and saving her. The illusory Snake disappears, since he has \"turned off the Earth\".In the final shot, Snake is a few hundred yards away from the President and his soldiers, who are now looking for him, where he finds a pack of cigarettes on the ground and lights one up. The cigarette box is labeled \"American Spirit.\" As Snake walks off into the woods as dawn is starting to break, he then says to himself: \"Welcome to the human race.\""
        ],
        "summaries": [
          "Snake Plissken is once again called in by the United States government to recover a potential doomsday device from Los Angeles, now an autonomous island where undesirables are deported.",
          "The year is 2013 and Snake Plissken is back but this time it's L.A., which through the agency of earthquakes has become an island of the damned. But something has gone wrong in this new moral order, because the President's daughter has absconded to L.A. with a detonation device, and Snake is commandeered to retrieve it. But just below the surface there is a coiled Snake ready to strike.",
          "In the year 2013, the city of Los Angeles has been separated from the country by a series of earthquakes, and like its neighbor New York, has transformed from a wonderful city to a corrupted prison. Plus, The United States has become a more moral society. Cuervo, a Cuban terrorist has used the president's daughter, Utopia to steal a device that controls a special orbiting EMP weapon system. The President has called upon the untrustworthy mercenary Snake Plissken. To ensure his cooperation, they have implanted a virus bomb inside his body, and it will inject the virus into his body in 9 hours, so Snake must stop Cuervo, rescue Utopia and get back the Weapon's device.",
          "The year is 2013 and Snake Plissken is back from Escape From New York. An earthquake has separated Los Angeles from the mainland. In the New Moral America, all citizens not conforming to the new laws (no smoking, no red meat, no Muslims in South Dakota) are deported to L.A., now a penal colony. The President's daughter has stolen a doomsday device and has fled to L.A. It's up to Snake Plissken to find the President's daughter and retrieve the doomsday device before its too late.",
          "The year is 2013. Like New York, Los Angeles has been turned into a prison island for the United State's most undesirable criminals, like New York, Los Angeles is surrounded by a wall so no convict can escape from L.A and once deported to L.A. you can never return to the American mainland which has become a moral society. 16-years after he escaped from New York, One-Eyed former soldier Snake Plissken now the United State's most wanted outlaw is once again given another job for his freedom by the new President and L.A's security commander Malloy. Snake is sent into L.A. to recover a doomsday device that shuts all power sources on Earth from brutal terrorist Curevo Jones and the President's runaway daughter Utopia who has been brainwashed by Curveo into stealing the doomsday device, and the President personally wants Snake to eliminate Utopia for betraying her country. Like New York, Snake is injected with a engineered virus which will kill him in 9 hours if Snake fails the mission, if Snake succeeds in completing the mission, he will be given the antidote. Entering L.A, now inhabited by criminals, runaway teenagers, prostitutes and brutal gangs. Snake sets out to recover the doomsday device and kill Utopia, as Curevo and his army of terrorists prepares to invade the United States and can Snake escape from L.A. before the virus kills him in 9 hours?",
          "Sequel to \"Escape From New York\". In 2000, a huge earthquake hits Los Angeles which causes the whole city to be now situated on an island. In that year the new life-term US President, an out-spoken moralist declares that all people not conforming to the high morals he sets for the country will be deported to the Los Angeles island. Like New York, a wall is built, guards posted to stop any escapes and if sent there - you can't return to the US. In 2013, Cuervo Jones, a terrorist invades the dreams of the President's daughter, Utopia, and brainwashes her into stealing a device from a weapons establishment and runs with Cuervo to the island. Snake Plissken, hero of Escape From New York, is forced again to go to the island to get the device by the President (who doesn't care if Utopia returns or not.) and he is poisoned to ensure his co-operation. Like New York, Los Angeles is now a decaying city, a hot-bed of scum and weirdos and Snake has 9 hours to find the device and Utopia, and get out before the poison kicks in."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "py_NAIUBmFo8GYv0bnAo",
        "_score": 38.557114,
        "title": "Bananas",
        "year": 1971,
        "genders": [
          "Comedy"
        ],
        "score": 6.9,
        "directors": [
          "Woody Allen"
        ],
        "writers": [
          "Woody Allen",
          "Mickey Rose"
        ],
        "synopsis": [
          "On the Wide World of Sports television broadcast, American sportscasters Don Dunphy and Howard Cosell (playing himself), report that the president of the island Republic of San Marcos has been assassinated and replaced by a dictator, General Emilio M. Vargas (Carlos Montalbán).Meanwhile in New York City, clumsy looser Fielding Mellish ((Woody Allen)) works as a product researcher at General Equipment, where he tests electrically warmed toilet seats, coffins with piped-in music and the new \"Execusizer,\" a gym built into the desks of busy corporate heads. Unhappy with his job, Fielding blames his lack of success on the fact that he never finished college.Fielding has also been unsuccessful in his attempts to date women, until Nancy (Louise Lasser), a politically active college student, knocks on his door, asking him to sign a petition urging the United States to support the revolutionaries in San Marcos, who are rebelling against the new corrupt dictator. Although Nancy is busy with yoga classes and her women's group, Fielding talks her into going out with him. Smitten, he accompanies her to political rallies and riots, and eventually makes love to her.Fielding's newfound happiness is shattered when Nancy, feeling that \"something is missing,\" breaks up with him. She explains that she needs someone who is a leader, more politically aware, and less emotionally, sexually and intellectually immature. The breakup depresses Fielding so much that he quits his job and decides to go to San Marcos, where he and Nancy had planned to vacation. Before leaving, he visits his parents, a surgeon and nurse who are in the middle of operating on a patient, to explain that he will be gone for a while. Disappointed that Fielding has not followed him into the family business, Dr. Mellish tries to give him confidence by insisting that he take over the operation, but his mother gives him her blessing.In impoverished San Marcos, where each peasant has been ordered to pay the dictator his weight in manure, a captured rebel is tortured by being forced to listen to a recording of Naughty Marietta , which prompts him to confess that the rebels are planning a revolution on July 4th. After Fielding checks into a hotel, he receives an invitation to dine with Vargas at the palace.During the meal, Vargas explains to Fielding that he wants to keep his people safe from Communism by exterminating \"a few troublemakers.\" Vargas ignores Fielding's point that the rebels are not Communists and sticks Fielding with the bill. After Fielding leaves, Vargas and his men decide that Fielding is \"perfect\" for their plans. Later, Vargas' men, who are disguised as rebels, try to kill Fielding, intending to blame the death of an American citizen on the revolutionaries in order to win United States support for their regime. Fielding escapes, but is then captured by the real rebels, who take him to their leader, Esposito.At the rebels' camp, Fielding is told that Vargas has already reported his death to the newspapers and will kill him to prevent the truth from getting out. The rebels want him to stay and risk his life for their cause, but Fielding believes that being dead is \"a tremendous drawback\" to one's sex life and prefers to remain cowardly. However, he trains with the rebels and learns about guns, grenades, camouflage and first aid. When the camp is low on food, Fielding is sent to raid the town and, with a few other men, enters a café and orders a couple thousand sandwiches, wheelbarrows of cole slaw and some drinks, then has it delivered.Esposito later sends Fielding and two rebels to kidnap the British ambassador to hold as a hostage until imprisoned sympathizers are freed. While sedating the ambassador with sodium pentothal, Fielding accidentally renders his comrades unconscious. When the ambassador escapes, his revived co-workers flee and Fielding grabs a cross and joins a Catholic procession in order to evade some suspicious soldiers.Meanwhile, mistaking the United Jewish Appeal for the CIA, Vargas makes a pact with them for support, and when the rebels attack, he discovers that the Jewish fundraisers offer little protection. Although the CIA does send men, half the agents are sent to fight for the dictator and the other half to fight against him. His regime defeated, Vargas flees to the safety of Miami.After the rebels' victory, Esposito announces that he is the ruler of San Marcos, and orders that the country's official language will be Swedish and that citizens must now change their underwear every half hour, wearing it outside their clothing so that it can easily be checked. These proclamations and others cause the rebels to realize that power has driven Esposito mad. At the request of his comrades, Fielding takes over as president, but it is soon apparent that San Marcos needs the support of other countries in order to prevent future corrupt dictators from seizing control. The problem, Fielding and his close associates realize, is that Americans think of them as Communists, and Communists believe them to be American puppets. In addition, they have nothing to barter for aid, except bananas. Fielding's advisers urge him to go to the United States and raise money, but he knows that, back home, his reputation as an uneducated product tester has no clout.Disguised in a red beard and mustache, Fielding flies to the United States, where he is officially welcomed as San Marcos' leader. There Fielding's interpreter translates by repeating every English sentence in heavily accented English, until men in white coats with a butterfly net arrive to take him away. During a dinner fundraiser at which he is the speaker, Fielding tries to tell a joke about a farmer who has an incestuous relationship with both his daughters, but decides he is telling it to the wrong crowd. Nancy, who does not recognize him, approaches to express her admiration for the leader and, after they go to bed together, Fielding reveals his true identity, after which Nancy remarks that she now knows why something in their sexual encounter seemed to be missing.Meanwhile, the FBI sees through Fielding's disguise and, based on his record of involvement in riots and protests, assumes that he is trying to subvert the government. On the six o'clock news, newscaster Roger Grimsby reports that Fielding has been charged with being a subversive impostor. At his trial for charges of fraud, inciting a riot, conspiracy to overthrow the government and using the word \"thighs\" in mixed company, Fielding acts as his own lawyer. Both J. Edgar Hoover, who comes to court (disguised as a black woman), and Miss America provide testimony against Fielding. Although an acquaintance describes Fielding as a \"warm, wonderful human being,\" the court reporter types that he is a \"conniving little rat.\" While the jury passes around a joint, Fielding, acting as both lawyer and defendant, attempts to cross-examine himself, causing the judge to order him bound and gagged. Fielding is found guilty on twelve counts and sentenced to 15 years, but the time is suspended if he promises not to move into the judge's neighborhood.A free man, Fielding proposes to Nancy, and their wedding night at the Royal Manhattan Hotel is covered by Dunphy and Cosell for Wide World of Sports . From their spectator-filled hotel suite, Cosell provides a play-by-play description of the action. In an interview with Cosell after the consummation of their marriage, Nancy states that Fielding was not the best she has had, but also not the worst, and Fielding predicts that their next \"bout\" will occur in late spring. Cosell wraps up the interview by saying that \"they may live happily ever after and again they may not,\" but promises to be there to cover the action."
        ],
        "summaries": [
          "When a bumbling New Yorker is dumped by his activist girlfriend, he travels to a tiny Latin American nation and becomes involved in its latest rebellion.",
          "Fielding Mellish (a consumer products tester) becomes infatuated with Nancy (a political activist). He attends demonstrations and tries in other ways to convince her that he is worthy of her love, but Nancy wants someone with greater leadership potential. Fielding runs off to San Marcos where he joins the rebels and eventually becomes President of the country. While on a trip to the states, he meets Nancy again and she falls for him now that he is a political leader.",
          "In the Republic of San Marcos, in Latin America, the president is murdered in a Coup d'État promoted by General Emilio M. Vargas. In New York, the products tester Fielding Mellish meets the political activist Nancy and they have a love affair. Fielding has an unrequited love with Nancy, who believes that he is immature and without leadership. Fielding decides to travel to San Marcos and General Vargas plots a scheme the assassination of Fielding to be supported by the USA against the rebels led by Esposito. However the rebels save Fielding and train him in guerrilla warfare. General Vargas flees to the United States. Esposito deranges with the power and Fielding becomes the President of San Marcos. He wears a long beard and travels to USA seeking financial support to the country and he meets Nancy again, who falls in love with him.",
          "Nebbish Fielding Mellish works as a product tester for a large corporation in New York. His relationship with Nancy, a social activist, is the first he's had in quite some time. So when Nancy breaks up with him - she knowing something is missing, but not being able to put her finger on what that is - Fielding believes the way to win her back is to get into activism, most specifically to move to the Latin American republic of San Marcos, where the elected president was assassinated and replaced by General Emilio M. Vargas, a military dictator. Nancy first met Fielding in trying to get signatures on a petition for the US to break all ties with the military government. Being an American, Fielding ends up being used as a pawn between Vargas and the revolutionary forces, led by Esposito, that function of pawn which may have fatal consequences for him. The question becomes if he is able to survive whether his actions in San Marcos will produce his desired end goal of getting Nancy back."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "di_NAIUBmFo8GYv0bmgb",
        "_score": 37.84799,
        "title": "Gabriel Over the White House",
        "year": 1933,
        "genders": [
          "Drama",
          "Fantasy",
          "Romance"
        ],
        "score": 6.4,
        "directors": [
          "Gregory La Cava"
        ],
        "writers": [
          "Carey Wilson",
          "Bertram Bloch",
          "T.F. Tweed"
        ],
        "synopsis": [
          "The film opens during the depths of the Great Depression, with the inauguration of newly-elected President Judson C. \"Judd\" Hammond (Walter Huston). Hammond, a genial but corrupt and apathetic party hack, cares little for the pressing concerns of the day. Dismissing unemployment and bootlegging to be \"local problems\", he demonstrates more interest in playing with his nephew Jim and sleeping with his \"private secretary\", Pendie Molloy (Karen Morley), than with doing any actual work.One day, while recklessly racing his automobile, Hammond suffers a near-fatal crash, which leaves him in a coma. Though his doctors conclude that the president's death is imminent, a mysterious presence (conjectured later in the movie to be the Archangel Gabriel) revives Hammond. Uncertain of how to respond to the turn of events, Hammond's physician keeps his condition secret for weeks. When Molloy is finally permitted to see him, she finds Hammond distant and cold to her.Summoning his Cabinet, Hammond becomes an advocate of an activist government. When the Cabinet calls for the military to be deployed against an \"Army of the Unemployed\" that is marching to Washington, D.C. to demand work, he refuses, firing the Secretary of State when he threatens to resign in response. After the leader of the marchers is killed by racketeers, Hammond travels to the marchers' camp and announces the formation of an \"Army of Construction,\" a massive public works program that will give a paying job to every unemployed man in America until the economy recovers.Alarmed at Hammond's new course, his vice president and Cabinet begin plotting against him, only to receive requests for their resignation. This triggers impeachment proceedings against him in Congress, which is also corrupt and controlled by laissez-faire politicians. While in the midst of impeachment debates, Hammond appears before Congress and requests money to stimulate the economy. Facing Congressional opposition, he demands that Congress vote him extraordinary powers and to adjourn until the crisis was over. When the members of Congress denounce his request as dictatorship, Hammond threatens to declare martial law, leaving Congress little choice but to capitulate to his demands and grant him the power to enact all necessary measures, unfettered by the normal system of checks and balances. Enjoying the support of the public for his actions, Hammond outlaws foreclosures, creates federal bank insurance to protect depositors, and offers subsidies to farmers.Next, Hammond turns his attention to the problem of organized crime. Securing Congressional repeal of the Eighteenth Amendment, he tells crime boss Nick Diamond (C. Henry Gordon) of his plan to open government liquor stores and encourages the immigrant mobster to return to his own country voluntarily. In response, Diamond orders the bombing of the first government liquor store and attempts to assassinate Hammond in a drive-by shooting of the White House that leaves Molloy injured. Hammond retaliates by creating a special military unit called the Federal Police, to go after Diamond. Led by Hammond's top aide, Hartley Beekman (Franchot Tone), the unit corners Diamond in a warehouse and blasts him and his men out using armored cars. \"Technicalities of the law\" are circumvented with a brief military tribunal, also led by Beekman, that ends in the execution by firing squad of Diamond and his associates.Finally, Hammond moves to collect the large unpaid war debts due from other nations from the Great War. He invites the world's ambassadors to a conference on board a yacht, where, before a worldwide radio audience, he demands repayment of the debts. When the representatives protest their inability to pay, Hammond announces his country's repudiation of the naval limitations agreement, threatening a renewed arms race as a result. Staging a display of air power for the conferees by ordering naval bombers to sink two obsolete battleships, he delivers an impassioned speech on the total destruction of humanity to come in \"the next war\" unless they choose the alternative of using military expenditures to balance their budgets and repay their debts instead. The world's leaders agree to a peace covenant, but upon adding his signature to the covenant Hammond collapses. As he lies dying, Molloy sees his face change and the old Judd Hammond returns, seeking her approval for all that he has accomplished before finally expiring."
        ],
        "summaries": [
          "A political hack becomes President during the height of the Depression and undergoes a metamorphosis into an incorruptible statesman after a near-fatal accident.",
          "Newly inaugurated President Judson Hammond is content to live out the next four years exercising a hands-off approach and leaving the problems of Depression America to local authorities. But after a miraculous recovery from an auto accident, Hammond is ready to take on every social ill and neither Congress, gangsters nor the nations of the world will stop him.",
          "Bachelor Judson Hammond has just been elected President of the United States. He is a political lackey who tows the party line. He is more interested in maintaining a fulfilling personal life, such as with his \"unofficial\" girlfriend Pendola Molloy who he hires to be his personal assistant, and being the national figurehead than doing anything meaningful as president. Any actual work he foists onto his appointed secretary, loyal and hard working Hartley Beekman. Jud sees the national unemployment uprising, led by John Bronson, and the increase in racketeering, the most notorious of the criminals being Nick Diamond, as local problems, and as such does nothing to address these issues. Out for a joyride one day, he gets into a car accident, the severity of his injuries which look to kill him. He miraculously survives, seemingly a changed man. Pendy, who has mutually fallen in love with Beek in the meantime, can see in Jud's demeanor and more deeply into his soul that he is now guided by a higher force. Under this force, Jud begins a new type of presidency, one that may place him at odds with his party, with congress, and other global powers as he tries to do what he feels are the right things in dealing with the unemployment and racketeering issues, as well as national debt issues faced by countries following the Great War in his goal of world peace."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "7C_NAIUBmFo8GYv0bpg4",
        "_score": 37.831078,
        "title": "Captain America: Civil War",
        "year": 2016,
        "genders": [
          "Action",
          "Adventure",
          "Sci-Fi"
        ],
        "score": 7.8,
        "directors": [
          "Anthony Russo",
          "Joe Russo"
        ],
        "writers": [
          "Christopher Markus",
          "Stephen McFeely",
          "Joe Simon"
        ],
        "synopsis": [
          "In 1991, Bucky Barnes (Sebastian Stan), brainwashed to be the Winter Soldier, causes a car to crash and recovers bags of a serum that turns people into super soldiers.After the Avengers defeated Ultron, Thor and Hulk are nowhere to be found. Hawkeye (Jeremy Renner) has gone home to spend time with his family. Even Iron Man (Robert Downey Jr.) has apparently disengaged. Captain America (Chris Evans) and Black Widow (Scarlett Johansson) are leading a new team of Avengers, consisting of Scarlet Witch (Elizabeth Olsen), Vision (Paul Bettany), War Machine (Don Cheadle) and Falcon (Anthony Mackie). But the world hasn't forgotten the numerous civilian casualties that resulted from the Avengers' previous missions.In Lagos, Nigeria, the team is tracking the movements of Brock Rumlow (Frank Grillo), a Hydra agent who had infiltrated S.H.I.E.L.D. until Captain America exposed him. Brock was on one of the three Helicarriers that Cap had caused to fire on each other over the Triskelion near Washington DC, and he managed to survive the resulting crash. Badly burned in the incident, he now he wears a skull mask and goes by the name Crossbones. In Lagos, Crossbones and his team of mercenaries ram a garbage truck into the Institute for Infectious Disease building and clear out the guards with smoke canisters. Crossbones uses hydraulic gauntlets to give him super strength, and pounds open the glass around the lab. He grabs a vial containing a deadly, highly contagious virus. Cap's team takes out some of the mercenaries, and Crossbones and the rest of the men make their escape in a truck. After a chase, the truck is taken out of action. Crossbones hands the vial to one of his men, and tells them all to scatter. He then engages Cap, repeatedly punching him with enhanced strength, while the rest of the team chases after the mercenaries. Falcon finds the one holding the vial and shoots him, with Black Widow grabbing the vial before it hits the ground. Cap gets the upper hand on Crossbones, pinning him against the wall. Crossbones tells him that Bucky Barnes remembers him. With Cap momentarily distracted, Crossbones pushes a button, triggering a bomb on his vest. Cap braces himself, but Scarlet Witch is able to contain the force of the explosion. She uses her powers to push it up into the air, but she's only able to elevate it a bit before she loses control, and the explosion rips into the seventh floor of a nearby hotel. Cap calls for fire and rescue, and then runs into the building to help evacuate. Wanda tearfully looks at the destruction, devastated at her misguided actions.In a theater inside Tony Stark's old college, a holographic video plays of him and his parents, Howard (John Slattery) and Maria. At the end, Tony tells the students that he is starting the Howard and Maria Stark Foundation, and each one of them has been approved for a research grant. In a corridor, a woman confronts him and shows him a picture of her son, who had been killed in Sokovia, crushed by a building that the Avengers had knocked down.At the Avengers' headquarters, the team is watching news footage of the Lagos mission. The reporter says that eleven people were killed in the hotel. Steve tells them that he let his guard down, and people died because of it. Vision tells Steve that Tony has arrived, and he brought the Secretary of State as a guest, General Thaddeus Ross (William Hurt). Ross had been involved in the experiment that turned Bruce Banner into the Hulk, and then had spent years trying to hunt him down. Ross tells them that some people look up to them as heroes, but others think they're vigilantes. He shows pictures of the destruction that follows the team wherever they go, emphasizing the Sokovia incident. He sets a thick document down on the table and tells them it's the Sokovia Accords, ratified by 117 countries. The accords state that the Avengers will operate under a panel's supervision, only acting when the panel decides it's necessary. He says there will be a meeting in Vienna in three days, and if they don't sign on, they'll have to retire.The team spends hours debating whether to agree to the accords, and Tony shows them all a picture of the boy who was killed in Sokovia. Steve asks what will happen if there's somewhere they need to go but the panel won't allow them. Tony replies that if they don't agree to this now, it will be forced on them later. Knowing that they've reached a stalemate, Steve leaves in disgust. He gets a message that Peggy Carter has died and attends her funeral in London. At the memorial service, SHIELD Agent 13 (Emily VanCamp) reveals during her eulogy that she's Carter's niece, Sharon. She and Steve share a moment after the service where it's hinted that they are romantically attracted to each other but they need to keep their friendship professional. The next day, Natasha finds Steve and tells him that she, Tony, James Rhodes and Vision had signed on, with Clint and Wanda holding out.In Vienna, several heads of state have gathered for the ratification of the accords. Natasha meets the prince of Wakanda, T'Challa (Chadwick Boseman), and his father, King T'Chaka (John Kani). Wakanda had become abundant in vibranium, the material that was used to make Captain America's shield, after a meteorite crashed there. Additionally, some of the Lagos victims were from Wakanda. King T'Chaka takes the podium for the keynote address, and Natasha notices security personnel surrounding a van parked outside. An explosion rips through the building, killing the king.Back in the U.S., Steve is sitting in a hotel room with Sam and Sharon Carter when a news report comes in, showing the destruction in Vienna. Security footage shows the man who planted the bomb, and Steve realizes that it's Bucky. Sharon gets a text, and tells Steve that she has to go to work, and takes a military plane to Vienna. Natasha looks around and sees hundreds of injured people. Prince T'Challa picks up a printed photo showing Bucky leaving the van that had the bomb. Natasha calls Steve, and he tells her that he has to be the one to bring in Bucky. He hangs up and looks at the damaged building, having already arrived in Vienna. Sharon sees him, and she hands him a file so he can get a head start on the manhunt, ahead of a German military task force, GSG9, who have orders to shoot to kill.In Bucharest, Bucky picks up a newspaper and sees that he is being accused of the bombing in Vienna. He realizes that he'll have to leave quickly. Steve goes to Bucky's apartment and finds him there. The GSG9 storm in, and Bucky blocks their bullets with Cap's shield and the two fight them off. He jumps down to the street, where he is confronted by the Black Panther, who scrapes his armor with metal claws on his hands. Cap jumps down and lands next to them, and all three take fire from the GSG9. Cap and Bucky run for cover, but the Black Panther stands still, letting the bullets hit him and bounce off harmlessly. Bucky runs through the streets with Black Panther chasing him, and Cap and Falcon following the Panther. Cap commandeers a GSG9 SUV, while the Panther leaps from the top of one car to the next, steadily gaining on Bucky. Bucky knocks a man off a motorcycle, then jumps on himself and guns the engine, driving into a tunnel. Black Panther is still tirelessly giving chase. Cap drives the SUV near Bucky's motorcycle, and the Panther jumps onto the SUV's roof, and then onto the back of the motorcycle. Bucky swings backward, knocking the Panther off, but he sticks his claws into the side of the SUV and clings to its side. Bucky looks ahead and sees Falcon flying straight toward him. He hits the brakes, and turns the motorcycle around and drives back past the SUV. Cap throws it into reverse, trying to keep up with Bucky. The Panther jumps into the air, and lands on Falcon's wings. Bucky takes a metal ball and throws it up to the roof of the tunnel. It explodes, blowing a hole in the concrete. Falcon uses his wings to shield himself, throwing off the Panther, who went straight through the explosion, unharmed. Bucky swerves to avoid a car, and falls off the bike. The Panther jumps on him, swinging his claws at him. Cap tackles the Panther, and they trade blows, with the Panther's claws leaving gashes in Cap's shield. War Machine flies in through the hole, and the GSG9 surrounds them all and tells them to put their hands up. They are all arrested, and Black Panther removes his mask, revealing himself as Prince T'Challa of Wakanda.On the ride to the task force headquarters in Berlin, Cap tells the prince that he has the wrong man. Cap, Falcon and the prince get out, and in another truck, Bucky is taken out in a cage. They are met by Everett Ross (Martin Freeman), the leader of the headquarters. The men have their weapons removed, and they are led inside the building, where Black Widow is waiting for them. Everett takes Prince T'Challa into one room, and the others are led to another room, where Tony tells them that Secretary Ross wants to have them all prosecuted. Tony says that as a compromise, they won't get back the shield and wings, which are now government property.T'Challa uses his influence to have Bucky extradited to Wakanda, where he will face charges of terrorism. Bucky is given an evaluation to determine his mental state. Still in the room with Tony, Cap watches it unfold. Tony tells him that if he signs the accords now, Bucky will be transferred to an American psych facility instead of a Wakandan jail. Steve agrees, but only if safeguards are put into place. Tony brightens, telling Steve that he and Wanda will be reinstated. Steve asks what he means about Wanda, and he tells Steve that she is being confined to the Avengers' upstate New York facility, under the guard of Vision. Tony says it's the best he can do, since she's not a U.S. citizen and they won't give her a visa. Steve says that she's only a kid, and doesn't deserve to be imprisoned. He leaves without signing onto the accords.Hawkeye breaks into the facility where Vision is holding Scarlet Witch. He attacks Vision, but is unable to hurt or subdue him. Scarlet Witch uses her powers to force Vision through the floor and down several levels, and she and Hawkeye escape.Colonel Zemo (Daniel Brühl), having already killed a Hydra agent and recovered a book containing a list of words that will trigger Bucky's reversion to his brainwashed state, infiltrates the compound as the psychiatrist who will evaluate Bucky and reads off the list. Bucky, recognizing the trigger list, is helpless to stop Zemo and pounds his way out of his cell, battling Stark, Cap, Natasha and T'Challa. He tries to escape in a helicopter on the roof but is stopped by Rogers, who forces the chopper to fall into the river. He rescues his friend and takes him to a safe house where he and Sam Wilson clamp Bucky's bionic arm in an industrial press. Regaining his senses, Bucky tells Steve that Zemo is going to Siberia, where there are several more super soldiers waiting for someone to wake them up and give them a mission.Cap assembles a team consisting of Bucky, Falcon, Hawkeye, Scarlet Witch and Ant-Man (Paul Rudd) to stop Zemo. By operating outside of authority, they all become renegades. Iron Man forms his own team, made up of War Machine, Black Panther, Black Widow, Vision and Spider-Man (Tom Holland) to arrest the others. Two teams meet at the airport in Leipzig, Germany. Cap's plan involves stealing the Quinjet some members of the other team arrived in. Stark tries to appeal to Rogers but fails and a pitched battle breaks out. Stark insists that Peter Parker remain at a distance and use his webbing to subdue anyone he can. Black Panther intends to capture Bucky. Ant-Man enlarges himself to 80 feet in height, distracting Stark's team and buying time for Cap and Bucky to escape to the hangar with the Quinjet. Black Widow appears intent on stopping them, but she turns on Black Panther, allowing Cap and Bucky to fly off in the Quinjet. War Machine tries to stop them from escaping, but Falcon flies after him. Tony orders Vision to stop Falcon, Vision shoots an energy beam from the Mind Stone which Falcon dodges and hits War Machine's arc reactor instead, disabling his armor's functions, causing him to fall from the sky and impact the ground before either Falcon or Stark can reach him. Stark finds that Rhodes is barely alive. When Falcon tries to express his sympathy, Tony knocks him out with a repulsor blast.After seeing evidence that Bucky was framed for the Vienna explosion, Iron Man travels to The Raft, a remote Arctic prison facility where the other members of Cap's team are incarcerated under the supervision of Secretary Ross. Tony is able to temporarily block the audio surveillance system of the facility long enough to show Sam that Rogers was right and that Zemo had killed the psychiatrist who was supposed to evaluate Bucky. He is able to find out from Sam Wilson where Rogers and Bucky went. Tony boards his private chopper and slips out in his Iron Man armor, travelling to Siberia to meet up with Cap and Bucky and make peace.Once Tony finds Bucky and Capt, they find that the super soldiers have already been killed, and Zemo, hidden behind indestructible glass, reveals that his real plan was to find footage of the Winter Soldier's first mission. Black Panther had been following, unseen, and he hears Zemo admit responsibility for the explosion. Zemo shows them a videotape of Bucky causing the car crash, and then murdering the occupants, Howard and Maria Stark, in cold blood.Incensed, Iron Man attacks both Cap and Bucky, and he demands to know if Steve knew what had happened. Steve tells him that he only knew that Hydra was behind his parents' murder. They fight, and Iron Man blasts off Bucky's metal arm. Cap eventually disables Tony's arc reactor, rendering his suit useless. Tony tells him that he doesn't deserve to carry his shield that his father gave to Steve. Steve drops it and leaves with Bucky. Panther finds Zemo sitting outside, looking at a photograph and holding a pistol. He tells Black Panther that his family was killed in Sokovia, and he wouldn't stop until he destroyed the Avengers from within. With his success, Zemo tries to commit suicide with the pistol, but Black Panther places his hand over the barrel, stopping the bullet, and apprehends Zemo for judgment.Tony is helping Rhodes with his recovery, giving him robotic leg braces to recover from paralysis. He receives a package from Rogers -- the FedEx delivery guy (a cameo by Stan Lee) mispronouncing his name as \"Tony Stank\", much to the amusement of the recovering Rhodey -- that contains an flip-model cell phone and a note saying Tony can call Steve if he and the world face any new threats. At the Raft, Steve breaks the heroes out and they go to Wakanda, where T'Challa gives them asylum. Bucky elects to be put back into cryogenic sleep until they can find a way to cure his brainwashing, so that no one will be able to manipulate him again. Peter Parker is recovering from his injuries at home -- telling May that he got into a fight at school with a guy named \"Steve\" -- and he tries out a new version of the web shooter that Tony gave him. To his fascination, it projects the Spidey signal onto the ceiling."
        ],
        "summaries": [
          "Political involvement in the Avengers' affairs causes a rift between Captain America and Iron Man.",
          "With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges.",
          "SPOILER: When politicians and world leaders think that people like Captain America and Iron Man are running amok, they tell them they need to be regulated. Tony Stark, Iron Man thinks it's necessary. While Steve Rogers, Captain America doesn't think so. That eventually splits their team, The Avengers. At a UN gathering where the regulations are being worked out, there's an explosion and some people are killed among them is the King of Wakanda. Investigation reveals that the bomb was planted by the Winter Soldier, who is Bucky Barnes, Captain America's friend during the war. Everyone is out to get Barnes and kill him if necessary but Steve wants to get to him first and help him. When he finds him he says he didn't plant the bomb, suddenly another person shows up who's out to get him dressed in black. When security forces catches up to them they are arrested and the one in black is revealed to be the son of the Wakandan King, T'Challa and he is the Black Panther the guardian of Wakanda. While in custody, a psychiatrist is sent to evaluate Bucky but suddenly the power goes out that's when he begins to say some words that have an effect on Bucky. He breaks out and Steve tries to get him. Believing that Bucky is innocent Steve sets out to find the man who got to him. Tony is told that because Steve helped Bucky he is now also wanted. He offers to bring him in so he asks War Machine ,and Black Widow to join him. He recruits someone to help him while Widow offers T'Challa to join them. Steve brings Falcon with him who gets Ant Man and Steve calls Hawkeye who gets Wanda whom tony has under lock and key under the eye of Vision. They get away and Vison joins tony. Eventually they all have a confrontation.",
          "After another international incident involving the Avengers, world leaders and political powers move to get the Avengers to be registered in lieu of previous missions that have caused collateral damage. This results in the Avengers having to decide whether to remain free or to be registered. It also results in two factions with one led by Captain America, who believes that heroes should remain free and the other led by Iron Man, who surprisingly begins supporting government regulation and oversight. And all the while, Cap must try and protect his old friend Bucky from both Tony and the schemes of a new villain who emerges with a plan that could shock the world.",
          "A possible cure for superheroes deeply divides courageous Captain America and arrogant Tony Stark. Factions of superheroes divide themselves in to Team Captain America and Team Stark. Black Widow and Hawekye must choose sides. Plus, Bucky Barnes is possibly behind the murder of King T'Chaka, a member of one of the factions, and T'Challa his son plans to kill him.",
          "In this superhero epic, the denizens of the Marvel Universe are forced to pick sides when Captain America (Chris Evans) and Iron Man (Robert Downey Jr.) come to blows over ideological differences. After a mission involving a new Avengers squad led by Cap ends with several civilian casualties in Lagos, the team are asked to sign an agreement that would force them to take orders from a United Nations panel. Tony Stark (aka Iron Man) pressures Cap to accept this new arrangement, in part because he feels deeply guilty about his own past recklessness; Captain America, however, fears that the Avengers will only be corrupted by bureaucracy. Their disagreement eventually escalates into all-out war when Cap's old friend Bucky Barnes (Sebastian Stan), now a brainwashed assassin known as the Winter Soldier, reenters the picture.",
          "After another incident involving the Avengers results in collateral damage, political pressure mounts to install a system of accountability, headed by a governing body to oversee and direct the team. The new status quo fractures the Avengers, resulting in two camps, one led by Steve Rogers and his desire for the Avengers to remain free to defend humanity without government interference, and the other following Tony Stark's surprising decision to support government oversight and accountability."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "7S_NAIUBmFo8GYv0bnEq",
        "_score": 35.48257,
        "title": "The Godfather Part II",
        "year": 1974,
        "genders": [
          "Crime",
          "Drama"
        ],
        "score": 9,
        "directors": [
          "Francis Ford Coppola"
        ],
        "writers": [
          "Francis Ford Coppola",
          "Mario Puzo"
        ],
        "synopsis": [
          "The Godfather Part II presents two parallel storylines. One involves Mafia chief Michael Corleone in 1958/1959 after the events of the first movie; the other is a series of flashbacks following his father, Vito Corleone from 1917 to 1925, from his youth in Sicily (1901) to the founding of the Corleone family in New York.The film begins in 1901, in the town of Corleone, Sicily, at the funeral of young Vito's father, Antonio Andolini, who has been murdered for an insult to the local Mafia lord, Don Ciccio. During the procession, Vito's older brother is murdered because he swore revenge on the Don. Vito's mother goes to Ciccio to beg for mercy, but he refuses, knowing that nine-year-old Vito will seek revenge later in life. The mother takes Ciccio hostage at knifepoint, allowing her son to escape, and Ciccio's men kill her. They search the town for the boy, but he is aided in his escape by the townspeople. Vito finds his way by ship to New York, and at Ellis Island an immigration agent chooses Vito's hometown of Corleone as his surname, and he is registered as \"Vito Corleone\".In 1958 in a scene similar to the opening of the first film, Michael Corleone (Al Pacino), Godfather of the Corleone family, deals with various business and family problems during an elaborate party at his Lake Tahoe, Nevada compound to celebrate his son's First Communion. In his office, Michael meets with corrupt Nevada Senator Pat Geary (G. D. Spradlin) to discuss the price of the gaming licenses for the hotel/casinos the Family is buying. Geary, who has obvious contempt for Michael and other Italian businessmen who are moving into his state to take advantage of gambling opportunities, promises to make Michael's acquisition of his gaming license a difficult process. Michael ends his conversation with Geary when he refuses to pay the outrageous fee Geary demands, telling the senator he'll get nothing.Michael also deals with his self-indulgent younger sister Connie (Talia Shire), who, although recently divorced from her second husband, is planning to marry a man named Merl Johnson (Troy Donahue) with no obvious means of support and of whom Michael disapproves. Connie is still resentful of her brother having her husband, Carlo, killed years before due to his betrayal of the family. Michael also talks with Johnny Ola (Dominic Chianese), the right hand man of Jewish gangster Hyman Roth (Lee Strasberg), who is supporting Michael's move into the gambling industry. Belatedly, Michael deals with Frank \"Five Angels\" Pentangeli (Michael V. Gazzo), a business associate who took over Corleone caporegime Peter Clemenza's territory in New York City after his death, and now has problems with the Rosato Brothers, who are backed by Roth. Pentangeli leaves abruptly, after telling Michael \"your father did business with Hyman Roth, your father respected Hyman Roth, but your father never trusted Hyman Roth.\"Later that night, Michael barely escapes an assassination attempt when his wife Kay (Diane Keaton) notices the bedroom window drapes are inexplicably open, which allows two unseen hitmen to spray the bedroom with bullets. The two hitman are found dead having been killed by a \"mole\" within the compound. Afterwards, Michael tells his lawyer and associate Tom Hagen (Robert Duvall) that the hit was made with the help of someone close, and that he must leave, entrusting all his power to Hagen to protect his family.Flashback: In 1917 New York City, the adult Vito Corleone (Robert De Niro) works in a grocery store in the Lower East side with his friend Genco Abbandando. The neighborhood is controlled by a member of the \"The Black Hand,\" Don Fanucci (Gastone Moschin), who extorts protection payments from local businesses. One night, Vito's neighbor Clemenza (Bruno Kirby) asks him to hide a stash of guns for him, and later, to repay the favor, takes him to a fancy apartment where they commit their first felony together, stealing an elegant rug.The film flash-forwards to Michael's time. Michael meets with Hyman Roth in Miami, Florida who tells Michael that he believes Frank Pentangeli was responsible for the assassination attempt, and that Pentangeli will pay for it. Traveling to Brooklyn, Michael lets Pentangeli know that Roth was actually behind it, and that Michael has a plan to deal with Roth, but he needs Frankie to cooperate with the Rosato Brothers in order to put Roth off guard.While sleeping, Fredo gets a phone call in the middle of the night from Johnny Ola, Hyman Roth's right hand man, revealing that Fredo is the traitor in the family. Johnny Ola conspires with Fredo, telling him that Frank Pentangeli is going to make peace with the Rosato Brothers. Johnny Ola asks Fredo information about the meeting between these two parties, and whether or not Pentangeli will be alone. Fredo disagrees to cooperate and tells Johnny Ola to never call him again.When Pentangeli goes to meet with the Rosatos at a local bar, he is told \"Michael Corleone says hello,\" as he is attacked from behind but the attempted murder is accidentally interrupted by a policeman. Pentangeli is left for dead, and his bodyguard, Willi Cicci (Joe Spinell), is struck by a car while shooting at the Rosatos as they drive away.Back in Nevada, Tom Hagen is called to a brothel in Carson City run by Michael's older brother Fredo (John Cazale), where Senator Geary is implicated in the death of a prostitute, and Tom offers to take care of the problem in return for \"friendship\" between the Senator and the Corleone family.Meanwhile, Michael meets Roth in Havana, Cuba, in late 1958, at the time when dictator Fulgencio Batista is soliciting American investment, and communist guerrillas are trying to bring down the government. At a birthday party for Roth, Michael mentions that there is a possibility that the rebels might win, making their business dealings in Cuba problematic. Earlier that day, Michael had witnessed a communist rebel kill a Havana policemen by detonating a grenade that also killed the rebel himself. The comment prompts Roth to remark, privately, that Michael has not delivered the two million dollars to firm their partnership.Fredo, carrying the promised money, arrives in Havana and meets Michael. Michael mentions Hyman Roth and Johnny Ola to him, but Fredo says he has never met them. Michael confides to his brother that it was Roth who tried to kill him, and that he plans to try again. Michael assures Fredo that he has already made his move, and that \"Hyman Roth will never see the New Year.\"Instead of turning over the money to Roth, Michael asks him who gave the order to have Frank Pentangeli killed. Roth avoids the question, instead speaking angrily of the murder of his old friend, Moe Greene, which Michael had orchestrated (as depicted at the end of the first film).Michael has asked Fredo, who knows Havana well, to show Senator Geary and other important officials and businessmen a good time, during which Fredo pretends to not recognize Johnny Ola. Soon after, at a sex show, Fredo comments loudly that Johnny Ola told him about the place, contradicting what he told Michael twice earlier, that he didn't know Roth or Ola. Michael now realizes that the traitor is his own brother, and dispatches his bodyguard to deal with Roth.Johnny Ola is strangled, but Roth, in a delicate state because of his heart condition, is taken to a hospital, where Michael's enforcer is shot trying to kill him. At Batista's New Year's Eve party, at the stroke of midnight, Michael grasps Fredo tightly by the head and kisses him: \"I know it was you Fredo; you broke my heart.\" When guerrillas attack, the guests flee, but Fredo refuses to go with Michael, despite Michael's pleas that Fredo is still his brother and that it's the only way out.Flashback (1917): Don Fanucci of the Black Hand is now aware of the partnership between Vito, Clemenza and Sal Tessio (John Aprea), and wants his share of their profits every week. Clemenza and Tessio agree to pay, but Vito is reluctant and asks his friends to leave everything in his hands so Fanucci will accept less and indeed, Vito manages to get Fanucci to take only one sixth of what he demanded ($100 out of $600). Immediately afterward, during the neighborhood festa, Vito murders Fanucci in the hallway outside his apartment and then rejoins his wife and three children on the stoops outside his tenement. Vito tells the infant Michael that his father loves him very much.In January 1959, Nevada, Michael returns to his snow-covered Lake Tahoe compound after fleeing Cuba, where Tom Hagen tells him that Roth escaped from Cuba after suffering a stroke and is recovering in Miami, that Michael's bodyguard is dead, and that Fredo is probably hiding in New York. Hagen also informs Michael that Kay had a miscarriage while he was away. Michael is distraught at the news and furiously demands to know the sex of the child, but Tom is unable to tell him.Flashback (1920): with Fanucci dead and with no one else to take over the Black Hand, Vito earns the respect of the neighborhood and begins to intercede in local disputes, operating out of the storefront of his Genco Pura Olive Oil Company (named after his friend Genco Abbandando) which he manages as well as give out \"favors\" to others in the community such as a local young woman threatened with eviction. Vito intimidates her landlord into letting her stay for a few extra weeks... rent free.In Washington, D.C. of 1959, a Senate committee, of which Senator Geary is a member, is conducting an investigation into the Corleone family. They question disaffected \"soldier\" Willi Cicci about his role as a button man in the Family, but he cannot implicate Michael, because he never received any direct orders from him. When Michael appears before the committee, Senator Geary makes a big show of supporting Italian-Americans and then excuses himself from the proceedings. During questioning, Michael denies all criminal allegations against him, from the murder of Sollozzo and Captain McCluskey back in 1946 (in the first Godfather movie), and to his business status of operating several gambling casinos in Nevada. Michael makes a statement challenging the committee to produce a witness to corroborate the charges against him. The hearing ends with the Chairman promising a witness who will do exactly that.Frank Pentangeli, who survived the attack by the Rosato Brothers, has made a deal with the FBI, and will testify against Michael. Tom Hagen and Michael discuss the problem, observing that Roth's strategy to destroy Michael is well planned. Michael's brother Fredo has been found and persuaded to return to Nevada, and in a private meeting he explains to Michael his betrayal: upset about being passed over to head the family in favor of Michael, he wants respect and his due. He helped Roth thinking there would be something in it for him, but he swears he didn't know they wanted to kill Michael. He also tells Michael that the Senate Committee's chief counsel is Roth's man. Michael then tells Fredo: \"You're nothing to me now. Not a brother, not a friend, nothing\", and privately instructs soldier and button man Al Neri (Richard Bright) that nothing is to happen to Fredo while their mother is still alive.At the hearing in which Frank Pentangeli is to testify, Michael arrives accompanied by Pentangeli's brother, brought from Sicily, and whose presence causes Frank to recant his previous statements about Michael. When Pentangeli is pressed, he claims that he just told the FBI what they wanted to hear. With no witness to testify against Michael, the committee adjourns, with Hagen, acting as Michael's lawyer, loudly demanding an apology.At a hotel room afterwards, Kay tries to leave Michael, taking their children with her. Michael at first tries to mollify her, but loses his temper and hits her violently when she reveals to him that her recent \"miscarriage\" was actually an abortion to avoid providing another child into Michael's criminal inheritance. She also tells him that the baby was a boy, further infuriating Michael.Flashback (1925): While visiting Sicily for a family vacation for the first time in over 20 years, Vito Corleone is introduced to the elderly 90-year-old Don Ciccio as the man who imports their olive oil to America, and who wants his blessing. When Ciccio asks Vito who his father was, Vito says, \"My father's name is Antonio Andolini, and this is for you!\", cutting the old man's stomach open with a knife, avenging the death of his father, mother, and brother. As they make their escape from Ciccio's compound and his men, Don Tomasello is shot in the leg by one of Ciccio's bodyguards, giving him a permanent limp.In April 1959, Carmella Corleone (Morgana King), Vito's widow and the mother of his children, dies, and the whole Corleone family is reunited for her funeral. Michael still shuns Fredo, who is miserable, but relents when Connie implores him to. Michael and Fredo embrace, but at the same time Michael signals to his capo that Fredo's protection from harm, in effect while their mother lived, has now run out.Michael, Tom Hagen, and Rocco Lampone discuss their final dealings with Hyman Roth, who has been unsuccessfully seeking asylum from various countries, and was even refused entry to Israel as a returned Jew. Michael rejects Hagen's advice that the Corleone family's position is secure, and killing Roth and the Rosato brothers for revenge is an unnecessary risk. Later, Hagen pays a visit to the imprisoned Frank Pentangeli on a military base and suggests that he take his own life, in the manner of unsuccessful ancient Roman conspirators who, in return, were promised that their families would be taken care of after their suicide.With the connivance of Connie, Kay visits her children, but cannot bear to leave them and stays too long. When Michael arrives, he coldly closes the door in her face.The movie reaches its climax in a montage of assassinations and death, reminiscent of the end of Part One:As he arrives at an airport to be taken into custody, Hyman Roth is killed by Rocco Lampone, disguised as a journalist, who himself is immediately shot dead by Roth's bodyguards.On the military base, Frank Pentangeli is found dead, having followed Hagen's instructions and committed suicide in his bathtub.Fredo is murdered by Al Neri while they are fishing on Lake Tahoe - while Fredo is saying a Hail Mary to help catch a fish.The penultimate scene takes place late in 1941, and the Corleone family is preparing a surprise birthday party for their father Vito. Sonny (James Caan) introduces Carlo Rizzi (Gianni Russo), Connie's future husband and betrayer of Sonny, to his family. They all talk about the recent attack on Pearl Harbor by the Japanese, and Michael shocks everybody by announcing that he has just enlisted in the United States Marine Corps. Sonny ridicules Michael's choice, and Tom Hagen mentions how his father has great expectations for Michael. Fredo is the only one who supports his brother's decision. Sal Tessio comes in with the cake for the party, and when Vito arrives, all but Michael leave the room to greet him.The final shot in the film is Michael sitting by himself at Lake Tahoe, in silent contemplation."
        ],
        "summaries": [
          "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
          "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
          "The life of Vito Corleone is shown as he becomes from a boy born in Sicily to one of the most respected mafia dons of New York while Micheal attempts to expand his business empire into Las Vegas, Florida and pre-revolution Cuba while facing his own personal problems trying to keep his collapsing marriage and relationship with his brother intact.",
          "The continuation of the Godfather saga with two focuses: the ongoing story of the Corleone family, and Michael in particular, and Vito Corleone's (Michael's father) backstory. Regarding the ongoing Michael Corleone story, it is about seven years since the events that concluded The Godfather. With the murders of the heads of the other four New York / New Jersey families, the Corleone family has unassailable control in New York. The move to Nevada went smoothly and Michael Corleone controls several hotels and casinos in the state. Frank Pentageli, the man who runs Michael's interests in New York, comes to Michael, asking if he can take out the Rosato Brothers as they are infringing on Pentageli's turf and business interests. However, the Rosatos are backed by Hyman Roth, a business partner of Michael's and a long- time ally of Michael's father, Vito Corleone, and Michael refuses. An attempted assassination attempt is then carried out on Michael's life, in his own home. Michael investigates who is trying to kill him, and suspects that there is a traitor in his family. Meanwhile. Michael and Hyman Roth fly to Cuba to finalise some business deals there. The Cuban trip reveals all. In a story interwoven with the present day, we see the backstory to Vito Corleone. From how his parents and brother were murdered by a Don in their home town of Corleone in Sicily, to his escaping, as a boy, to New York, his adult life and his rise to Don Corleone.",
          "The childhood of Vito Corleone and his rise from a petty criminal to the most powerful don in New York City during the early 20th century is depicted, whilst his son Don Michael Corleone succumbs to power, greed, and ruthlessness, all for the sake of pride and keeping the Corleone family intact."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "iS_NAIUBmFo8GYv0bn0u",
        "_score": 31.279594,
        "title": "Waking the Dead",
        "year": 2000,
        "genders": [
          "Drama",
          "Mystery",
          "Romance"
        ],
        "score": 6.5,
        "directors": [
          "Keith Gordon"
        ],
        "writers": [
          "Scott Spencer",
          "Robert Dillon"
        ],
        "synopsis": [
          "The first scene of the movie introduces Fielding Pierce (Billy Crudup) as he is watching news footage showing that Sarah Williams (Jennifer Connelly) has been killed in a suspected car bombing. The reporter indicates that Sarah was an activist from Chicago involved in helping refugees from the Chilean government and that her death may cast new light on the movement. Fielding is completely distraught over hearing this news and the movie begins.The first 3/4 of the movie unfolds on parallel timelines in the 70s and early 80s: the progression of Fielding & Sarah's complicated, volatile relationship and Fielding's ascension into power as an upcoming politician dealing with the recent loss (and haunting memories) of Sarah.Fielding meets Sarah as he is returning, in uniform, from duty in the Coast Guard and meeting up with his brother, who is a editor. The brother, Fielding and Sarah all go to lunch where Fielding is very ouspoken in his political ideals about current events. Sarah and Fielding are both immediately intrigued by each other, Fielding's attraction being more sexual and blatant and Sarah's attraction more of curiousity and intrigue. A few dates quickly lead to a sexual relationship despite an obvious difference in political thinking between the two. Sarah asks why Fielding wants to be a senator and his very serious reply is that he doesn't- he wants to be president. Sarah is later quoted as saying \"Ambition is the ice in the lake of emotion.\" And when Fielding tries to comfort Sarah's fear of his Coast Guard duty leading to a Vietnam tour, she replies \"but if you go over there, you'll be shooting at the guys that I want to win.\" Their intense love outweighs their differences, though, and their relationship quickly becomes serious.Meanwhile Fielding is a young politician being groomed to be congressman by the current govenor because of a scandal involving Jerry Carmichael 's (Ed Harris in a cameo role) resignation due to his homosexuality. Fielding seems ambivalent about the offer to be put on the ticket, perhaps because of the nature of the resignation- as he indicates- or pehaps because of the impact of Sarah's influence on his current ambitions. Either way, the governor and his top advisor Isaac (Hal Holbrook) are not comfortable with this lack of enthusiasm and do not offer much hand holding. This confrontation sets the tone for the later timeline in Fielding's life as his insecurities and haunting memories of Sarah eventually lead to hallucinations and his emotional breakdown. Fielding is now dating Isaac's daughter, but their relationship is clearly not as intense as his past relationship with Sarah. Conversations with his sister Caroline (Janet McTeer) and visits with his dad quickly lead to discussions about Sarah and how is haunting memories are leading to him seeing Sarah again. His family is supportive without offering any helpful advice other than to focus more on the political path ahead of him.Sarah and Fielding's relationship takes them to Chicago where they share an apartment as he continues law school and she begins missionary work for a local church led by Father Steven (John Carrol Lynch). Fielding's involvement with Isaac soon begins, and Sarah's aversion to the whole political process becomes more threatening. After a uncomfortable encounter with Sarah at one of Fielding's political events, where her disdain for the situation leads to a verbal attack on one of the attendees, they attempt to reconcile on the subway afterwards. They cannot reach an agreement and she proclaims \"It is so infuriating loving you!\" Fielding chuckes and says that the feeling is mutual. Sarah's long hours away from home, spent working at the church, lead Fielding to foolishly suspect Sarah is having an affair with Father Steven. Their intense bond holds them together through their disagreements and insecurities.Fielding starts the campaign trail even as his memories of Sarah convince him that she may still be alive and is watching him. He even chases someone he believes to be her through town and eventually ending at a church. But his search is fruitless and only further shows his descent into emotional breakdown. His relationship with Molly becomes troubled as he emotionally withdraws from her also. When she tries to reach to him, he does not offer any recognition of her or his feelings.Sarah's missionary work leads to activist work in Chile where her and Father Steven bring back political refugees of the government. At one uncomfortable dinner at the church with Fielding. The refugees are appalled to hear that Fielding is hoping to enter politics, an american institution they feel is overrun with corruption. Fielding tries to convince them he is not entering politics to become corrupt but to affect change. They are not conducive to this idea. He chastises their hypocrisy by observing that as awful as they try to hint his government is, he can't help but to notice when they needed help they ran to this country for freedom. When he turns to Sarah for help, she offers \"You are alone in this conversation.\" Fielding then replies he is alone in this whole room and he is \"choking on the collective sense of superiority.\" Fielding and Sarah's political difference and growing distance is shown at its worst, as no make up scene follows. Soon after Sarah leaves for her fatal trip in Milwauke."
        ],
        "summaries": [
          "A congressional candidate questions his sanity after seeing the love of his life, presumed dead, suddenly emerge.",
          "Fielding Pierce lives the life of an aspiring politician - in 1972 he's serving in the Coast Guard (trying to avoid Vietnam in the most honorable way), and by 1973 he has entered law school. Along the way he falls in love with Sarah, a fiercely idealistic woman who devotes her life to helping others - unfortunately she's killed in an explosion while assisting members of the Chilean resistance. Nine years later, in the middle of a congressional election, Fielding is suddenly flooded with thoughts and visions of his lost love."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "uS_NAIUBmFo8GYv0bnot",
        "_score": 30.333277,
        "title": "Timecop",
        "year": 1994,
        "genders": [
          "Action",
          "Crime",
          "Sci-Fi"
        ],
        "score": 5.9,
        "directors": [
          "Peter Hyams"
        ],
        "writers": [
          "Mark Verheiden",
          "Mike Richardson"
        ],
        "synopsis": [
          "In 1863, Confederate soldiers are carrying a gold bullion as a payday for the army. Suddenly, they are cornered and shot by a highwayman using anachronistic automatic pistols and futuristic tech equipment, leaving them stranded and dead. The mysterious highwayman steals the trunk containing the gold and then suddenly vaporizes into a gelatin like mist.In 1994, 131 years later in Washington DC, the U.S. government creates the Time Enforcement Commission (TEC) to combat the misuse of newly developed time travel technology. They have discovered that the same gold bullion was used in recent arms purchases. The TEC is to detect \"time ripples\" among the time-lines and to stop them from happening before they reach the present, since people cannot travel forward in time to the future, they always travel back to either change history or steal riches. (Note: the mysterious highwayman who killed the Confederate soldiers in 1863 to steal their gold is never seen again or identified). Senator Aaron McComb (Ron Silver) volunteers to fund and oversee the commission.Meanwhile, police officer Max Walker (Jean Claude Van Damme) is offered a job as a TEC agent. He meets his wife Melissa (Mia Sara) at a local shopping mall where he stops a purse snatcher. He notices three odd-looking punk men following them despite never seeing them before. Walker and Melissa go home to their large fancy house and later make love.Later that same evening, Max is attacked in his home by the same intruders he saw earlier at the mall and Melissa is killed in an explosion, destroying his house.Ten years later in the year 2004, Walker is now a veteran TEC Agent. He is sent back to October 1929, in the midst of the Wall Street crash to arrest his former partner Atwood (Jason Schombing) for taking advantage of the U.S. stock-market crash. After subduing Atwood's bodyguards, Walker interrogates Atwood who reveals that he is working for Senator McComb, who needs money for his presidential campaign. Terrified by McComb's threat by sending hit-men back in time to murder his ancestors, thereby wiping out his existence, Atwood tries to kill himself by jumping out a window. Walker catches him as he falls and takes him back to 2004, but Atwood refuses to testify against McComb and the TEC agency sends him back to 1929, right where he left off, this time falling to his death.Senator McComb arrives at the TEC agency to oversee the work and to congratulate Walker for his recent successful mission. Walker implies to McComb that he knows all about his dirty dealings behind the scenes in Washington and about his means to acquire money for his campaign. McComb leaves the facility and orders his aide to have Walker killed. The next morning, two assassins break into Walker's small apartment and attempt to kill him, but Walker, a trained martial arts expert, kills both assassins after a violent and protracted fight.While still trying to investigate McComb to expose him of corruption, Walker is partnered with agent Sarah Fielding (Gloria Reuben), and sent back to 1994 to investigate a pending ripple, where they find a young Senator McComb arguing with his business partner Jack Parker about their company's new computer chip. Parker offers to buy McComb's share of the company, but suddenly, the older McComb arrives from 2004 to warn his younger self that the chip will make huge profits. A fight starts when Walker is double-crossed by Fielding, who reveals she works for McComb. McComb kills Parker, wounds Fielding, attempts to kill Walker, and manages to escape back to 2004.When Walker returns to 2004, he finds that things have become worse. McComb now owns the computer company, with no record of Parker. He is almost guaranteed the Presidency with his finances and approval rating. The TEC is being shut down due to budget cuts. There is also no record of Fielding. Realizing that he has to fix things, Walker hijacks the original prototype time machine (which McComb had been using for their illegal trips) with the help of Commander Matuzak (Bruce McGill), who sacrifices himself when McComb's men try to stop Walker from escaping.Finding himself once more in 1994, Walker finds Fielding in the hospital, where she agrees to testify against McComb. Whilst trying to find Fielding's DNA from a blood sample in the lab, Walker finds a sample of Melissa's blood and it indicates she is pregnant. Walker realizes her death occurred later that night, and he decides to stop it. After going back to Fielding's room, he discovers that she has been murdered and he is framed as the prime suspect.He goes to the mall where he and Melissa met that night. Eventually, Max Walker finds her and manages to convince her he is from the future. He also sees the three thugs who attacked him and realizes that they are McComb's men whom were sent back to kill him before he joined the TEC.That evening, McComb's thugs break into Walker's home, like before, only this time the older Walker is waiting for them. Without his younger self realizing it, the older Walker helps to fight off the bad guys. Together, they and Melissa win, though the younger Walker is wounded. The 2004 McComb then takes Melissa hostage. When the older Walker finds McComb is holding Melissa, the corrupt senator then sets a time bomb. He then shoots Melissa, just before the young McComb appears, having been tricked into coming to the house by a fake message from Walker. Walker grabs the young McComb and pushes him into the older one, causing them to become a writhing, screaming mass which melts into nothingness (since according to the time theory, no two persons can exist by physically touching each other).Walker carries the wounded Melissa out of the house just before the bomb explodes, destroying the house just like before. He lays the unconscious Melissa beside his younger self and leaves the scene before the local police and fire department arrives. Walker returns to 2004, and the time-line has been corrected. The TEC still exists, Fielding and Matuzak are alive, and McComb does not exist, having \"vanished\" ten years earlier. As Walker returns home, he is happily shocked to find himself living in the same house which was rebuilt. Melissa is alive and their nine-year-old son is waiting to greet him. As Walker walks into the house for dinner Melissa has something to announce to Walker... implying that she is pregnant again."
        ],
        "summaries": [
          "Max Walker, an officer for a security agency that regulates time travel, must fend for his life against a shady politician who's intent on changing the past to control the future.",
          "When the ability to travel through time is perfected, a new type of law enforcement agency is formed. It's called Time Enforcement Commission or TEC. A cop, Max Walker, is assigned to the group. On the day he was chosen, some men attack him and kill his wife. Ten years later Max is still grieving but has become a good agent for the TEC. He tracks down a former co-worker who went into the past to make money. Max brings him back for sentencing but not after telling Max that Senator McComb, the man in charge of TEC, sent him. Max has his eye on McComb.",
          "When time travel was developed by a scientist in 1994, there was the need to create the Time Enforcement Commision (TEC) under the control of Senator Aaron McComb to protect the past from modifications. The police office Max Walker is invited to join the TEC, and when his wife Melissa is murdered by strangers, he accepts the invitation to work under the command of Eugene Matuzak. In 2004, Walker is assigned to capture his former partner Lyle Atwood that is manipulating the stock market in 1929. Atwood tells that he is working for Senator McComb, who is a powerful politician that is running for president. Atwood prefers to die and does not confess that McComb is a criminal. Now Max knows the truth but McComb is changing the past and Max does not know how stop him.",
          "To monitor the illegal use of time travel, the government founds the Time Enforcement Commission, a high-tech police department under Senator Aaron McComb's supervision. However, ten years later, in 2004, the devoted TEC agent, Max Walker, who is still reeling from the untimely and rather mysterious loss of his wife, is summoned to unearth a conspiracy which dates back in time. Will the haunted Timecop use this advanced technology to thwart the evil plans of the megalomaniac who is behind a string of hideous time-crimes? In the end, will Max tamper with the past to right the wrongs, no matter the cost?",
          "The perfection of time travel brings with it new opportunities for criminals. The government sets up a special police force (T.E.C.) to ensure the new technology isn't abused. Max Walker, one of these timecops learns of a corrupt politician's plot to become president using the device. Senator McComb discovers Walker on his trail and the real action begins--in Walker's own past!",
          "In Washington DC in 1994, the Senate Oversight Committee (SOC) is being spoken to in the capitol building by George Spota, who explains that for the past 20 years, Doctor Hans Kleindast, the Nobel laureate who help the government with the space program back in the 1960s and 1970s, has been doing research, and his field of research has been time travel. The SOC believes that Hans is a quack -- until George tells the SOC that Hans actually succeeded in his research and took a trip to the past then back to the present. You can't travel into the future because the future hasn't happened yet. George makes it clear that a covert agency is needed to police time travel, so the Time Enforcement Commission (TEC) is formed. Named as the director of the TEC is Commander Eugene Matuzak, formerly of the Washington DC police department. Senator Aaron McComb, who sees possibilities, agrees to chair the oversight on the new program. Sometime later, at a shopping center, TEC agent Max Walker and his wife Melissa are being watched by a pair of shady looking men. Later, at home. Max and Melissa spend some passionate time together. That night, Melissa is about to tell Max something extremely important when the phone rings. Max answers the phone and is told to go to TEC headquarters. Max gets dressed and as soon as Max opens the front door to go outside, he is attacked by the two men from the shopping center. As the two men are beating Max up. Max sees Aaron looking out the window of the bedroom that Melissa is still in, and Aaron is holding Melissa hostage, forcing Melissa to watch Max's beating. The two men outside then shoot Max, who is wearing a bulletproof vest -- and then an explosion engulfs the house, killing Melissa. On October 30, 1929, on Wall Street in New York City, a man named Lyle Atwood enters an office building and rides an elevator up to an office. There is a sudden ripple in the office, and Max enters from the future. It turns out that Lyle is Max's partner, and Lyle is planning to stop the depression from happening. Max wants to know who Lyle is working for, and Lyie calls two security men into the office to deal with Max. Max beats up the two security men, and Lyle pulls out a gun and opens fire on Max. When Lyle runs out of bullets, Max forces Lyle to admit that he's working for Aaron, and that Aaron has paid off a lot of other TEC agents as well. Lyle then jumps out the window. Max jumps out after Lyle, grabs him, and takes Lyle with him back to present time, which is now the year 2004, ten years after Melissa's murder. TEC judge Marshall sentences Lyle to be immediately executed, so Lyle is sent back to 1929 and is dropped to his death from the point in midair where Max and Lyle disappeared to 2004. At TEC Headquarters in 2004, Aaron, Max, and Matuzak are showing Senator Malcolm Nelson around the TEC building. Aaron reminds everyone that people who go back in time risk coming into contact with a past version of themselves. The same matter cannot occupy the same space at the same time, because if that happens, and if it's a person accidentally making physical contact with their past version, that person will die, and their body will disappear from the face of the Earth. Later, Max tells Matuzak that Aaron wants to shut down the TEC so no one can stop him from altering the past to his advantage, because Aaron is now running for President of the United States. Aaron's fading campaign for president is dealt a blow when he is denied federal campaign matching funds. Just before Max wakes up, two men break into his home to kill him, but Max turns the tables and kills the two men who broke in. TEC internal affairs investigator Sarah Fielding questions Max. Max soon learns that Sarah may be on the wrong side in this. Max must travel back and forth in time to bring Aaron down...and when Max goes back to 1994 and finds out what Melissa wanted to tell him 10 years ago, it gives Max incentive to at least try to prevent Melissa's murder."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Yi_NAIUBmFo8GYv0bo40",
        "_score": 29.08633,
        "title": "Gangster Squad",
        "year": 2013,
        "genders": [
          "Action",
          "Crime",
          "Drama"
        ],
        "score": 6.7,
        "directors": [
          "Ruben Fleischer"
        ],
        "writers": [
          "Will Beall",
          "Paul Lieberman"
        ],
        "synopsis": [
          "note: work in progressIn 1949 post-WWII Los Angeles, gangster Mickey Cohen (Sean Penn) has become the most powerful figure in the California criminal underworld, and intends to continue to expand his criminal enterprise across the Western United States, forcing out his rivals in Chicago. The police have not been able to stop Cohen's ruthless rise, as Cohen has eliminated witnesses and bribed both the courts and the police, controlling both illegal and legal sides of L.A.The movie opens as Cohen has a gangster from Chicago killed by shackling him to two cars, which then proceed to rip him in half. He warns the gangster's partner to return to Chicago with news of what he's seen.The next day, Sgt. John O'Mara (Josh Brolin) and his partner are at Los Angeles Union Station when they see one of Cohen's thugs, Mitch, approach a young woman and tell her he is holding auditions, and hands her a card to convince her he is legitimate. O'Mara realizes, however, that Mitch intends to rape her. They tail him to a building that is owned by Cohen. O'Mara's partner refuses to enter, forcing O'Mara to go inside by himself.O'Mara enters the building, telling the man that he is meeting someone. He gets on an elevator, accompanied by two thugs. Things go sour, though, when one of them sees his handcuffs and realizes that O'Mara is a cop. A fight breaks out, during which one henchman is killed and another loses his hand. O'Mara finds the room where the girl is being held captive. He bursts in and after a brawl, subdues the three men and rescues the girl.Although the gangsters are arrested, they are set free on a corrupt judge's order, and Cohen subsequently has them killed by locking them up in an elevator and burning down the building.O'Mara is personally selected by Chief Bill Parker (Nick Nolte) due to O'Mara's special operations background and training at Camp X during World War II to wage guerrilla warfare on Cohen, dismantling his crime empire and forcing him out of Los Angeles. With the help of his reluctant and pregnant wife, Connie (Mireille Enos), O'Mara recruits fellow officers in his squad. Initially he is joined by hard-headed detective Coleman Harris (Anthony Mackie), wire-tapper Conway Keeler (Giovanni Ribisi), and legendary gangster-killer Max Kennard (Robert Patrick). Kennard's partner, Navidad Ramirez (Michael Peña), follows the squad and they reluctantly allow him to join. Sgt. Jerry Wooters (Ryan Gosling), O'Mara's close friend, turns down the offer, as he is disillusioned from the war and his time on the police force.Wooters has been keeping close to his old friend Jack Whalen (Sullivan Stapleton), who is his informant from within Cohen's operations. After meeting for drinks, Wooters becomes infatuated with Cohen's etiquette coach and girlfriend Grace Faraday (Emma Stone). Wooters and Grace begin a secret romantic relationship. After Cohen orders a hit on rival Jack Dragna (Jon Polito) that results in the death of Pete (Austin Abrams), an innocent boy Wooters knew, Wooters becomes motivated to take down Cohen. He saves O'Mara's squad after an unsuccessful hit on one of Cohen's casinos, and later joins them.With organization and better planning the unit strikes several successful blows at the heart of Cohen's criminal organization. The media refer to them as \"The Gangster Squad\". After wire-tapping Cohen's house, Keeler deduces the central location of Cohen's wire gambling business, the heart of his empire. The squad successfully burns down the business, but Cohen's men inform him that they didn't take any of his money. Cohen believes they are a group of honest cops, and believes someone ratted him out and tapped his house. As his men sweep the house for bugs, Grace runs away, fearing Cohen knows of her relationship with Wooters.The Gangster Squad is lured into a trap in Los Angeles's Chinatown by Cohen's head hitman Wrevock (Troy Garity), who was also responsible for Pete's death. Wooters interrupts the ambush just in time to save O'Mara, but Wrevock escapes. Karl Lennox (Holt McCallany), Cohen's right-hand man, kills Keeler in the unit's operation. Wooters asks Whalen to get Grace out of town, but Cohen reaches him first, looking for Grace, and kills him. O'Mara's house is later hit by a drive-by, and Connie gives birth to their son under the stress. Chief Parker tells O'Mara that, as a result of their failure, their careers with the LAPD are over. O'Mara gets Connie out of town, but refuses to leave with the job unfinished. Grace tells Wooters she is willing to testify against Cohen for Whalen's murder, prompting O'Mara, along with the remaining members of his unit, to go to the Park Plaza Hotel to arrest Cohen.Cohen and his men engage in a firefight with the police unit, with Wooters being wounded in the process after killing Wrevock. Cohen and Lennox escape, but O'Mara pursues them, which results in their vehicle crashing into a fountain. Kennard gets shot by Lennox, but manages to kill him with help from Navidad, before dying from his wounds. O'Mara prepares to arrest Cohen, but Cohen tempts him into fighting each other in a bare-knuckle boxing match, while a crowd of onlookers and journalists gather. O'Mara finally beats Cohen and has him arrested, ending his reign as a crime boss and the spread of the mafia into the Los Angeles area. The Gangster Squad was never mentioned in taking down Cohen, their surviving members remaining a secret. Cohen is sentenced to 25 to life, and is welcomed violently by Whalen's friends. Grace and Wooters continue their relationship, while Navidad and Harris become partners on the force. O'Mara quits to live a quiet life with his wife and son"
        ],
        "summaries": [
          "It's 1949 Los Angeles, the city is run by gangsters and a malicious mobster, Mickey Cohen. Determined to end the corruption, John O'Mara assembles a team of cops, ready to take down the ruthless leader and restore peace to the city.",
          "It's 1949 Los Angeles, and gangster Mickey Cohen has moved in, with the intention of controlling all criminal activity in the city. He has bought local judges and police, and no one is willing to cross him or testify against him. Everyone except Sergeant John O'Mara, a former World War II soldier, whose goal is to settle with his family in a peaceful Los Angeles. Police Chief William Parker decides to form a special unit whose mission is to take down Cohen, and chooses O'Mara to lead the unit. O'Mara chooses 4 cops and asks another cop and vet, Jerry Wooters to join him but Wooters is not interested. After Wooters witnesses the murder of a young boy by Cohen's people, he joins them, and they decide to take apart Cohen's organization. Cohen wonders if a rival is going after him, eventually he realizes it's the cops.",
          "1949 Los Angeles. Boxer turned mobster Mickey Cohen, who had been working in Chicago with some other mobster associates, has moved his operation to Los Angeles. He plans to take control of the city, in the process squeezing out all competition by whatever means, usually by violence. In being able to achieve this, Cohen has many in Los Angeles area authority in his back pocket. LAPD Chief Bill Parker asks Sgt. John O'Mara to assemble and lead an unofficial, off-the-books squad to deal with the Cohen problem. Parker makes this request specifically to O'Mara because of O'Mara's previous handling of some cases associated with Cohen's operations. O'Mara and the squad are not to kill Cohen - which would only lead to someone else taking over - but rather disable all his operations in such a way no other mobster would consider coming in. Although she doesn't much like this assignment, O'Mara's loving and very pregnant wife, Connie, convinces her husband that he needs to recruit others with specialized skills as opposed to clones of himself which was his original thought, her advice all in an effort to make sure he comes home alive as a father at the end of it all. O'Mara will have to control the disparate group he has assembled in working toward their common goal. One issue he will have to deal with is the fact that one of his colleagues, Sgt. Jerry Wooters, who has lost his professional drive, has just embarked on affair with Cohen's girlfriend, Grace Faraday, the two whose lives would be in danger if Cohen ever found out. As O'Mara and his team plow ahead without a clear plan, they may encounter problems in finding out who indeed is in Cohen's back pocket, and as they can't ask for any assistance from anyone outside of the squad as being \"unofficial\". Nonetheless, they may be able to continue progressing to their end goal as long as Cohen does not know who they are, namely that they are LAPD undercover. If they are ever discovered, it may not only compromise their work, but may place their lives, and that of their loved ones, in mortal danger.",
          "Having earned the respect of the Italian mob in 1949 Los Angeles, the brutally ambitious Brooklyn-born former professional boxer, Mickey Cohen, and his ruthless gang have spread their tentacles throughout the bustling city. Enjoying a preposterous immunity, and the ample protection of the local police and the corrupt politicians, Mickey brags about how he can dine with judges and police chiefs, who holds them in the palm of his hand, leaving the field clear for Cohen to enforce his omnipotence undisturbed. However, not if a small, top-secret LAPD task force can help it. Now, the brave and honest men of Sgt. John O'Mara and Jerry Wooters dice with death to bring down the vicious gangster's thriving criminal empire. Can L.A.'s Gangster Squad stop Mickey Cohen's reign of terror?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "tC_NAIUBmFo8GYv0bnwu",
        "_score": 26.259935,
        "title": "Les Misérables",
        "year": 1998,
        "genders": [
          "Crime",
          "Drama",
          "History"
        ],
        "score": 7.4,
        "directors": [
          "Bille August"
        ],
        "writers": [
          "Victor Hugo",
          "Rafael Yglesias"
        ],
        "synopsis": [
          "Jean Valjean, a man arrested for stealing bread nineteen years earlier, is released on account of Mrs. Herberst, Valjean's wife. When no one is willing to allow a convict to stay the night, Bishop Myriel kindly welcomes him into his home. Valjean explains to Myriel that sleeping in a real bed will make him a new man. In the night, Valjean, interrupted by Myriel while stealing his silverware, strikes him and flees. When the police arrest Valjean for stealing and drag him back to Myriel, Myriel tells them that the silverware was a gift and scolds Valjean for forgetting to take his candlesticks as well. Myriel then reminds Valjean that he is to become a new man.Nine years later, Valjean is now a wealthy industrialist and a mayor. Fantine, a single mother working at one of Valjean's factories, is fired when her manager learns she has had a daughter out of wedlock. However, Valjean is preoccupied with the arrival of Inspector Javert, who previously served as a guard at the prison in which Valjean was held. Fantine, in desperate need of money to pay the extortionate demands of Mr. and Mrs. Thénardier for looking after her daughter Cosette, turns to prostitution. Javert starts to suspect that the Mayor and Valjean are the same person. Fantine is attacked by some customers, and when she retaliates, Javert beats and arrests her, planning on sending her to prison. Citing his authority to do so as mayor, Valjean insists on her release and she is let go.Valjean nurses Fantine back to health, and promises her that she will have her daughter back. However, the Thénardiers continue to extort more money from Valjean and Fantine on the pretence of Fantine's daughter being ill. Later, Valjean receives word that another man is mistaken as being him and is about to be arrested. Valjean arrives at court where the man is being tried and reveals his identity that he is the real Valjean. Valjean then returns home and finds Fantine at death's door. Before she dies, Valjean promises Fantine that he will raise her daughter as his own. Javert arrives at Valjean's home to arrest both him and Fantine, but Fantine dies when Javert tells her she will be sent to prison. Angry and grieving, Valjean fights Javert and knocks him out, then flees the town. Valjean eventually finds and rescues Cosette from the Thénardiers, the corrupt innkeepers who were supposed to care for her, but are actually forcing her to be their servant. They care little for the girl, seeing her merely as a way to bring in money (going so far as to offer up Cosette as a child prostitute to the as-yet unrevealed Valjean). Both Valjean and Cosette finally make it to Paris where they start a new life together as father and daughter, cloistered within a religious convent.Ten years later, they leave the convent, and Cosette, now nineteen years old, falls deeply in love with a revolutionist, Marius. Meanwhile, Javert is now undercover as an insurrectionist, trying to undermine the organization to which Marius belongs. During an attempt to finally arrest Valjean, Javert is captured by Marius and is brought to the barricades as a prisoner to be executed. Valjean journeys to the barricades himself when he learns how much Cosette and Marius love each other, intending to persuade Marius to return to Cosette. When the soldiers shoot and kill Gavroche, a young boy allied with the revolutionists, Valjean uses his influence with Marius to have Javert turned over to him, so that he himself can execute him. Valjean takes Javert to a back alley, but instead of killing him, sets him free. Marius gets shot and Valjean takes him down a sewer to bring him to safety. Javert catches them, but agrees to spare Marius. Valjean takes Marius back to his home, also saying goodbye to Cosette. When Valjean returns to Javert, Javert tells him that he is now unable to reconcile Valjean's criminal past with his current lawful existence and the great kindness, generosity, and goodness that Valjean has shown. Stating, \"It's a pity the rules don't allow me to be merciful,\" Javert finally sets Valjean free, shackles himself, adding \"I've tried to live my life without breaking a single rule,\" and throws himself into the Seine thus taking his own life. Valjean walks down the empty street, finally a free man, with a smile on his face."
        ],
        "summaries": [
          "Valjean, a former criminal, has atoned for his past and now finds himself in the midst of the French Revolution, avoiding a law-obsessed policeman hell-bent on capturing him.",
          "Jean Valjean, a Frenchman imprisoned for stealing bread, must flee a police officer named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
          "Released on parole from prison, where he was sent for stealing bread for his starving relatives Jean Valjean attempts to rob a saintly bishop who has befriended him but when the bishop declines to turn him in and gifts him his silverware Jean swears to do only good, selling the silverware to finance a factory in a small town of which he has become mayor. When one of the factory workers, the down-trodden Fantine, dies Jean adopts her daughter Cosette, taking her to Paris as his own child. Here she meets and falls in love with Marius, a young student, part of the June rebellion of 1832. But Marius's political stance puts him in danger and Jean is being relentlessly pursued by policeman Javert, who recognizes him and wants to bring him down."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Hi_NAIUBmFo8GYv0bngs",
        "_score": 24.135681,
        "title": "Air America",
        "year": 1990,
        "genders": [
          "Action",
          "Comedy",
          "War"
        ],
        "score": 5.8,
        "directors": [
          "Roger Spottiswoode"
        ],
        "writers": [
          "Christopher Robbins",
          "John Eskow",
          "Richard Rush"
        ],
        "synopsis": [
          "Set in the year 1969, in the jungle of Laos, a local communist peasant takes a pot shot at a high flying US transport aircraft which is hit and begins trailing smoke, but makes it back to its base where it crashes and several crewmen on board are killed. The scene shifts to Los Angeles where Billy Covington (Robert Downey Jr.) works as a helicopter traffic pilot for a local radio station. When he breaks several safety regulations by flying low, the U.S. Federal Aviation Administration suspends his pilot's license. However, his piloting skills, bravery and disregard for the law are noticed by a mysterious government agent, who tells Billy that he can get his license back if he accepts a job in Laos, working for a \"strictly civilian\" company called Air America. It is readily apparent that Air America is a front for CIA operations in Laos.Unemployed and unable to find work, Billy takes the job. In Laos, he is introduced to Air America's unorthodox pilots and aircraft, being taken under the wing of Gene Ryack (Mel Gibson), a cynical and eccentric pilot and an arms dealer who uses official flights to buy black market weapons for his private cache. His dream, which he refers to as his \"retirement plan\", is to make a sale big enough so that he can afford to quit his job at Air America.The next day, Senator Davenport (Lane Smith) arrives in Laos on a \"fact finding mission\", to investigate rumors about Air America transporting drugs on behalf of Laotian forces. Major Lemond (Ken Jenkins) and Rob Diehl (David Marshall Grant), CIA leaders of Air America, show the Senator around refugee camps, shrines, temples, and major cities in a careful deception to hide from him that Air America is indeed transporting drugs.While airdropping livestock into rural villages in their C-123 cargo aircraft, Billy and Jack Neely (Art LaFleur) are shot down. The Pilatus PC-6 of General Soong (Burt Kwouk) arrives at the crash site and his soldiers load bags of opium on board, but leave Billy and Jack behind with Communist Pathet Lao forces moving in. Gene and another pilot arrive and rescue them; Billy boards Gene's helicopter while the rest of the crew escape in another aircraft.Billy and Gene's helicopter is shot down by the enemy soldiers on the way back, and they are captured by a rural Lao tribe. Gene notices that the tribe is using obsolete and unreliable flintlock guns and strikes a deal to supply them with better weapons. Allowed to go free, Billy and Gene retreat to Gene's house, where Billy is surprised to discover that Gene has a wife and children. Already disillusioned with US actions in Laos, Gene convinces Billy to quit his job with Air America, but Billy wants to get even with General Soong for betraying him when he crashed.Meanwhile, Senator Davenport is losing patience with Lemond and Diehl, and demands to know who is smuggling heroin. Soon after their return to base, the pilots learn that during his search for Billy and Gene, Jack was killed and Lemond and Diehl claim that he was the ring leader behind the drug trafficking. Enraged, Billy purchases grenades on the black market and uses them to blow up the heroin factory, but guards see him running away. Davenport is still unsatisfied and demands more concrete evidence.The next day, Gene finds a buyer for his arsenal, allowing him to leave gunrunning, quit Air America, and take his family out of the country. Meanwhile, Billy accepts one more flight before he actually quits. With co-pilot Babo (Tim Thomerson), he is assigned to transport flour to a refugee camp but they are instructed to divert to a nearby airstrip for \"routine inspection\". Billy immediately suspects a set-up, and a search reveals several kilos of heroin hidden in the flour sacks. With his fuel gauge tampered with, Babo and Billy decide to crash-land on the same airstrip where Billy crashed a few days earlier, and use the wreckage of the previous crash to hide the smaller aircraft.Gene, on his way to make his final, largest weapons delivery, flies in to rescue Babo and Billy after wondering why Billy can't seem to keep anything in the air. Billy convinces him to respond to a distress call from a refugee camp caught in the crossfire between General Soong's men and local rebels. Gene tries to rescue the United States Agency for International Development official (Nancy Travis) in charge of the camp, however, she refuses to leave without the refugees. After some initial resistance, Gene dumps the weapons to make room for the refugees, blowing up the weapons cache to cover their escape.In the air, Gene and Billy come up with a scheme to sell the aircraft to give Gene his money back. Senator Davenport recognises the set up for what it was, and the Senator threatens to reveal Lemond and Diehl's operation to Washington."
        ],
        "summaries": [
          "A young pilot finds himself recruited unwittingly into a covert and corrupt CIA airlift operation in Laos during the Vietnam conflict.",
          "Air America was the CIA's private airline operating in Laos during the Vietnam War, running anything and everything from soldiers to foodstuffs for local villagers. After losing his pilot's license, Billy Covington is recruited into it, and ends up in the middle of a bunch of lunatic pilots, gun-running by his friend Gene Ryack, and opium smuggling by his own superiors.",
          "Billy is a wacko pilot who loses his last straight job as a helicopter traffic reporter by getting into a screaming match with a driver. He takes a job working for what amounts to a CIA airline in Asia. Billy puts it as, \"I'm used to being the weirdest person in the room. Here I don't even make the top ten.\" There is an insurgency shooting at them, government soldiers running drugs, a pilot who is supplying arms to the whole region, and those are the straightforward sub plots."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "bS_NAIUBmFo8GYv0bnMr",
        "_score": 23.143559,
        "title": "Sgt. Pepper's Lonely Hearts Club Band",
        "year": 1978,
        "genders": [
          "Adventure",
          "Comedy",
          "Fantasy"
        ],
        "score": 4.2,
        "directors": [
          "Michael Schultz"
        ],
        "writers": [
          "Henry Edwards",
          "Tom O'Horgan",
          "Robin Wagner"
        ],
        "synopsis": [
          "The original Sgt. Pepper's Lonely Hearts Club Band performed during WWI in France, as the Allies' \"most effective weapon.\" Their melodies cheered troops engaged in battle and\nstopped hostilities, leading to their receiving the coveted Golden Eagle Award. Back at\ntheir hometown of Heartland, they continued performing through the Roaring '20's, the Depression, and through another Great War, until the demise of the bandleader in 1958.\nHe left his magical instruments to the town of Heartland. These items have the power to\nmake dreams come true, and as long as they remained in the town's possession, humanity would live happily foreverafter. He left his wholesome grandson, Billy Shears, (Peter Frampton) his Golden Eagle and musical legacy. The town's venerable mayor,\nMr. Kite (George Burns) tells the tale of the new Sgt. Pepper's Lonely Hearts Club band,\nconsisting of Billy, his best friends, Mark, Dave, and Bob Henderson (The Bee Gees), and managed by his jealous stepbrother, Dougie Shears (Paul Nicholas).The new band debuts in their wholesome small town one sunny summer day, introduced by money-hungry Dougie. Dave, Mark, and Bob start off the performance, joined by Billy after he shares a brief moment with his sweetheart, Strawberry Fields (Sandy Farina). Townsfolk of all ages instantly take to the boys, who receive a\ntelegram from Big Deal Records requesting a demo tape, with the promise of big success.\nMr. Kite briefly imagines himself as a superstar, performing a number in the town square,\nalone except for two little girls who join his jaunty dance.The town's magical weather vane picks up a strange signal, the arrival of Mean Mr. Mustard (Frankie Howerd). His mission: to Take Over Heartland. He is apparently\ndirected by the FVB, who reminds him: We hate love; We hate joy; We love\nmoney. The band is recording their demo tape at a farm near town as he arrives. Back\nin Hollywood, Big Deal's B.D. Hoffler (Donald Pleasence) hears the tape and begins his plan to sign them to his label. The band is summoned to Hollywood immediately, giving Billy and Strawberry scant time for tender goodbyes. They share one night in the farm's hayloft before the band's hasty departure.Arriving in L.A. by Big Deal's private jet, the band is welcomed personally by B.D. and his\nsexy assistant, Lucy (Dianne Steinberg). They are transported by stretch El Camino\nto B.D.'s mansion, where the naive bandmates are immediately corrupted by liquor, drugs, and\nwomen. Later that evening, the intoxicated boys are duped into signing B.D.'s exploitive contract. The next morning they commence recording sessions, leading to instant superstardom with sold-out concerts, intense media coverage, and enormous record sales. During their rise to success, B.D. requires Lucy and her backup singers, the Diamonds (Stargard) to control the band by exerting their evil and sexual influence.Back in Heartland, Strawberry pines for Billy while Mr. Mustard steals the magical instruments from Mr. Kite's office at City Hall. Mustard begins his mission to deliver the\ninstruments to various villainous characters. Without the protection of the instruments,\nHeartland instantly degenerates into a den of iniquity.Strawberry leaves home in pursuit of her beloved Billy, leaving her parents heartbroken in her absence. Mr. Mustard's robots alert him and his Brute (Carel Struyken) of Strawberry's departure. When she arrives in L.A., she sees a billboard showing Billy and the rest of the band, next to\nanother featuring Lucy and the Diamonds. Both billboards come to life. The women's seductive performance lures the men into their embrace, horrifying the distraught Strawberry. When she momentarily turns away, the billboards return to their inanimate\nstates.The next day, Strawberry arrives at the band's recording session, witnessing some flirtatious glances between Billy and Lucy. B.D. and Dougie try to get rid of her, but she is able to get in and explain the treachery that has befallen Heartland. Mr. Mustard\narrives moments later, and the band accosts his van in an effort to recover the stolen\ninstruments. The van's computer indicates the first instrument went to Dr. Maxwell Hammer (Steve Martin), a cheerfully deranged and money-driven physician. Billy, Mark, Dave, Bob, and Strawberry make haste to Dr. Hammer's office and retrieve Sgt. Pepper's silver cornet after a non-contact fight sequence. They find the drum in the van, then seek\nFather Sun (Alice Cooper) for the tuba. In his Orwellian lair, he drums the message, \"We Hate Love; We Hate Joy; We Love Money\" into the heads of militant young cadets. The band and Strawberry retrieve the tuba, but Billy is injured by an electrical shock. Back safely in the van, Strawberry lovingly tends to the unconscious Billy. He dreams of her, then revives at the sound of her beautiful singing.Mark Henderson, working at the van's computer, causes a malfunction and cannot retrieve the location of the final missing instrument. Heartland continues to deteriorate\ninto desperate circumstances. B.D. is forced to cancel several tour dates, but Dougie suggests a huge benefit concert to save the town.One day, as the townsfolk drudge through the town, bewildered at its delapidated state,\nthey are surprised by the arrival of a singing and acrobatic troupe, anchored by Sgt. Pepper's Lonely Heart's Club Band and the lovely Strawberry Fields. Mr. Kite, along with the rest of the town, is cheered at this fortunate turn of events. B.D., Dougie, and\nLucy are pleased at their business cunning in exploiting the situation for financial gain. Dougie and Lucy go into City Hall, where the day's proceeds are stored and load up a wheelbarrow with several bags of money. They transfer the money into the van's refrigerator as Earth, Wind and Fire perform the evening show for the town, Billy and the\nHendersons enjoy front-row seats. Mr. Mustard and the Brute get to town and find the\nvan. They kidnap Strawberry and drag her into the van, then drive off. Dougie and Lucy manage to hide in the van without being discovered. The band sees the departing van and sets off in hot pursuit via the town's hot air balloon.Mustard was headed for FVB Central with the recovered instruments where the evil genius would suppress the magical instruments and make the world safe for his legions. Unless the band could arrive first and stop them. Mustard, who has admired\nStrawberry all along, attempts to woo her via serenade in her bound-and-gagged state.\nSoon, the balloon comes into view, and Dougie and Lucy try to escape the van with some of their lot., They are discovered and led into FVB Central along with Strawberry,\nthen tied up and forced to endure a performance by FVB - Future Villain Band\n(Aerosmith). Billy and the Hendersons break into the complex and wrestle FVB into submission, killing the evil genius (Steve Tyler). Unfortunately, Strawberry falls to her\ndeath in the struggle.Back in Heartland, the cleaned-up town mourns the loss of Strawberry Fields, who lies in state in a coffin of clear glass engraved with Heartland's signature hearts. Billy, Dougie, and the Hendersons are all pallbearers. Mr. Kite questions whether it was worth the loss\nin order to restore the town. Leaving the church after her service, Billy sadly walks off for\nsome time alone, remembering the good times he shared with Strawberry. He then attempts suicide by jumping from a rooftop. As he falls, the Heartland Weather Vane (Billy Preston) comes to life and returns him to the rooftop. Billy Shears is not only saved, but apparently cured of his depression by this surprising turn of events.The Magical Weather Vane then changes Mr. Mustard and the Brute into a bishop and a monk; Dougie and Lucy into an altar boy and a nun. Next, he brings a hale and hearty\nStrawberry Fields back to life. She runs to Billy and they embrace warmly in a fairy tale ending.The townsfolk are joined by dozens of celebrity guests of 1970's fame for a rollicking and joyful finale, in a tribute to the cover of the original Beatles album that inspired the film."
        ],
        "summaries": [
          "A small-town band hits it big, but it must battle a nefarious plot in the music industry.",
          "Ever since they were sent into World War I battle in 1918, Sergeant Pepper and his Lonely Hearts Club Band of Heartland, USA, have been spreading the message of joy and love to the world, which has made the band and Heartland famous. Since Sergeant Pepper's death in 1958, the band's instruments have been housed on display at Heartland City Hall as symbols of that love and joy. Before his death, Sergeant Pepper asked his adolescent grandson Billy Shears to form his own band and in order to continue to spread the message of joy and love. With Billy's brother Dougie Shears as their Manager, Billy, now an adult, and his three best friends, brothers Mark, Dave, and Bob Henderson, embark on their lives as a new Lonely Hearts Club Band. The band quickly comes to the attention of Hollywood music producer B.D. Hoffler Of B.D. (Big Deal) Records. With the boys off to Hollywood to spread the words of joy and love to the world, enter into Heartland the evil and demented Mr. Mustard, an ex-real estate agent who wants to take over Heartland by destroying what made it famous. To do so, he plans to steal the instruments in city hall and promote the music of the F.V.B. (Future Villain Band) in place of the Lonely Hearts Club Band. With Billy's hometown girlfriend Strawberry Fields at their sides, the boys try to thwart Mustard's dastardly plan at their own peril while still trying to spread their own message of love and joy to the world.",
          "A small-town band makes it big, but loses track of its roots, as the band gets caught up into the big-time machinations of the music biz. Now, the band must thwart a plot to destroy their hometown. Built around the music of the Beatles, this musical uses some big-name groups of the day, such as Earth, Wind, and Fire; Peter Frampton; the Bee Gees; and Aerosmith."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "_C_NAIUBmFo8GYv0bnst",
        "_score": 22.517635,
        "title": "My Fellow Americans",
        "year": 1996,
        "genders": [
          "Adventure",
          "Comedy"
        ],
        "score": 6.5,
        "directors": [
          "Peter Segal"
        ],
        "writers": [
          "E. Jack Kaplan",
          "Richard Chapman",
          "Peter Tolan"
        ],
        "synopsis": [],
        "summaries": [
          "Two former U. S. Presidents, hated rivals, join forces to expose the current, corrupt President at the risk of their lives.",
          "Kramer and Douglas, two former presidents from opposite ends of the political spectrum, become reluctant allies when they become the target of a conspirator in President Haney's administration. The two ex-presidents realize they have an enemy within the government and set out to find evidence that will clear their names. The search takes them across the Southern Appalachians; along the way they meet a homeless couple, thwart kidnapers in the parking lot of a fast-food restaurant, and find themselves marching in a gay pride parade.",
          "They used to run the country. Now they're running for their lives! Two on-the-lam former Presidents of the United States. Framed in a scandal by the current President and pursued by armed agents, the two squabbling political foes plunge into a desperately frantic search for the evidence that will establish their innocence. As the scramble through the real America, they get an unexpected crash course in how their policies affected the citizens."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "PC_NAIUBmFo8GYv0bnQr",
        "_score": 19.751068,
        "title": "Uno contro l'altro, praticamente amici",
        "year": 1981,
        "genders": [
          "Comedy"
        ],
        "score": 6,
        "directors": [
          "Bruno Corbucci"
        ],
        "writers": [
          "Mario Amendola",
          "Bruno Corbucci"
        ],
        "synopsis": [],
        "summaries": [
          "An industrialist wants to corrupt a politician in Rome and here he meets Er Monnezza. The thief will help the entrepreneur to recover the stolen goods."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ey_NAIUBmFo8GYv0bnMr",
        "_score": 18.482746,
        "title": "The Wild Geese",
        "year": 1978,
        "genders": [
          "Action",
          "Adventure",
          "Drama"
        ],
        "score": 6.8,
        "directors": [
          "Andrew V. McLaglen"
        ],
        "writers": [
          "Reginald Rose",
          "Daniel Carney"
        ],
        "synopsis": [
          "Colonel Allen Faulkner (Richard Burton), a middle-aged British mercenary and former Royal Army officer, arrives in London from Switzerland to meet the rich and ruthless merchant banker Sir Edward Matherson (Stewart Granger) at his West London row-house. The latter proposes an operation to rescue Julius Limbani (Winston Ntshona), imprisoned former leader of the fictitious central African country of Zembalia, who is due to be killed by the military dictator who overthrew him. Limbani, whose people believe he is already dead, is being held in a remote prison, guarded by ferocious African troops known as the \"Simbas\", under General Ndofa.Faulkner provisionally accepts the assignment and sets about recruiting his officers, all of whom have worked with him on previous African operations. They comprise:Lt. Shaun Fynn (Roger Moore) is a former RAF pilot. He is working as a currency smuggler, but when he realizes that he's actually running drugs, he kills the mafia drug dealer and consequently has a death contract placed in his head. Matherson forces the crime boss to lift the contract at the last moment.Lt. Pieter Coetzee (Hardy Krüger), is a South African mercenary who only wants to return to his homeland and buy a farm, but can barely afford to pay his rent in London.Captain Rafer Janders (Richard Harris) is hired as an experienced mission planner. He initially refuses the job, as he's making some money as an art dealer and is planning a Christmas vacation with his son, Emile. But Faulkner persuades Janders to join the mission as the tactician.Retired R.S.M (Regimental Sergeant Major) Sandy Young (Jack Watson), is asked by Faulkner to serve as drill sergeant to train the troops and assist in recruitment. He is very willing, but his wife strongly disapproves.With the tacit approval and support of the British government, the 50 soldiers are transported to an unspecified African location, equipped and mercilessly trained by Young. The day before the mission is to begin, Janders exacts a promise from Faulkner to watch over his son Emile, and take care of him should Janders die on the mission. Faulkner agrees.The 50-man mercenary group are transported by plane and parachuted into the African country near Zembala Prison on Christmas Day. Coetzee uses a powerful crossbow with cyanide-tipped quarrels to take out the prison sentries. The rest of the guards are killed silently with cyanide gas. They rescue Limbani, but he is clearly a sick man and is later hit by crossfire during the battle. All of the Simba guards, along with one Cuban Army officer and advisor, are killed in the battle. The group, suffering no casualties, then commandeers several jeeps and other military vehicles from the prison and makes its way to a small airfield to await pickup.But backers of the project, led by Matherson, reach an agreement with the Zembalese government concerning valuable copper mining concessions, and the airplane due to collect them is recalled at the last minute.From this point onward, the abandoned mercenaries are forced to fight their way through hostile territory, pursued by the Simbas. It is also revealed here that Cuban, Soviet and East German army officers are training and advising the Simbas on their fighting skills and giving them orders to take out all of the foreign mercs.Meanwhile, the relationship between Limbani and Coetzee develops from initial animosity: \"I bleed red like you, white man; don't call me kaffir\" to one of understanding, as Coetzee comes to understand and appreciate Limbani's struggle, and realizes that white and black must work together.As they make their way south, heading for Limbani's home tribal land, they approach an old rickety wooden bridge. Only the first few vehicles make it across, when they come under aerial attack by a Simba fighter bomber aircraft that drops napalm. The bridge collapses under the weight of a fuel tanker, leaving the last jeep stranded on the northern river bank. In that jeep is Limbani, Coetzee, and medical orderly Arthur Whity (Kenneth Griffith).The mercenaries separate into two groups to continue to make their way to Limbani's home village, where they intend to provoke a revolution. However, most of the allied rebels are too ill-equipped and weak to fight. During all of this, Faulkner is forced to kill his own men who are gravely injured by the airstrike. Coetzee observes, \"we can't leave them to the Simbas\", whom will torture them to death.Coetzee is then killed while saving Limbani from a Simba ambush, leaving another soldier, a young Nigerian named Sgt. Jesse Link (John Kani), to carry Limbani. Witty is killed by machete-armed Simbas while trying to fend off another ambush, allowing the rest of the platoon to escape. Faulkner is reunited with the rest of the remaining 32 mercenaries at Limbani's village where an Irish missionary, named Father Geoghegen (Frank Finley), alerts them to the presence of an aging transport plane, a Douglas C-47 Skytrain aka \"Dakota\" at an old runway to provide for their escape.At the airfield, the mercs make their last stand in a climatic battle. As the masses of Simba troops attack, the group guns down dozens of attacking Simbas, while transporting the wounded Limbani on a stretcher to the plane, but many mercs are killed in the fierce battle, including the teenage soldier Esposito (Glyn Baker). Sandy Young is killed while he is running with Faulkner to board the airplane. Faulkner makes it on board, along with the tough gung-ho merc Tosh Donaldson (Ian Yule). Jesse Link also manages to safely get on board with several mercenaries carrying Limbani. While in the cockpit reading the plane for takeoff, Fynn is shot in his left leg, but manages to keep the plane moving. The last remaining mercs, including a wounded Jock McTaggart (Ronald Fraser), manage to board, but Janders is badly wounded after getting shot in his left side and can't get onto the moving plane; he implores Faulkner to shoot him as he is running down the runway with mobs of Simba troops in chase right behind him. Faulkner cannot bear to shoot his friend, but there is no hope. As Janders cries out his son's name: \"Emile! Emile!\", Faulkner reluctantly shoots and kills him just as the plane takes off.The plane with the wounded Limbani and the surviving mercenaries, numbering only 13 men out of the original 50, is initially refused landing permission in nearby Rhodesia, but after they provide proof that Limbani is aboard, they are given permission to land at Kariba. But by the time they land, virtually out of fuel, Limbani has died of his wounds. Flynn passes out, wounded but still alive despite blood loss. Seeing that Limbani has died, Faulkner regards the whole mission a failure.Three months later, having managed to return to London, Faulkner breaks into Sir Edward's residence, holds him at gunpoint and takes half of the originally agreed payment from his safe. He then kills him. Faulkner and Flynn make a quick getaway.In the final scene, Faulkner fulfills his promise to Janders; he visits Emile at his boarding school. Faulkner offers to tell Emile about his father."
        ],
        "summaries": [
          "A British banker hires a group of British mercenaries to rescue a deposed African President from the hands of a corrupt African dictator.",
          "A British multinational seeks to overthrow a vicious dictator in central Africa. It hires a band of (largely aged) mercenaries in London and sends them in to save the virtuous but imprisoned opposition leader.",
          "Amidst violent political turmoil in central Africa, the nefarious London merchant banker named Sir Edward Matheson hires a loyal band of seasoned middle-aged mercenaries led by the fearless Colonel Allen Faulkner, to rescue the deposed African President, Julius Limbani. With Limbani imprisoned and presumed dead by his followers, the determined Colonel along with a small army of hand-picked paratroops parachute into the hostile Zembala to fight for the wounded leader's freedom, unaware that there has been a change of plans behind their backs. Can Faulkner's men make their escape from the sun-roasted wasteland with General Ndofa's vicious Simbas after them?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Ki_NAIUBmFo8GYv0boAv",
        "_score": 18.475248,
        "title": "Hannibal",
        "year": 2001,
        "genders": [
          "Crime",
          "Drama",
          "Thriller"
        ],
        "score": 6.8,
        "directors": [
          "Ridley Scott"
        ],
        "writers": [
          "Thomas Harris",
          "David Mamet",
          "Steven Zaillian"
        ],
        "synopsis": [
          "The story opens 10 years after the events depicted in The Silence of the Lambs (1991). Barney, one of Hannibal Lecter's minders at the Baltimore mental hospital, talks to a disfigured and paraplegic man, Mason Verger (Gary Oldman), about the conversations Barney had with Lecter and Lecter's relationship with Clarice Starling. Barney then shows Verger a boxed object he's brought with him: the leather restraining mask used to cover Lecter's face when he was being transported. Barney asks for a price of $250,000 for it and Verger eagerly accepts.FBI agent Clarice Starling (Julianne Moore) is in Washington DC, leading a raid to arrest an HIV-positive drug dealer named Evelda Drumgo (Hazelle Goodman). Though Starling has laid out precise plans to the arresting team, the raid is horrifically botched when one of the agents rushes Drumgo and her gang after Starling orders them to stand down because Drumgo is carrying an infant. A massive gunfight breaks out and most of Drumgo's gang are killed, along with a few of the agents. When Clarice orders Drumgo to surrender, Drumgo whips out a machine pistol and opens fire, hitting Clarice. Clarice responds reflexively and shoots and kills Drumgo, splattering the infant with her blood. Clarice, who had been wearing a bulletproof vest, recovers the child and washes it off with a nearby hose. Starling is disgraced by Justice Department official Paul Krendler (Ray Liotta), whose romantic advances Starling had rejected years earlier.As a result of the publicity surrounding the drug raid, Starling and her past connection to escaped serial killer Hannibal Lecter (Anthony Hopkins) come to the attention of one of Lecter's victims, Mason Verger, who is also a wealthy, sadistic pedophile. Verger, who was left horrifically disfigured and paralyzed by a past encounter with Lecter himself, still seeks revenge for what occurred. He uses his political influence to have Starling assigned to the Lecter case once again in the hope that this will draw Lecter out of hiding.Verger claims to have new information about Lecter (an X-ray), which he is willing to disclose only to Starling, and she is sent to his estate to collect it and interview him. Upon her arrival, Verger tells Starling about his history with Lecter. They met when Lecter was assigned by a court as Verger's therapist after Verger's conviction on multiple counts of child molestation. Verger, the only one of Lecter's victims to survive, was tricked into mutilating himself by Lecter after being given a nitrogen \"popper\". In the same incident, Verger was also persuaded by Lecter into sexual excitation by strangulation. Verger is now bedridden and confined to his secluded mansion, but with the assistance of his personal physician Cordell (Zeljko Ivanek) and other minions, he is pursuing an elaborate scheme to capture, torture and kill Lecter.In Florence, Italy, Chief Inspector Rinaldo Pazzi (Giancarlo Giannini) of the Questura is investigating the disappearance of the curator of the Capponi Library, a Renaissance palace that serves as a repository of rare books, historical documents and art treasures. In the course of his investigation, Pazzi meets the new curator: \"Dr. Fell,\" who is actually Hannibal Lecter.As Verger surmised, Lecter soon learns of Starling's public disgrace and reassignment to his case, and he sends her a letter that is at once sympathetic and mocking. The letter contains no apparent clue to Lecter's whereabouts, but Starling detects a strange fragrance on it. She takes it to a perfume company, where the experts inform her that the writer used a very expensive skin cream that could have been sold in only a few shops in the world, one of which is in Florence.Starling contacts the police departments of the cities where the shops are located, including Pazzi's department, asking for copies of any surveillance tapes made by cameras installed in the shops. When Pazzi sees one of his men making a copy of such a tape for Starling, he recognizes \"Fell\" in the tape and decides to find out why the FBI is interested in him. Pazzi accesses the FBI's database of fugitive criminals and learns that \"Fell\" is Hannibal Lecter. He also learns that Verger is offering a reward of $3 million to anyone who assists him in capturing Lecter in lieu of turning him over to the FBI (who offer a $250,000 reward). Hoping to collect the larger bounty, Pazzi makes contact with Verger's people and agrees to help them kidnap Lecter. Starling, meanwhile, has received the surveillance tape from Florence, has recognized Lecter, and has learned that Pazzi has been using the FBI's database to check on Lecter. She calls Pazzi and warns him against trying to capture Lecter himself, but Pazzi ignores her warning.Pazzi coerces a local pickpocket into wearing a cheap bracelet and attempting to rob Lecter. The pickpocket follows Lecter through the streets of Florence. When he reaches for Lecter's wallet, Lecter grabs him by the wrist (and the bracelet, leaving behind fingerprints) and slyly stabs the man in the upper leg, severing his femoral artery. Pazzi finds the thief and takes the bracelet from him, leaving him to bleed to death on the street. Pazzi sends the bracelet with Lecter's prints to Verger who has them confirmed as Lecter's.Pazzi and Verger's men try to kidnap Lecter after his scheduled evening lecture on the poetry of Dante to a group of scholars at the Palazzo Vecchio, but their plan goes badly awry. Lecter subdues Pazzi with a drug-soaked rag and interrogates him, forcing him to answer several questions by threatening to kill and eat Pazzi's wife. Lecter murders Pazzi by first slashing open the man's abdomen and then throwing him off an upper floor balcony with a noose around his neck, his entrails falling from his abdomen to the street -- the same fate of one of Pazzi's ancient ancestors. Lecter escapes, deciding to return to the United States to renew his acquaintance with Starling.Frustrated by the failed attempt to kidnap Lecter, Verger tries to draw him out of hiding once again by getting Starling into more trouble. He bribes Krendler to accuse her of withholding a note she received from Lecter. The ploy works, and Starling is suspended from duty. Verger's men keep her under surveillance in the hope that Lecter will contact her. Lecter, meanwhile, has been watching her and also watching Krendler. Lecter then buys china and crystal for an elaborate meal and also steals surgical equipment from a hospital. He takes everything to a secluded lakefront house that he has learned belongs to Krendler.Lecter then contacts Starling, luring her to Washington's Union Station for a meeting. Verger's men follow her there. As Starling looks for Lecter among the crowd of travelers and shoppers at the station, she and Lecter converse by cell phone. He expresses his admiration for her and his sympathy for the shabby treatment she has received from the FBI, at one point suggesting that he might force the people who have disrespected her to \"scream apologies.\"Having spotted Lecter, Verger's men capture him in the station's parking lot despite Starling's efforts to stop them. Starling makes a fruitless attempt to expose Verger's scheme to the FBI. Meanwhile, Verger's men transport Lecter to the Verger estate. Verger plans to watch Lecter being eaten alive by a herd of vicious wild boars that Verger, an expert at swine breeding from his days in the family meatpacking business, has prepared in Italy especially for the purpose. The boars have been conditioned to attack their victim when they scream.When the FBI refuses to act on her report that Verger has kidnapped Lecter, Starling goes alone to Verger's estate. She intervenes as Verger's henchmen are about to unleash the pigs on Lecter, shooting the men and freeing him, but she is shot and wounded in the shoulder. Lecter then rescues her from the animals. When a furious Verger orders his physician Cordell to shoot Lecter, Lecter persuades Cordell (who has always hated his master) to throw Verger into the pen with the hogs instead, and Verger dies in the very manner in which he had hoped to kill Lecter, Lecter having assured Cordell he will take the blame for the deed.Lecter takes Starling to Krendler's lakefront house and treats her bullet wound. She awakens in an upstairs bedroom, dressed for a formal occasion. On her way downstairs, she finds a phone and calls the police. Instead of taking their advice and leaving the house to wait for their arrival, she looks for Lecter downstairs. She finds him in the dining room where he has set the table as if for an elegant dinner party, watched by the seated Krendler, who has been heavily drugged and his head shaved. As Starling looks on, horrified, Lecter removes the top of Krendler's skull, cuts out part of his brain (the part that Lecter says is \"associated with good manners\"), sauteés it in a pan by the table, and feeds it to the dazed Krendler. Clarice is horrified, pleading with Lecter to stop and saying she'll give him the details of the FBI's profile on him so he can escape.When Lecter wheels Krendler back to the kitchen to clear up after the \"meal,\" Starling attacks him with a silver candlestick but is easily overpowered. Lecter traps her ponytailed hair in the fridge. He asks her, \"Tell me Clarice, would you ever say to me, 'Stop ... if you loved me, you'd stop'?\" To which Starling replies, \"Not in a thousand years.\" Lecter replies with, \"That's my girl,\" then kisses Starling. Just as he is about to leave, thinking he's won, he hears a click and sees that Starling has handcuffed his wrist to her own. When she refuses to provide the key, Lecter pins her wrist to a table and brandishes a meat cleaver. He raises it and says, \"This is really going to hurt.\" and swings it down -- a noticeable look of pain appears on Clarice's face. Next we see Starling outside the house, looking for Lecter, who escaped just before the police cars arrived. Both her hands are intact and she identifies herself to the police.The last scene is of Lecter on an airplane, one of his arms is in a sling and his hand not visible. He is preparing to eat the boxed meal he has brought with him, and the small boy sitting next to him asks about the food. Lecter opens the container to reveal several kinds of food, among which is what appears to be part of Krendler's brain, cooked and sliced. The boy asks to try some of the food, and Lecter allows him to, after saying that his mother always told him to try new things. It is not shown if the boy chooses the brain."
        ],
        "summaries": [
          "Living in exile, Dr. Hannibal Lecter tries to reconnect with now disgraced F.B.I. Agent Clarice Starling, and finds himself a target for revenge from a powerful victim.",
          "The final chapter of the Dr. Hannibal Lecter quadrilogy, the murdering cannibal. He is presently in Italy, and works as a curator at a museum. Clarice Starling (Julianne Moore), the F.B.I. Agent who he aided to apprehend a serial killer, was placed in charge of an operation, but when one of her men botches it, she's called to the mat by the Bureau. One high ranking official, Paul Krendler (Ray Liotta) has it in for her. But she gets a reprieve because Mason Verger (Gary Oldman), one of Lecter's victims who is looking to get back at Lecter for what Lecter did to him, wants to use Starling to lure him out. When Lecter sends her a note, she learns that he's in Italy, so she asks the Police to keep an eye out for him. But a corrupt Policeman, who wants to get the reward that Verger placed on him, tells Verger where he is, but they fail to get him. Later, Verger decides to frame Starling, which makes Lecter return to the U.S., and the race to get Lecter begins.",
          "Hiding behind a pseudonym, the sophisticated cannibal and methodical serial killer, Dr Hannibal Lecter, finds himself somewhere in Florence to pick up where he left off, ten whole years after the events of The Silence of the Lambs (1991). However, as Clarice Starling is falling from grace, a disfigured benefactor and sole survivor of Lecter's atrocities brings her back on the case, intent on ferreting out the brilliant doctor. Now, the stage seems set for the perfect retribution scheme, as greed and ambition get the best of everyone involved in the hunt for the elusive virtuoso of death. But, do they have what it takes to kill Hannibal, the beast among men?",
          "Part four in the Dr. Hannibal Lecter quadrilogy. Having escaped the asylum in The Silence of the Lambs (1991), Dr. Hannibal Lecter (Sir Anthony Hopkins) goes into hiding in Florence, Italy. Back in America, Mason Verger (Gary Oldman), an old victim of the doctor, seeks revenge. Disfigured and confined to a life-support system, he plans to draw Lecter out of his hiding place, using the one thing for whom Lecter truly cares: Clarice Starling (Julianne Moore).",
          "After having successfully eluded the authorities for years, Dr. Hannibal Lecter (Sir Anthony Hopkins) peacefully lives in Italy in disguise as an art scholar. Trouble strikes again when he is discovered leaving a deserving few dead in the process. He returns back to America to once again make contact with now disgraced Agent Clarice Starling (Julianne Moore), who is suffering the wrath of a malicious F.B.I. official and rival, as well as the media. Meanwhile, Dr. Hannibal Lecter must survive the advances by disfigured and vengeful victim Mason Verger (Gary Oldman), with whom he first came in contact years ago as a patient. He finds himself being tracked down not only by his wealthy victim and his henchmen, but also by Agent Starling and the American authorities."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "mi_NAIUBmFo8GYv0bn4u",
        "_score": 16.595718,
        "title": "Nowhere in Africa",
        "year": 2001,
        "genders": [
          "Biography",
          "Drama",
          "History"
        ],
        "score": 7.5,
        "directors": [
          "Caroline Link"
        ],
        "writers": [
          "Caroline Link",
          "Stefanie Zweig"
        ],
        "synopsis": [
          "The film begins in Africa, a picture of a boy riding his bicycle through the open plains carrying a note of great significance to the main characters. A once prominent Jewish family has been torn apart by the promise of war in their homeland. WWII is on the verge of breaking out across Europe and the Nazi party's stranglehold is tightening around Germany's neck. Cut to an icy glade in Germany where many children are sledding and playing in the snow. A mother and daughter are sledding together down a snowcapped hill; Regina, afraid of her own shadow and even little dogs, and her mother Jettel, an ambitious socialite. Still in Germany after Walter, a former lawyer (Regina's father/Jettel's husband) has fled to a farm in Kenya where he is working as the foreman but has caught malaria, Regina and Jettel are still living a life of comfort until they receive a letter from Walter. The letter beckons them to come to Kenya where the Nairoibi population of Jewish citizens has agreed to pay their fare into the country. In his letter, Walter begs Jettel to bring an icebox, mosquito netting and to leave the China at home as it will be no use in their new home. Max, Walter's father, wishes the family well but does not wish to accompany them as he feels that everything will be okay within a year or two.Cut back to Kenya where Walter is still sick with malaria, the farm's African cook Ouwour dismisses the normal Quinine treatment prescribed by Süsskind, a German expatriate and family friend, in favor of an African herbal treatment and miraculously Walter is healed. Upon being healed, a bond is formed between Walter and Ouwour when Walter gives his former judicial robes to Ouwour for curing him, stating that \"he no longer needs the robe, he was a lawyer in his first life; he needs to think with his braun, not with his brain now.Six months later, Regina and Jettel arrive in Rongai, Kenya with Walter. Walter recognizes immediately that Jettel has no desire to think of Africa as her new home and views it only as a stop in their lives as opposed to a second life. Regina on the other hand immediately forms a bond with Ouwour and begins to adapt to life in Kenya, befriending the local children and exploring her surroundings. Pan shortly into the future and Regina is becoming an independent child, no longer afraid of snow and small dogs. Süsskind comes to deliver supplies and stay with the family; Jettel naively asks how long he has been away from home, to which he replies \"this is my home.\" This is a sense of awakening for Jettel who until now has perceived their rickety farmhouse as only a place to stay. That night Walter and Jettel get into an argument because she had foolishly packed the china and finer goods and left the more important goods, pertinent to their surroundings, at home because she simply refused to let go of their former pampered lifestyle. With no other real companion than Ourwour, Regina begins to learn the lay of the land and the day to day of African life from him whereas Jettel still looks at him as almost a slave. She asks for his help to gather water in one scene, to which he replies that it is womans work yet she persists. He is mercilessly teased by the African women at the waterhole because he allows his ties to the family to outweigh tradition.Six months later, still on the farm, Jettel is still unhappy with their lack of plush surroundings and complains that she needs meat and is tired of eating \"slop.\" This bothers Walter who reluctantly and in anger informs her that they escaped Germany in the nick of time; the Nazi's had raided Jewish residences, businesses and synagogues and had sacked them all. Jettel finally begins to realize that Walter might have been right all along in his assessment that they had to leave Germany and that the Nazi's looked at the Jews as subhuman. On Nov. 10, 1938, Walter writes his father a letter begging him to leave and bring the family to Kenya before it is too late. Walter has realized that his parents are some of the most important people in his life because they were always there for him and now he wants to be there for his family, to provide the way his parents did. Meanwhile, Jettle still has biases against the black population and thinks they are dirty, warning Regina against anything unusual they might try to make her eat or do. Regina, already stubborn and curious, sets off to do just that.Fast forward a little and Jettle starts to realize Ouwour is more than a slave, that he is a smart individual. Six months after that, Regina and her father are loving their \"second life\" while Jettel is slowly coming to realize what life as an Afrcan is like. Shortly after Walter and Regina and Jettel begin to really adjust, war fully breaks out between the British and Nazi Germany and all Germans living in British holdings, including Jews, are imprisoned in internment camps. Walter goes to one, Jettel and Regina to another, Regina making Ouwour swear he will find them when they get out. For Walter it is a sad and lonely time where he questions whether two people are truly meant to be together for their whole lives. For Jettel it is a retreat back into civilization as the women are put up in a 5 star resort and pampered because the British cannot find other holdings for them. Though back in a pampered environment, Jettel realizes that Regina needs a stable home, even though she is flourishing still and learning English to boot, and that although Jettel prefers a life of luxury, she must be there to support her husband in his wishes. When the Jewish women of the camp begin to organize a drive to allow their husbands to be released, Jettel goes along with them and writes a letter to the Jewish community to help organize their release. Meanwhile, Walter begins to question why Germany would turn its back on them and becomes embittered against the Nazi regime. Once their release is organized, it is reliant upon the men of the family having a job to go back to. Because Walter has been terminated from his job as farm steward he cannot be released. Jettel arranges for a special visit to the Jewish community leader in Nairobi to ask for help yet she cannot arrange it. Upon learning of her wishes, a British soldier who speaks German and has had his eye on Jettel proposes that he can help arrange a job for Walter through some of his contacts but it comes at a cost; Jettel must sleep with him. With her marriage on the rocks and she wishing for her family's protection she willingly agrees. A job on a new farm in, Kenya is arranged and the family moves there. Once again, Regina flourishes in her African surroundings, absorbing culture and life as easily as if she were a native. However, Walter and Jettel have problems as he begins to suspect Jettel may have been unfaithful in order to provide his release. This, accompanied with his embitterment towards Germany lead him down a further path of despair and desolation towards his country. Finally accepting her life as woman of the farm, Jettel begins to enjoy her African surroundings and day to day life that comes with it.On October 2, 1940, the family receives word from his father that it is impossible for them to emigrate now and that he is afraid for his and his family's well-being. This is a major blow to Walter and he begins to resent Hitler and his regime to a point of no return. Shortly after, Owour miraculously finds the family on their new farm and once again restores a sense of order to them. Through his teachings, Regina truly befriends the village children and starts to become immersed in the culture. While Jettel does not mind, she begins to reinstate her wishes that Regina attend school and learn a proper education. Six months later, Regina begins to attend a British ran school where, although she is not exiled, she quickly becomes aware of how Jewish means different to others: no prayer participation, different rules, and somewhat of an unease coming from the other children. Although it is different, Regina thrives in her schoolwork, mainly due to her drive to achieve despite being different.While she is gone, Walter and Jettel struggle to find themselves back in love. Once again the question of love for life is brought up and although neither of them agree that they want to be with each other, they seem to recognize that they need each other even if it is only for one anothers sake. They reach out to each other in a philosophical form more than a loving form but it seems to keep them together. Regina visits sporadically and still fits right into the African culture of the village despite her preening at the British academy. Meanwhile, Jettel is settling more firmly into her role as woman-ward of the farm, taking more part in the day to day running of the farm. It is during one of Regina's visits that the family receives news that their relatives in Germany are being sent to concentration camps in Poland. Walter tells Jettel that Poland means death yet she is unwilling to accept that at face value even though she knows the truth in his words. While Walter becomes more and more embittered towards his former homeland and begins to want to do something about it, Jettel seems to embrace Africa more and more. At one point she cannot leave an old woman to die alone and a villager explains to her that this is the way of the tribe, to be with the ancestors. This seems to comfort Jettel in that she begins to realize that her family too will be with their ancestors.Months later, Süsskind visits and informs Walter that the British army is allowing Jewish Germans to enlist to fight against the Nazi's. While Jettel doesn't like his decision, she becomes resigned to it and assumes Walter's responsibility as head of the farm with Ouwour's help. Once Walter has left however, Susskind begins to visit the farm more often and plays upon Jettels need for companionship. This goes on for a few months until Walter returns on leave after the Allies landed in Normandy in force, symbolizing the beginning of the end for Nazi Germany. Regina however, aware of her mother's former tryst with the British soldier, is unforgiving toward her friendliness with Süsskind and confronts her. This has two effects on her mother, the first of which is that she recognizes that Regina is becoming a woman and is struggling with her own rites of passage between becoming a woman of the \"civilized\" world and that of the African. The second is a new found respect for her husband and what he has done to keep the family safe and together. While being Jewish, she comes to recognize that faith and ethnicity have nothing to do with the perception of the outside world when they refuse to see you as human; much as she formerly thought of the African people when she first came to the continent from Germany. When Walter returns again on leave, he and Jettel share a passionate night in which they conceive a child. It is on this night that he informs her that their family is dead and that he has been chosen to go back to Germany to start a new western government there. In November of 1946, he receives his commission to go back and must prepare his family for their return. Neither Regina nor Jettel take this news well as they have both immersed themselves in the culture as he once had when he first arrived on the continent. The roles of husband and wife had now been reversed as she was happy finally as the proprietor of their farm instead of missing their former plush life in Germany and with him wishing to return to it.In the end it is Regina, reluctant as she is to return to a land of which all she remembers is fear that is the voice of reason between the two parties. Süsskind is at dinner with them when Walter announces his decision that they will return to Germany, Süsskind, the first to embrace Africa as his home cannot understand Walter's welcoming readiness to embrace Germany as his country once again, angering Walter. Jettel wants to stay at the farm and continue their life as framers while Walter wants to return to Germany and build a new, non-corrupt political system. They fight and he begins to leave back to the military base when a huge swarm of locusts come to the farm and threaten the entire crop. As he is leaving he sees the entire village go out to protect the crop and he remembers Regina's last words to him, \"mother needs you.\" He joins the fight against the locusts and when Jettel sees this it seems to rekindle the flame between them, she thinking he'd already made up his mind to leave. While he is still torn between love for country and love for family, Walter tells Jettel that he cannot and will not leave without her. She leaves the decision in his hands resigning herself to the love of her life over the love of her new country. When preparing to leave, Walter finds Ouwour preparing for a journey of his own, a long safari he must go on in order to keep from dying of heartbreak, so deep is his love for this family that has come to cherish his country. Walter finds the robe he gave him upon first meeting and tells him he has forgotten it. Ouwour responds that he has not forgotten it, it was never his to forget as Walter had told him that he didn't need it in his new life. Ouwour calmly informs Walter that he is returning back to his first life and leaving his second, so he will probably need the robe again. The family boards a train to return to Germany, thus coming full circle in their journey for a new life and having found it, being able to return eventually to their old one. However, this time, the return to their old life came with a new member of the family; a son was born on June 6, 1947, thus representing a new chapter to an old way of life. A tale of a complicated and complex journey of people searching for their own purpose and meaning in life and finally, in a roundabout way, finding it.In this movie appears Juliane Köhler who will later play the role of Clara, Fritz Shimon Haber's wife in Haber (2008)."
        ],
        "summaries": [
          "A German Jewish refugee family moves to and adjusts to a farm life in 1930s Kenya.",
          "A Jewish family in Germany emigrate short before the Second World War. They move to Kenya to start running a farm, but not all members of the family come to an arrangement with their new life. Shortly after their departure, things are changing in Germany very quickly, and a turning back seems impossible. So everyone has to arrange himself with the new life in a new continent.",
          "In 1937, the non-orthodox Jewish German lawyer Walter Redlich, aware of the growing of the Nazi movement in Germany and how it would jeopardize the Jews in his country, moves alone to Nairobi, Kenya, to administrate a farm. His only friend is the also Jewish German Süßkind and his African cooker Owuor. In 1938, his spoiled wife Jettel Redlich and their young daughter Regina arrive. Regine easily adapts to her new lifestyle, but Jettel does not adapt to her new condition of poor expatriated woman in Africa. Along the years, bursts the Second World War, and the Redlich family experiences the most different situations until 1947."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "qC_NAIUBmFo8GYv0bmke",
        "_score": 16.496954,
        "title": "His Girl Friday",
        "year": 1940,
        "genders": [
          "Comedy",
          "Drama",
          "Romance"
        ],
        "score": 7.8,
        "directors": [
          "Howard Hawks"
        ],
        "writers": [
          "Charles Lederer",
          "Ben Hecht",
          "Charles MacArthur"
        ],
        "synopsis": [
          "PART ONE OF TWO:\nNewspaper reporter Hildy Johnson (Rosalind Russell) visits her former workplace, the busy office of New York City's Morning Post. She's there to tell her former boss, editor Walter Burns (Cary Grant) -- who's also her former husband -- that he needs to stop sending her letters and telegrams, and that she won't be coming back to work because she's getting married again.While she's in Walter's office, City Editor Duffy (Frank Orth) comes in to tell Walter that the governor hasn't signed the expected reprieve for a murderer, so the man will be executed in the morning. This will apparently make the paper look bad, so Walter tells Duffy to call the governor and push for the reprieve, offering in exchange the Morning Post's endorsement when the governor makes his expected run for the senate. Then Walter gets a call about the reporter who's supposed to be covering the murderer -- he's unavailable -- so Walter tries to convince Hildy to write one last story. She's having none of it. Her wedding is tomorrow, which comes as a shock to Walter, who claims he wants to remarry Hildy himself.Walter spends the rest of the movie, which all takes place in one day, trying to lure Hildy back into the life they shared. It's not immediately clear why Hildy would be interested; though they have an obvious connection and Walter does seem fond of her, he omits the courtesies most men paid to women in 1940: he doesn't light Hildy's cigarette, take off his hat in her presence, or hold the door for her. He insinuates himself into her lunch date with her fiancé, Bruce Baldwin (Ralph Bellamy), where he learns that Hildy and Bruce plan to live in Albany with Bruce's mother, and that the three of them are taking the 4 o'clock train to Albany.Hildy, Bruce, and Walter discuss the murder case over lunch. The policeman who was murdered was \"colored,\" which makes the case politically tricky for the sheriff and the mayor. Apparently they need the colored vote to win the upcoming election, and they don't think they'll get it if they don't execute the murderer. Walter gets Hildy excited about how to present the story to sway public opinion. Bruce says they can take the 6 o'clock train if she wants to do one last interview. Hildy backs off, but Walter goes to work on Bruce:\"You argue with her! Otherwise you're going on a honeymoon with blood on your hands. How can you have any happiness after that?\" Walter proposes a deal: he'll buy a life insurance policy from Bruce (Hildy bids him up from $25,000 to $100,000) if Hildy writes a story on Earl Williams, the murderer. Hildy and Bruce accept. Bruce and Walter go back to Walter's office, where Bruce will have a doctor examine Walter to make sure he qualifies for the policy, while Hildy heads for the criminal courts building where Williams is being held. First, she makes Bruce hand over the cash he's carrying -- $500, \"all we have in the world\" -- because she's afraid Walter will somehow swindle him out of it or lure him into a craps game or something.The press room at the criminal courts building, where much of the movie takes place, is full of reporters -- Murphy (Porter Hall), Roy V. Bensinger (Ernest Truex), Endicott (Cliff Edwards), McCue (Roscoe Karns), Wilson (Frank Jenks), and Sanders (Regis Toomey). Some of the newsmen are playing poker while others work the phones. A couple are calling in updates to the Earl Williams story. One concerns the \"alienist\" -- a psychiatrist or psychologist -- who's due to see Williams that afternoon (The law requires that an alienist interview Williams and declare him of sound mind before he can be executed). There's a full range of political opinion represented in the room and not much love lost among them, but when Hildy walks in, it's clear she's well liked -- all the reporters are delighted to see her. When she tells them she's moving to Albany and getting married, they all laugh at the idea of Hildy singing lullabies.In Walter's office, the doctor pronounces him fit and when Bruce asks who should be the beneficiary of the policy, Walter names Hildy. Bruce isn't too happy about that -- \"I feel I should take care of her\" -- but Walter says this is a debt of honor for him, because he was such a bad husband and because he wants to make sure she's provided for in her old age. Duffy comes in with a certified check for $2500 to pay for the policy and Walter puts Bruce on the phone to Hildy, who advises him to put the check in the lining of his hat (she's afraid Walter will swipe it back). As Bruce is leaving, Walter points him out to Louie Peluso (Abner Biberman), an ostensibly reformed criminal who's been hanging around the office. Walter and Louie seem to have some kind of understanding.Back at the courts building, Hildy scores an interview with the condemned man. The warden, Cooley (Pat West), tells her the sheriff says no more interviews, but she bribes Cooley to let her in ($20) and promises she won't be long.Earl Williams (John Qualen) tells Hildy he couldn't plead insanity because he's \"just as sane as anybody else\" -- but he didn't mean to shoot the policeman he was convicted of killing. Hildy asks him about the enthusiasts in the park who make speeches on soapboxes; Williams spent time in the park before the killing because he'd lost his job. He remembers a man who talked about production for use: the idea that nothing should be manufactured that isn't useful, and that every object should be used for its intended purpose. And what's a gun for? \"Why, to shoot, of course!\" Hildy convinces Williams that he was thinking about production for use when he fired the gun that killed the policeman. As she leaves, she asks about the roses in Williams' cell; he says they're from Mollie Malloy, whose picture is on the wall. He describes her as beautiful and \"a wonderful person,\" but it's not clear what their relationship is.In the press room, the reporters wonder if Walter will really let Hildy go. \"Remember what he did to Roger Fenton when he wanted to go to Hollywood? Had him thrown in jail for arson!\"\"Forgery,\" says someone else.They're bantering that Hildy's marriage won't last more than six months when Mollie Malloy (Helen Mack) walks in. She's angry about how they've been writing about her (\"I never said I loved Earl Williams and was willing to marry him on the gallows!\"), but they're dismissive and tell her to leave them alone. Hildy comes in during this exchange. Mollie explains that she only met Williams once, the day before the shooting. He was walking around in the rain without a hat or coat, obviously distraught. He told her he'd been fired so she took him to her room to dry off and get warm. The reporters make cruel wisecracks (when she asks about a banging noise outside -- the executioners are testing the gallows -- someone says \"they're fixing up a pain in the neck for your boyfriend!\") and when she shames them, they try to throw her out. Hildy takes Mollie under her wing and they go out together.Once they're gone, the men seem much more dejected about Williams' situation than they were letting on -- maybe they even feel a little sorry about how they treated Mollie. When Hildy comes back, she takes a call from Bruce and rushes out, running into Sheriff Hartwell (Gene Lockhart) as she leaves. The reporters, who don't let their finer feelings interfere with business, ask the sheriff to hang Williams at 5 in the morning instead of 7 so they can get the story into their city edition (He refuses). They also accuse him of reprieving Williams twice so the hanging will occur conveniently just before the election in which Hartwell is running on a law-and-order platform.At the jail, Hildy learns that Bruce was arrested for stealing a watch. His accuser, of course, is Walter's friend Louie, who's known to the police as \"the biggest crook in town.\" After Hildy bails him out, Bruce discovers in the taxi that his wallet is missing (though he still has Walter's check, having followed Hildy's advice to put it in his hat).The reporters in the press room are relishing Hildy's unfinished draft of her Williams interview (\"anybody who can write like that ain't gonna give it up permanent to sew socks for a guy in the insurance business\") when she comes back, having left Bruce waiting in the cab. She calls Walter in a fury to tell him she's tearing up the story she wrote and getting on the train with his check; she won't give him the story because she knows he sent Louie to get Bruce arrested.PART TWO OF TWO\nThe sheriff joins Dr. Eggelhoffer (Edwin Maxwell), the alienist, in his final interview with Earl Williams. In the press room, Hildy is making a flowery farewell speech when she's interrupted by the sound of gunfire outside. All the reporters run to the window and hear from the cops below that Earl Williams has escaped. They scramble for the phones. Hildy can't resist calling the news in to Walter and running after the rest of the press corps to get the story. She spots Warden Cooley in the chaotic jail-yard, chases him down (in high heels!), and tackles him to the ground.In the press room, one reporter calls his office to report that Williams shot his way out of his interview with Eggelhoffer and the sheriff and escaped through a skylight; another reports that a tear bomb went off in the hands of the sheriff's bomb squad, and several deputies (all relatives of the sheriff, who seems to have a nepotism problem) have been hospitalized. The sheriff comes in in time to hear this and huffs indignantly but ineffectually (\"after all I've done for you!\"). Another newsman reports that a cleaning lady was shot in the leg by a deputy. They hear more shots outside. Someone speculates that the sheriff let Williams escape so Williams could vote for him; Hartwell leaves in disgust.Upon hearing further shots, all the reporters leave the press room just as Hildy comes in; she grabs a phone and calls Walter. She tells him with evident delight and in a whisper that she's got an exclusive on how Williams got the gun and escaped. She says she had to give Cooley $450 of Bruce's money to get the story. Walter, smirking, swears he'll reimburse her. On his mother's grave. She points out that his mother's still alive, but gives him the story anyway:Dr. Eggelhoffer decided, as part of his examination, to re-enact the crime. This required a gun, which the sheriff supplied without thinking to remove the bullets first. Williams shot Egglehoffer \"in the classified ad\" and ran off (Eggelhoffer wasn't badly hurt). Hildy demands her $450 again and mentions that Bruce is waiting for her in a cab. Walter turns to Evangeline (Marion Martin), who's chatting with Louie, and sends her to meet Bruce; it's not clear what he expects her to do. Then he asks Louie to take $450 in counterfeit money to Hildy.Soon Hildy takes another call from Bruce, who's been arrested again -- for \"mashing\" Evangeline. Hildy can't bail him out until the money comes from Walter, who isn't answering the phone.The mayor (Clarence Kolb) walks in asking for the sheriff; the reporters try to pry a statement out of him. They throw around rumors about a Red (communist) uprising. Someone says the governor is calling out the militia and quotes the governor blaming the mayor and the sheriff for Williams' escape. The sheriff says they've located Williams and the rifle squad's about to recapture him; the reporters run off to see the fun. The mayor tells the sheriff he's pulling him off the ticket for the upcoming election. He scolds the sheriff for falsely accusing Williams of being a communist sympathizer and says they'll lose 200,000 votes if Williams doesn't hang. A man in a bowler hat comes in looking for Sheriff Hartwell; he's a messenger from the governor delivering a reprieve for Williams. He's interrupted by a call for the sheriff saying the rifle squad has Williams surrounded. The mayor tries to bribe the messenger, Joe Pettibone (Billy Gilbert), offering him a cushy job in the city sealer's office if he'll say he wasn't able to deliver the reprieve. Pettibone doesn't think his wife will like it, but the mayor offers further inducements while shooing Pettibone out the door. Then the mayor tells the sheriff to order the rifle squad to shoot to kill -- and offers a $500 reward for killing Williams.Louie comes into the press room, where Hildy dresses him down for what he did to Bruce. He gives her the counterfeit $450 and, when she insists, Bruce's wallet. She picks up the phone after locking the door behind him but is interrupted by Earl Williams, who climbs in through the window with a revolver. She reminds him that she's a friend. He's very agitated and shoots at the window shade when it startles him by rolling itself up. Hildy takes his gun away and has a busy few minutes calming Earl and juggling Bruce and Walter on the phone while someone knocks at the press room door. Bruce is apparently demanding that she come out; she tells him she's caught the murderer and can't leave. She tells Walter she needs him there. It's Mollie at the door. She and Earl have a brief reunion but there's another knock on the (still locked) door -- the reporters want back in. Hildy hides Williams in a roll-top desk and plants Mollie in the chair in front of the desk, pretending to feel faint. When she lets them in, the reporters speculate that Williams could still be in the building. Hildy tries to get them to do a floor-by-floor search. They accuse her of trying to get rid of them (which she is); she retorts that they're too lazy to go after the story.They're interrupted by the entrance of a well-dressed woman looking for Hildy, or more precisely, for Bruce's $450. She's Mrs. Baldwin (Alma Kruger), Bruce's mother, and she wants to know which of the reporters is the murderer Hildy told Bruce she caught. Hildy's conciliatory at first, but she realizes that if the reporters find Earl, he's toast. She denies telling Bruce that she caught the murderer, which leaves Mrs. Baldwin gasping with indignation. The reporters gang up on Hildy, but suddenly Mollie says she's the only one who knows where Earl is. Mollie is nearly hysterical and berates the reporters when they ask her to talk because they wouldn't listen to her before. Saying she'll give them a story, she jumps out the window just as Walter comes in with Louie. The reporters lean out the window, looking down at Mollie and the people trying to help her (someone thinks she moved, so she might not be dead). Hildy quietly tells Walter that Earl's in the desk. Walter peeks in. Earl wants out, but Walter tells him to stay put. Unfortunately Mrs. Baldwin is still in the room and wants to know what's in the desk. Hildy presents Walter to Mrs. Baldwin. Walter -- rude, as usual -- immediately tells Louie to take her away, which he does, introducing himself politely before lifting her right off the ground and walking off with her. Hildy, angry and tearful, wants to go after them, but Walter convinces her this is too good a story to walk out on. He says they can change the outcome of the election if they spin the story right, and she's caught up in it again.Walter decides they'll have to move the roll-top desk Earl is hiding in to the Morning Post office. Hildy starts typing another draft while Walter calls Duffy and tells him about the story -- \"Earl Williams captured by the Morning Post, exclusive! Tear out the whole front page! Never mind the European war, we've got something a whole lot bigger than that!\" He asks Duffy to send over some wrestlers they know to help with the desk. As he talks, Bruce tiptoes into the room. Hildy talks to him absent-mindedly as she types. He takes his counterfeit money, his check, and his wallet -- which he's surprised to find in her possession -- tries to convince her to come with him, and repeats several times that he's leaving on the 9 o'clock train. During this conversation, Walter's still talking to Duffy about the stories they have to cut or move to make way for Hildy's exclusive, with occasional rude asides to Bruce. Bruce leaves, saying bitterly to Hildy (who's not listening) that she never loved him, and Walter locks the door behind him.Earl opens the desk but closes it in a hurry when Walter says \"get back in there, you Mock Turtle!\" Hildy's still writing for all she's worth. She asks Walter where Bruce went and Walter lies that Bruce will be back. Soon a reporter knocks on the door: Roy Bensinger of the Tribune. He's a problem because Williams is hiding in his desk. Walter throws up a smokescreen of flattery, offers Bensinger a job at the Morning Post, and gives him an assignment. Then he calls Duffy and tells him to keep Bensinger busy for a few hours, then toss him down the stairs.Hildy realizes that Bruce isn't coming back because (she finally remembers) he's taking the 9 o'clock train. Walter says dismissively that it's already too late to catch him and measures the desk with his hands, deciding that it's too big to fit through the window. Louie comes back, very beaten up. He reports that the cab he and Mrs. Baldwin were riding in ran into a carload of cops driving on the wrong side of the street. Louie didn't wait around to see how the old lady was; Hildy fears she's dead and feels responsible. She starts calling hospitals while Walter takes a call from Butch the wrestler, who's having trouble getting away from his girlfriend. Walter sends Louie out to find some other muscle to move the desk. Hildy tries to leave to find Mrs. Baldwin but she's swept back into the press room by the returning press corps and the sheriff.They crowd around Hildy, insisting she tell them where Williams is. In the scuffle, the revolver falls off the table and the sheriff recognizes it. Walter claims to have given Hildy the gun to protect herself from Williams, but the sheriff says this is the gun Williams used to escape and the sheriff knows because it's his gun. The reporters are delighted because the sheriff has foolishly confirmed the story about how Williams got hold of a gun. The sheriff gives Hildy three minutes to tell him where Williams is. He threatens to arrest both Hildy and Walter and fine the Morning Post $10,000. Walter, unimpressed, calls him names. Then Hartwell says he'll impound the Post's property, so Walter dares him to move the roll-top desk out of the building. Hartwell's instructing his goons to do it when two policemen come in with a disheveled Mrs. Baldwin, who accuses Walter of having her kidnapped. This is music to the sheriff's ears, but Walter denies it and accuses Mrs. Baldwin of being drunk and going joy-riding. She retorts that Walter had her kidnapped because she knows they're hiding the murderer in the press room. Walter emphasizes his denial by pounding on the roll-top desk, to which Earl unfortunately responds by pounding back. The sheriff and deputies pull their guns on the desk. Mrs. Baldwin runs from the room, straight the arms of her son. Hildy tells the sheriff that shooting the desk is murder, so he has his deputies raise the roll top. Williams says \"go ahead, shoot me!\" and can barely stand when they pull him out.Reporters all over the room are calling in the story as it happens. Walter gets Duffy on the line and says \"the Morning Post turned Williams over to the sheriff!\" as the cops handcuff him to Hildy. Suddenly the other reporters decide they need to talk to Mrs. Baldwin and rush out, leaving Hildy, Walter, the sheriff, and one cop in the room when the mayor walks in. He congratulates the sheriff on catching Hildy and Walter obstructing justice and tells them they'll get 10 years apiece. As the mayor and the sheriff gloat, the governor's messenger, Mr. Pettibone, comes back. His wife seems to have explained to him that the city sealer job is a bribe, and he rejects it, with explicit details, in the presence of Walter and Hildy who understand all the implications. The mayor tries to deny it, but gets nowhere. Bowing to the inevitable, the mayor professes to be delighted that it won't be necessary to execute Williams and has the sheriff release Walter and Hildy from the handcuffs. The two sides trade threats: from the Morning Post team, an exposé followed by a recall of the mayor, and \"a thumping big libel suit\" from the mayor. Hildy maliciously speculates that the mayor and the sheriff will get 10 years apiece.The mayor and the sheriff depart with Pettibone and Walter gets back on the phone with Duffy. Hildy reminisces about a long-ago case where she and Walter stole a dead woman's stomach to prove she'd been poisoned, then had to hide out for a week in a hotel (which appears to be how they got together). He tries to send her off to Albany after Bruce, and seems to mean it this time, but she isn't sure she wants to go -- and she really wants to finish the story. The phone rings as she walks out the door and she comes back find that it's Bruce calling, once again, from the police station -- he's been arrested for trying the pass the counterfeit money she gave him. Hildy hangs up and breaks down sobbing. Walter tries to comfort her; he's worried because she's never cried before. She finally chokes out \"I thought you were really sending me away with Bruce. I didn't know you had him locked up. I thought you didn't love me!\" Within moments they're planning to get married again and take a two-week honeymoon in Niagara Falls -- which quickly becomes a working trip to Albany, because Duffy reports there's a strike there. As they leave the press room, Walter wonders if Bruce can put them up in Albany. He tells Hildy she should carry the suitcase she's clutching in her arms by the handle but true to form, doesn't offer to carry it for her."
        ],
        "summaries": [
          "A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying.",
          "Having been away for four months, Hildy Johnson (Rosalind Russell) walks into the offices of the New York City-based The Morning Post, where she is a star reporter, to tell her boss, editor Walter Burns (Cary Grant), that she is quitting. The reason for her absence was among other things to get a Reno divorce, from, of all people, Walter, who admits he was a bad husband. Hildy divorced Walter largely because she wanted more of a home life, whereas Walter saw her more as a driven hard-boiled reporter than subservient homemaker. Hildy has also come to tell Walter that she is taking the afternoon train to Albany, where she will be getting married tomorrow to staid straight-laced insurance agent, Bruce Baldwin (Ralph Bellamy), with whose mother (Alma Kruger) they will live, at least for the first year. Walter doesn't want to lose Hildy, either as a reporter or a wife, and if he does, doesn't believe Bruce is worthy of her. Walter does whatever he can at least to delay Hildy and Bruce's trip, long enough to persuade Hildy to stay for good. His plan includes doing whatever he can to place Bruce in a bad light, while dangling a big story under her nose, namely covering what the newspaper believes is the unfair imminent execution of convicted cop killer, Earl Williams (John Qualen). Hildy doesn't trust Walter in dealing with her and Bruce in an above-board manner, but the lure of what potentially may become the biggest story in years, which includes true love, a bumbling sheriff (Gene Lockhart) and a corrupt mayor (Clarence Kolb), the latter's actions largely in light of an upcoming election, may prove to be too much for Hildy to resist, especially if it ends up being an exclusive. Regardless of the story outcome, Hildy will have to decide if the thrill of the chase was worth the anguish on her personal life.",
          "When newspaper editor Walter Burns (Cary Grant) learns that his ex-wife and top reporter Hildy Johnson (Rosalind Russell) is quitting to marry Bruce Baldwin (Ralph Bellamy), he pulls out all of the stops to get her to stay. The newspaper has been championing the cause of a man on death row, Earl Williams (John Qualen), was convicted of killing a policeman and Walter convinces her to write a story on his case. Williams insists that the shooting was an accident and he's not crazy, as some believe. While Hildy pursues the story, Burns has her fiancé arrested - multiple times. When Hildy gets the scoop of the year - Williams escapes from prison on the eve of his planned execution - she hides him in the police station and mayhem ensues. It also gives her a chance to decide just what she wants in the future.",
          "Four months after her resignation, journalist Hildy Johnson returns to The Morning Post - just to tell her former boss and husband Walter Burns (Cary Grant) to stop bombarding her with telegrams, because she won't come back to him, and anyway, she is going to marry insurance agent Bruce Baldwin (Ralph Bellamy) the next day. When Walter learns that Hildy and Bruce are going to Albany already in two hours, he has to act very quickly. He immediately starts a series of clever schemes to get Bruce out of the way and Hildy back to journalism. He knows that Hildy cannot resist an enticing commission. Earl Williams (John Qualen) is a confused man who is going to be executed the following day, if The Morning Post does not succeed in convincing the governor to pardon him. Hildy sees the possibilities to get a scoop by interviewing Williams, and postpones her departure some hours. She gets more and more entangled in the case, and even helps Williams to hide, when he has run away from prison. Soon she and Walter work feverishly side by side, and her fiancé Bruce just annoys her.",
          "In the next two hours, the Morning Post's unscrupulous editor, Walter Burns (Cary Grant), is about to lose Hildy Johnson (Rosalind Russell): his former wife and still the newspaper's best reporter. Intent on moving to Albany with her meek insurance agent fiancé, Bruce Baldwin (Ralph Bellamy), Hildy is bent on forsaking journalism to live a normal life with someone who will never take her for granted; however, as always, the manipulative editor-in-chief has to have the final word. Now, to win back both his top journalist and the love of his life, Walter has to act fast and try every trick in the book to talk Hildy into accepting one last story she won't be able to resist--the impending execution of the convicted murderer, Earl Williams. Is Hildy prepared to renounce her passion for journalism, and Walter, the exciting man who never stopped loving her?",
          "Walter Burns (Cary Bellamy), editor of a major Chicago newspaper, is about to lose his ace reporter and former wife, Hildy Johnson (Rosalind Bellamy), to insurance salesman Bruce Baldwin (Ralph Bellamy), but not without a fight. The crafty editor uses every trick in his fedora to get Hildy to write one last big story, about murderer Earl Williams (John Qualen) and the inept Sheriff Hartwell (Gene Hartwell). The comedy snowballs as William's friend, Molly Malloy (Helen Mack), the crooked Mayor (Clarence Kolb), and Bruce's mother (Alma Kruger) all get tied up in Walter's web."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "1y_NAIUBmFo8GYv0boAv",
        "_score": 16.319761,
        "title": "Exit Wounds",
        "year": 2001,
        "genders": [
          "Action",
          "Crime",
          "Thriller"
        ],
        "score": 5.6,
        "directors": [
          "Andrzej Bartkowiak"
        ],
        "writers": [
          "Ed Horowitz",
          "Richard D'Ovidio",
          "John Westermann"
        ],
        "synopsis": [
          "A tough cop runs up against fellow cops selling drugs."
        ],
        "summaries": [
          "Orin Boyd, a tough cop in an inner-city precinct discovers a web of dirty cops and corruption.",
          "Orin Boyd (Seagal) is a Detroit cop who doesn't follow rules. After he saved the Vice President by violating every order he received he is transferred to one of the worst precincts in the city. There he quickly encounters some corrupt cops selling heroin to drug dealers. The problem is, it's very difficult to tell who is the bad guy and who you can trust.",
          "Orin Boyd is a cop who works in Detroit's 21st precinct, and his attitude and rough means of enforcing the law always end up annoying the precinct captain, Frank Daniels. When terrorists try to kill the Vice President of the United States, Orin kills the terrorists. Even though Orin saved the Vice President's life, Frank doesn't like the way Orin did it, so Frank transfers Orin to the 15th precinct -- Detroit's worst precinct. Orin's new captain, former internal affairs officer Annette Mulcahy, knows of his reputation and tells him that she won't tolerate it, and she sends Orin to an anger management class where he meets Henry Wayne, the high-strung host of a local talk show called \"Detroit AM.\" Despite this measure, Orin doesn't change his ways of doing his job, and it's not long before he comes across local drug dealer Latrell Walker and his fast-talking sidekick T. K. Johnson doing a shady deal with a man named Matt Montini. After a brief fight, Orin discovers that Montini has been working undercover trying to nail Walker, and Orin messed it up, a point that doesn't sit well with Montini's musclebound partner Useldinger. Not all of the cops of the 15th precinct give Orin a hard time. Sergeant Lewis Strutt steps in to cool things down when Orin gets in a fight with Useldinger, and George Clark is assigned to be Orin's partner. After Orin stumbles upon the theft of $5,000,000 worth of heroin from Piper Tech, a place where evidence is stored, Orin and George begin focusing their efforts on Latrell and T.K., and also Shaun Rollins, a man that Latrell has been visiting at the local jail. Orin asks Henry to do some digging on Latrell's background. What Henry discovers is that Latrell is not a drug dealer. Latrell is a computer expert and billionaire whose real name is Leon Rollins -- he's the brother of Shaun Rollins. Orin confronts Leon, who explains that a group of corrupt cops were in danger of losing one of their drug dealers, so the corrupt cops planted heroin on Shaun, setting Shaun up to take the rap so they wouldn't lose their dealer. Sergeant Lewis Strutt is the leader of the group of corrupt cops, who also include Montini and Useldinger, and Strutt and his gang are the ones who stole the heroin from Piper Tech. Leon and his friend Trish have been videotaping the corruption, hoping that it might help prove Shaun's innocence and get him out of jail. Orin meets with Annette at a parking lot and he gets in Annette's truck and tells Annette what's going on. When Montini and Useldinger and a bunch of their men show up and try to kill Orin and Annette, Annette screeches out of the parking lot with Orin still in her truck. Orin and Annette are chased, and Annette is killed in the chase when her truck slams into the back of a bigger truck, sending her into her windshield. Orin tells Frank that Strutt will be having a meeting at a warehouse in about an hour, to sell the heroin that was stolen from Piper Tech. Strutt plans to try to sell it to Leon and T. K., not knowing that Leon is working against him. Frank promises that he'll be there with some backup. Orin then goes to George's house and tells George what's going on. George agrees to help Orin bring Strutt and his gang down. But it may be someone higher up who is behind the whole thing."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "DS_NAIUBmFo8GYv0boYx",
        "_score": 16.007015,
        "title": "District B13",
        "year": 2004,
        "genders": [
          "Action",
          "Crime",
          "Sci-Fi"
        ],
        "score": 7.1,
        "directors": [
          "Pierre Morel"
        ],
        "writers": [
          "Luc Besson",
          "Bibi Naceri"
        ],
        "synopsis": [
          "In 2010, social problems such as violence, drugs and organized crime have overrun the poorer suburbs of Paris, especially a Banlieue commonly referred to as B13 (Banlieue 13, or District 13 or Borough 13 in English), a ghetto with a population of some two million. Unable to control B13, the authorities construct a high wall topped by barbed wire around the entire area, forcing the inhabitants within to survive without education, proper utilities, or police protection behind the containment wall. Police checkpoints stop anybody from going in or out.Three years later, an almost feudal system has developed amongst the street gangs of B13. The area is now flooded with hard drugs such as heroin and completely controlled by gangsters. Certain blocks are ruled over by various individuals and one high rise apartment block is looked after by an athletic and street-wise man known as Leïto (David Belle). Leïto hates drugs and injustice and wages a one-man war against a neighboring gang lord named Taha Bemamud (Bibi Naceri) to keep his own building and people safe and free of drugs. Leïto captures 20 kg of cocaine from Taha, worth over a million euro, which incites Taha to send his thugs to recover the merchandise, led by the towering K2 (Tony D'Amario). Leïto destroys the cocaine by using bleach and uses parkour to evade Taha's thugs through the building and across rooftops.Taha kidnaps Leïto's younger sister Lola (Dany Verissimo) to use against him, but Leïto manages to invade Taha's base, rescue his sister, and kidnap Taha in turn. Leïto takes Taha to the police office at the edge of the district perimeter, but the police are in the process of abandoning their position on orders from the French Ministry, and are also threefold outnumbered by Taha's gang. The police release Taha and allow him to take Lola with him to avoid a confrontation. In addition, they put Leïto in a cell also to contain the situation, but Leïto kills the police chief in the process for handing over Lola.Six months later, outside of B13 in the affluent areas of Paris, an undercover police captain named Damien Tomaso (Cyril Raffaelli) infiltrates an underground casino and attempts to arrest the gangster who owns it. His extraction procedure fails, however, forcing him to fight his way through an army of thugs to escape the casino. Upon the mission's completion, Damien immediately receives another assignment from his chief and also the Defence Secretary of France, Mr Krüger. He is told that Taha has stolen an experimental neutron bomb that is set to detonate in 24 hours. His mission is to convince Leïto, imprisoned for months, to lead him to Taha's base so that he can disarm the bomb.Damien attempts to pass himself off as a fellow prisoner and helps Leïto escape to B13, but Leïto sees through Damien's act and abandons him. After fighting off some of the local thugs, Damien locates Leïto and admits the truth. They team up to disarm the bomb and rescue Lola. The pair surrenders to Taha in order to gain access to his base. There, they discover that Taha has rigged the warhead to a missile launcher, pointed towards the center of Paris and is prepared to blackmail the government with it. Taha demands a high ransom, which is refused by Damien's government contact. The pair escape, and while Taha's thugs pursue them, he discovers that the government has emptied all of his offshore accounts in the Bahamas. One of Taha's men asks how Taha will pay them. Frustrated Taha trys to shoot the member who asked him that only noticing his gun to be unloaded. Taha offers money from a safe he possesses. Knowing that with Tahas accounts emptied and unable to have any reason to work for him the thugs shoot Taha. This leaves K2, a more sympathetic character, in charge and K2 has a moment of reconciliation with Leïto, suggesting that peace is possible in the future within B13.Leïto and Damien fight their way to the tower holding Lola and the bomb. Once there, Damien calls his contact to receive the deactivation code, 9293709B13. Leïto recognizes the code as a reference to the bomb's location (9293 is the district's area code), the day's date (7 September), and the district, B13. Leïto deduces that the government has set them up and the code will actually detonate the bomb instead of deactivating it. He fights Damien to prevent him from entering the code. The timer runs out and the bomb does not detonate, proving Leïto's theory.The pair return to the government building with the bomb and force Mr Krüger to admit that he had planned to blow up B13 as a means to get rid of it. The confession has been taped and is immediately broadcast by pirate television transmission. The pair's actions cause a major scandal that sparks public support for B13. Soon the rest of the government promises to tear down the containment wall and bring back schools and police to B13. Leïto and Damien depart as friends, and Lola kisses Damien to encourage him to visit B13 in the future."
        ],
        "summaries": [
          "In the ghettos of Paris in 2010, an undercover cop and an ex-thug try to infiltrate a gang in order to defuse a neutron bomb.",
          "In the near future, the worst ghettos of Paris, France are literally walled off and among the worst is District B13. Controlled by the ruthless crime lord, Taha, a young righteous punk named Leïto is determined to bring him down. When the boss retaliates by kidnapping his sister, Lola, a rescue attempt by Leïto is destroyed by betrayal that gets him arrested and Lola kept in the clutches in Taha. Six months later, a crackerjack undercover cop named Damien is given a urgent mission: a neutron bomb has been stolen by Taha in District B13 which has an automatic timer function engaged and set to detonate in less than 24 hours. Now with time running out, Damien and Leïto must work together to find and stop the bomb, but there is far more to this crisis than any of the field players realize.",
          "In 2010, the dangerous districts in the periphery of Paris are surrounded by walls, and the dwellers do not have school, hospital and even police in the area, which are ruled by drug lords. In the 13th District, Leito is a honest man that lives in a clean building and does not permit drug dealers nearby his neighborhood. When he destroys one million Euros in heroin of Taha Bemamud, the criminal abducts Leito's sister Lola and the corrupt police arrests Leito. Six months later, the tough and honest Capt. Damien Tomaso is assigned to find and deactivate a stolen bomb that might destroy the 13th District and the two million dwellers. Together with Leito, they have to face the gang of Taha and disclose a despicable secret behind the robbery of the bomb."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "vi_NAIUBmFo8GYv0bpc3",
        "_score": 15.829739,
        "title": "Stonewall",
        "year": 2015,
        "genders": [
          "Drama",
          "History"
        ],
        "score": 5.3,
        "directors": [
          "Roland Emmerich"
        ],
        "writers": [
          "Jon Robin Baitz"
        ],
        "synopsis": [],
        "summaries": [
          "A young man's political awakening and coming of age during the days and weeks leading up to the Stonewall Riots.",
          "The plot revolves around the 1969 Stonewall Riots, the violent clash that kicked off the gay rights movement in New York City. The drama centers on Danny Winters, who flees to New York, leaving behind his sister. He finds his way to the Stonewall Inn, where he meets Trevor before catching the eye of Ed Murphy, manager of the Stonewall. He colludes with corrupt police and exploits homeless youth."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "aC_NAIUBmFo8GYv0boky",
        "_score": 15.731075,
        "title": "Delta Farce",
        "year": 2007,
        "genders": [
          "Action",
          "Adventure",
          "Comedy"
        ],
        "score": 3.6,
        "directors": [
          "C.B. Harding"
        ],
        "writers": [
          "Bear Aderhold",
          "Tom Sullivan"
        ],
        "synopsis": [
          "An army general (Glenn Morshower) addressing a bunch of assembled troops and stating that real heroes are hard to find these days.Meanwhile, diner waiter Larry (Larry the Cable Guy) is serving sandwiches at a local diner. His girlfriend Karen (Christina Moore) comes up to him and quickly tells him she's pregnant, and before she can stop him, he announces to everybody that she is pregnant and proposes to her. She then tells him that it is not his baby.Meanwhile, Bill Little (Bill Engvall) is talking about marriage with his neighbor (Michael Papajohn). The neighbor points out that most marriages end in divorce, and Bill says that it takes a lot to make a marriage work, such as incriminating photos of him with a girl who was just a good listener and eager to please at the local nightclub.Elsewhere, a man opens up a storage shed to see the leotard-and-leopard-skirt (with a porn-star mustache) clad Everett (DJ Qualls) watching TV. He reprimands Everett for living here when he just works here and berates him for having been a cop for only four days.Sometime later, the three are getting set for their Monthly trip up to their deserted army recruitment camp; turns out these three are also army reservists and picking on Everett about his tendency to be trigger-happy is their form of entertainment.Meanwhile, on an army base somewhere, a Colonel gets a request for more troops for Fallujah and he pulls up the name of the base where the boys are staying and sends Sgt. Kilgore (Keith David) to assess the situation at the reserve base.Kilgore arrives there to find Bill and Larry eating chips and Everett out on a beer run. Pretty soon he has them going through an intense training regimen and not long after, they find themselves being shipped out. The day they leave, Everett and Bill are both making calls, Everett to his boss and Bill to his wife Connie (Lisa Lampinelli), but they are dragged off to a hangar by Kilgore. Once they're all gathered, Kilgore appoints Larry squad leader and marches them onto the plane.The plane is flying through a brutal thunderstorm. The trio, in search of comfort, sneak into a Humvee in the cargo area. Kilgore wakes up and sees them gone and tracks them down just as the pilots encounter heavy turbulence that forces them to drop some cargo. In a moment, the Humvee, some supply boxes, and Kilgore are all falling through the night sky.The next morning, the boys pull themselves from the Humvee, look at the surrounding sandy landscape, and conclude they're in Iraq. After Everett accidentally smashes the radio, they find Kilgore lying next to one of the supply crates and conclude that he died in the fall. They solemnly bury him and give him a brief eulogy that gets interrupted by the sound of Everett urinating into a canteen, claiming that urine's sterility makes it drinkable. Bill and Larry shake their heads and the three load up and move out, not noticing the sign they pass over that says, \"Mexico City 500 km.\"They soon come to a gas station where they fill up, look at a map of Iraq, and have some MREs. Since Larry doesn't like his spaghetti and meatballs, he trades it with Bill for his beef stew, who immediately leaves the spaghetti on the pump when he realizes that Larry spit his chewing tobacco into it. As their getting ready to leave, Everett spots some \"Iraqis\" and after shooting their donkey, runs up to them and starts demanding to know if they're \"Turds or Shi'tites\", to which Bill corrects him with, \"It's Kurds or Shi'ites, numbskull.\" Speaking in Spanish to each other, the two \"Iraqis\" realize these guys can help their village and take them to their town.Meanwhile, back at Kilgore's gravesite, the sergeant wakes up from being knocked unconscious, claws his way out of the dirt cairn he was buried in, staggers over to the left-behind canteen, drinks from it, retches, and screams in vengeance. Meanwhile, the trio hang outside the village of La Miranda where they see some insurgents abuse the locals. They drive the Humvee in and shoot the place up, but still manage to scare most of the \"insurgents\" off and capture one for questioning, to the delight of the villagers, who throw them a party featuring tacos, which Bill is surprised to find in Iraq. The mayor Tony Perez, who is hosting the party with his daughter Maria (Marisol Nichols), hears this and tries to correct him, but gets shouted out by the boisterous laughter of Larry.Meanwhile, Kilgore makes it to the gas station and after having a bite of Larry's tobacco-filled spaghetti -- and spitting it out -- finds two guys who offer to give him a ride, although secretly they tell each other that they'll take him back to their place and have fun with him there.Meanwhile, Everett is wearing a sniper ghillie suit he brought from home and interrogating the captured bandit. Larry comes in and sees this and sends Everett out to play with a cannon he found while he asks the guy if he is Al Qaeda. After a minute, the guy realizes what's going on and laughs at them and calls him a \"gringo\". Larry's eyes bulge and he runs outside to find a drunken Bill confirming they're in Mexico while on the arm of an attractive senorita named Magdalena (Danielle Hartnett), and Larry screams and faints.A little while later, Larry is up and freaking out to Bill who calmly -- and with the help of Everett the dictionary -- tells him that technically, according to the US governments definition of terrorists, they still are fighting terrorism and are doing exactly what the army would have them doing, just not in the same place. Larry calms down enough to accept their \"mission\". That night, while he's walking/flirting through the village with Maria, he learns the name of the leader of the bandits -- a name designed to strike fear (and confusion) into the hearts of all who hear it -- Carlos Santana.At the same time, Santana himself (Danny Trejo) heading things up at his bar by having The Amazing Ken (Jeff Dunham), a kidnapped comedian, perform a bad ventriloquism act and then shooting the dummy when he doesn't like it. At this point one of the banditos from before comes in and tells Santana about the hundreds of US soldiers who have shown up to offer aid to the village, and Santana accepts this news with dignity and grace....and then has two subordinates kill the guy. One of his assistants ask if they're going to La Miranda tonight, and he says, \"No, I don't like to work on weekends. Tonight....we do KARAOKE!!!!\"Over the next day or two, the trio continue to fix things up around town under what Bill calls \"Operation: Sombrero\". At the same time, Kilgore secures his freedom with violence, and steal a scooter with nothing on but a little red teddy. At some point, Bill tries to fix the radio to call his superior -- his wife -- and the bartender in front of him tells him about a nearby working phone. They drive out there without telling Larry or Everett but as Bill is getting chewed out for not having mowed the lawn yet and for being in Mexico instead of Iraq, Santana and his goons sneak up on Bill and take him hostage, using the threat of alone time with Santana's gay nephew Ruben (Joe Nunez) to get Bill to talk.Back in town, Everett is trying to get the cannon to work but his arm keeps getting stuck in it and Larry and Maria are talking about her dream to move to the coast and start a restaurant when Santana and troops roll in. They threaten to shoot Bill and Santana gloats that Larry can't shoot all of them until Larry points out that he can just shoot Santana. Bill gets released and suddenly out of nowhere Kilgore shows up and starts chewing out Bill and Larry, not realizing about Santana and the others until a gun is poking into his face. Suddenly, Everett comes charging in with his rifle and this sets off a big fight during which Everett tries to fire a Rocket Launcher at the bandits but instead hits the water fountain, which erupts in a magnificent geyser of water. Fortunately, the explosion scares off the bandits, and the boys are celebrating until they realize that the bandits have captured Kilgore. Left with no choice, the boys decide to go and break him out.That night, Santana is hosting a wrestling tournament between some luchadore and two of his lieutenants. As the luchadore trounces the other guys, Kilgore is tortured by being forced to sing a karaoke version of \"I Got You Babe\" with Reuben. Meanwhile, the boys have arrived and are steadily sneaking into the compound as Bill constantly changes disguises to manipulate things and Larry goes in to sneak around. Meanwhile, the luchadore has cleared the ring and is searching for a new combatant which he finds in Everett, disguised as a luchadore named \"Carne Asada\". As they start fighting, Larry breaks Kilgore out and goes to drop in on Santana. Meanwhile, Kilgore finds some dynamite which he and Bill use on the trucks. Just as Everett manages to win his match and rips off his mask in triumph (something a real luchadore would never do) and Larry gets the drop on Santana, the dynamite goes off and our boys make a quick exit as Santana swears revenge on La Miranda.Back in town the next day, Kilgore relents on his take-charge attitude and agrees to help the boys defend La Miranda, and just in time as the bandits pull up. The townspeople hide in the church just as an old Sherman tank rolls up and starts blasting everything. Kilgore yells that they need to stop that thing, and Larry screams for cover as he runs across to the cannon. He finally gets it to work by kicking it, and just then the cavalry arrives in the form of four army helicopters. The bandits scatter, and Santana makes for the church and takes Maria hostage. After making sure that the mayor doesn't have any other attractive daughters, Larry tracks Santana down, rescues Maria, and knocks Santana out with one punch. Once things calm down, a state secretary approaches Larry and Bill (who suffered a shot in his rear differential), and reveals that if they're willing to cooperate, they can make this look good for everybody.Soon, news reports are spreading across the globe about the humanitarian aid given by the army in \"Operation: Sombrero\" and its efforts to capture local crime lord and rock star Carlos Santana. From here, an award ceremony honors Kilgore and the boys for their actions, where they each get the silver star and Bill gets a purple heart.Days pass after these recent events. Sargeant Kilgore moved to Miami, Florida, where he opened up a private exercise camp where he uses his abuse for the good of mankind. Everett moved back to Mexico and officially became a luchadore using his persona of \"Carne Asada\". Bill sued the Mexican government for his injury and settled out-of-court, and is currently living off the payoff in Beverly Hills. Larry went back to Mexico, married Maria, and opened up a restaurant called \"The Mess Hall\" in Cabo San Lucas. As for Santana, he was jailed and put into a rehab program. After being released, he became a ventriloquist using the Amazing Ken's dummy he had shot earlier."
        ],
        "summaries": [
          "Three bumbling Army reservists bound for Iraq are accidentally dropped at Mexican village besieged by hostile forces.",
          "When three small town National Guardsmen bound for Iraq are unknowingly dropped into Mexico, their confusion leads them to \"liberate\" a small village from a band of corrupt Federales"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ki_NAIUBmFo8GYv0bnQr",
        "_score": 14.562847,
        "title": "Ragtime",
        "year": 1981,
        "genders": [
          "Drama"
        ],
        "score": 7.3,
        "directors": [
          "Milos Forman"
        ],
        "writers": [
          "E.L. Doctorow",
          "Michael Weller",
          "Heinrich von Kleist"
        ],
        "synopsis": [
          "The film begins with a newsreel montage, depicting celebrities of the turn of the 20th century such as Harry Houdini, Theodore Roosevelt and the architect Stanford White (Norman Mailer), as well as life in New York City. The newsreel is accompanied by ragtime pianist Coalhouse Walker, Jr. (Howard E. Rollins, Jr.).The millionaire industrialist Harry Kendall Thaw (Robert Joy) makes a scene when White's latest creation, a nude statue on the roof of Madison Square Garden, is unveiled. The model for the statue is Evelyn Nesbit (Elizabeth McGovern), a former chorus girl who is now Thaw's wife. Thaw becomes convinced White has corrupted Evelyn and humiliated him. On the evening of June 25, 1906, Thaw confronts and publicly shoots White during a show at Madison Square Garden, killing him in cold blood before several witnesses. Thaw surrenders to the police without attempting to run.Meanwhile, an unnamed upper class family resides in a comfortable suburban home in New Rochelle. The family's Father (James Olson) owns a factory, where his wife's Younger Brother (Brad Dourif) is employed as a fireworks maker. Their passive, sheltered existence is disturbed when an abandoned African American baby is found in their garden. The child's mother, an unmarried washerwoman named Sarah (Debbie Allen), is discovered, and brought to their home. When she learns that the police intend to charge Sarah with child abandonment and attempted murder, Mother (Mary Steenburgen) intervenes and takes both Sarah and her child into the home, despite Father's objections. Some time later, Coalhouse Walker arrives at the house in search of Sarah, driving a new model T-Ford automobile and acting in a brash manner unlike the subservient attitude expected of the African American community at the time. Realizing that he is the baby's father, he announces to a skeptical Father that he intends to marry Sarah.Younger Brother witnesses White's murder and becomes obsessed with Evelyn, leaving home for long periods of time to follow her throughout the city. Thaw's lawyer, Delphin (Pat O'Brien), bribes Evelyn with a million-dollar divorce settlement (which she accepts) to keep silent about Thaw's mental instability at his trial and to testify that White had abused her when she was a teenager to model in the nude for him.Passing through the tenements of the Lower East Side, Evelyn encounters a Jewish street artist known as Tateh (Mandy Patinkin) and witnesses him throw his wife (Fran Drescher) out of their home after catching her being unfaithful, having sex in the back of a store. Tateh takes their daughter and leaves New York, taking with him the flip book he has invented, which he begins to sell successfully. Evelyn, who has become fond of the little girl, is troubled by their disappearance, but distracted when Younger Brother declares his love to her. She begins an affair with him as she begins to plan her return to the stage. He assumes that they will eventually marry and plans to introduce her to his family.A year-and-a-half later (in early 1908), Thaw is tried and found not guilty by reason of temporary insanity for White's murder. That evening, Delphin and his assistant counsel (Richard Griffiths) interrupt one of Evelyn's sexual trysts with Younger Brother and inform her that Thaw will be suing her for divorce on the grounds of infidelity, offering her a much smaller divorce settlement, which she takes. The affair ends shortly thereafter, leaving Younger Brother alone and adrift.A little later, trouble rears its head in New Rochelle when Coalhouse Walker is targeted by a crew of bigoted volunteer firemen, led by fire chief Willie Conklin (Kenneth McMillan), who refuse to allow his automobile to pass by their firehouse. After he leaves to find a policeman (Jeff Daniels), Walker returns to find his car's seat soiled with purported horse excrement, possibly human excrement. His protests end with the racist policeman placing him under arrest for parking his car illegally. Conklin is not arrested.After Father arranges for Walker's release on bail, they discover his car has been vandalized further. He pursues legal action against the fire company, but can find no lawyer willing to represent him. Father, who believes Walker has no legal recourse open to him due to his race, and Younger Brother, who supports Walker, have a confrontation in front of Sarah, who is informed by an infuriated Father that it is up to her to get Walker to see sense. She sneaks out of the house to attend a Presidential rally, where she attempts to tell President Teddy Roosevelt about Coalhouse Walker's case but is pushed back and beaten by the racist guards. She is severely injured, and soon after dies from her wounds.After Sarah's funeral, a furious Coalhouse Walker assembles a group of African-American supporters where they ambush the volunteer firemen, killing several of them. He sends a letter to the police and newspapers threatening to attack other firehouses, demanding that his car be restored and that Conklin be turned over to him for justice. Father is disgusted at Walker's violence, but Younger Brother tracks him down and joins his gang, bringing with him his knowledge of explosives.Ostracized by their community and hounded by reporters over their involvement in a black man's issues, Father and Mother leave New Rochelle for Atlantic City, where they encounter Tateh, who is now a film director working on a photoplay with Evelyn Nesbitt. Mother is attracted to him, and she and Father quarrel.Meanwhile, Coalhouse Walker and his gang force their way into the Pierpont Morgan Library, holding the priceless collection of books hostage in exchange for Conklin and the car. New York City Police Commissioner Rhinelander Waldo (James Cagney) arrives and takes command of the siege. He sends men to retrieve Walker Coalhouse's infant child, but Mother refuses to give him up. This angers Father, who demands she turn the child over, and he returns to New York alone to assist Commissioner Waldo. In his absence, Mother checks out of their hotel.Local black attorney and NAACP activist Booker T. Washington (Moses Gunn) is called in as a mediator but fails to persuade Walker to surrender, as does Father in a meeting at the library. It is here that Father suspects his Younger Brother has joined Walker's gang, wearing black-face makeup, a hood and gloves. Conklin, who has fled, is captured by the police hiding under a bed, and forced to phone Coalhouse Walker at the library to apologize. Commissioner Waldo is disgusted by Conklin and his racist attitude, who he calls \"a piece of slime,\" and announces to Conklin that he will be brought up on criminal charges, but the Commissioner yet cannot submit to terrorist demands. Coalhouse Walker ultimately agrees to surrender if Waldo will permit his supporters to safely depart in his restored car. Waldo agrees but substitutes another Model T after Father volunteers to stay inside the library as a hostage. Younger Brother and the rest of Walker's supporters successfully escape in the car, eluding police surveillance, and Walker drives Father out the library soon after. He prays, seeming ready to blow himself up, but instead surrenders to the police. As he steps out of the building with his hands raised, Waldo orders a sniper to shoot him dead.The film ends with another newsreel montage set a few years later: Evelyn dances in vaudeville and is a major stage and silent film star. Harry Thaw is released from an asylum. Harry Houdini escapes from a straitjacket while dangling several stories above the ground, while below him, the newspapers announce that war in Europe has been declared (the start of the first world war in 1914). Younger Brother returns to working at the factory, but now with idealistic and radical views on life and the races. In the final shot, Father watches from the house in New Rochelle as Mother departs with Tateh and Coalhouse's son."
        ],
        "summaries": [
          "A young black pianist becomes embroiled in the lives of an upper-class white family set among the racial tensions, infidelity, violence and other nostalgic events in early 1900s New York City.",
          "The story runs in the 1910's New York. Coalhouse Walker Jr. (Howard E. Rollins Jr.) is a black piano player. He has won fame and fortune playing with a jazz band. Some white men do not like this situation, and one day they assault him and spoil his brand new car. Walker tries by all means to get justice, without satisfaction."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "yS_NAIUBmFo8GYv0bnIq",
        "_score": 14.380661,
        "title": "Voyage of the Damned",
        "year": 1976,
        "genders": [
          "Drama",
          "War"
        ],
        "score": 6.4,
        "directors": [
          "Stuart Rosenberg"
        ],
        "writers": [
          "Steve Shagan",
          "David Butler",
          "Gordon Thomas"
        ],
        "synopsis": [],
        "summaries": [
          "The tragic 1939 voyage of SS St. Louis carrying hundreds of German Jewish refugees from Nazi Germany that seemingly no nation is willing to save from certain doom.",
          "In 1939, Germany's Hamburg-America Line announced a voyage from Germany to Cuba. 937 people, the vast majority being Jews, signed up for the opportunity to escape Nazi Germany. Unbeknownst to the passengers, the visas they purchased were from a corrupt Cuban director of immigration, and they were invalid. Upon arrival in Havana, only 28 people were allowed to disembark, while the rest remained on board for weeks as they sailed to Florida, and eventually Canada, searching for safe haven. Sadly the ship returned to Antwerp after more than a month at sea. Forced back under Nazi rule as the low countries fell, it is estimated that approximately 250 of the refugees died in the extermination camps in occupied Poland.",
          "Based on the true story of a ship carrying hundreds of German-Jewish refugees, which was sent to Havana in 1939 by the Nazis but was denied permission to land anywhere. The ship was eventually obliged to return to Germany, where certain death awaited many of its passengers.",
          "Organized by the Nazis in May 1939, nine hundred thirty-seven Jews set sail on the S.S. St. Louis, a luxury ocean liner, from Hamburg to Havana. The passengers are sailing to freedom in Cuba, where their friends and relatives are awaiting their arrival. The passengers have mixed emotions about their voyage: some are happy about freedom, some are sad to leave their German homeland, and some are angry about accepting anything from their Nazi persecutors. Some of the crew, those that sympathize with the Nazi Party, are also angry that the Nazis would allow Jews to sail to freedom and are angry about having to serve their inferior passengers. The ship's Captain, Schroeder, is a non-political man, and does whatever he can to ensure a safe and comfortable voyage for his passengers. Unbeknown to most of the crew, including the Captain, and the passengers all of whom were only issued tourist visas, a wave of antisemitism is sweeping across the western hemisphere, in part fueled by the Nazis. The passengers, as refugees, are obviously intending on staying once landed despite their visas. Thus, the fate of the ship and its passengers is uncertain when it lands in Havana Harbor. Perhaps this outcome was the Nazi plan all along so that the world could no longer object to how the Nazis deal with Jews at home."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Wy_NAIUBmFo8GYv0boEv",
        "_score": 13.652342,
        "title": "The Quiet American",
        "year": 2002,
        "genders": [
          "Drama",
          "Romance",
          "Thriller"
        ],
        "score": 7,
        "directors": [
          "Phillip Noyce"
        ],
        "writers": [
          "Graham Greene",
          "Christopher Hampton",
          "Robert Schenkkan"
        ],
        "synopsis": [
          "[The first synopsis is a far shorter summary of the film with more of a historical context; appearing a few paragraphs down is a second, \"chronological\" synopsis of the film.]I.Set in the early 1950s in Saigon, Vietnam, during the end of the First Indochina War, on one level The Quiet American is a love story about the triangle that develops between a British journalist in his fifties, a young American idealist and a Vietnamese girl, but on another level it is also about the political turmoil and growing American involvement that led to the Vietnam War.Fowler, who narrates the story, is involved in the war only as an observer, apart from one crucial instant. Pyle, who represents America and its policies in Vietnam, is a CIA operative sent to steer the war according to Americas interests, and is passionately devoted to the ideas of York Harding, an American foreign policy theorist who said that what Vietnam needed was a third player to take the place of both the colonialists and the Vietnamese rebels and restore order. This third player was plainly meant to be America, and so Pyle sets about creating a Third Force against the Viet Minh by using a Vietnamese splinter group headed by corrupt militia leader General Thé (based on the actual Trinh Minh The). His arming of Thé's militia with American weaponry leads to a series of terrorist bombings in Saigon. These bombings, dishonestly blamed on the Communists in order to further American outrage, kill a number of innocent people, including women and children.Meanwhile, Pyle has stolen Fowlers Vietnamese mistress Phuong, promising her marriage and security. When Fowler finds out about Pyle's involvement in the bombings, he takes one definitive action to seal all of their fates. He indirectly agrees to let his assistant, Hinh, and his Communist cohorts confront Pyle; when Pyle tries to flee, Hinh fatally stabs him. Phuong subsequently returns to Fowler, and while the local French police commander suspects Fowler's role in Pyle's murder, he has no evidence and does not pursue the matter. [D-Man2010]----------------------------------------------II.It is Saigon in the early 1950s. Thomas Fowler (Michael Caine) is a writer for the London Times, and he is covering the conflict between the Communists and the French in Indo-China (Vietnam). He is asked to identify the body of Alden Pyle (Brendan Fraser). Most of the rest of the film is a flashback. Fowler remembers how he met Pyle at the Hotel Continental in Saigon. He remembers that when he met him, Pyle was an enthusiastic and idealistic member of a medical aid team. Fowler next gets a telegram from his editor ordering him to return to London. Fowler writes a story about Phat Diem, which is a village being attacked by the Communists with the hope of getting his editor to let him stay. Fowler introduces his girlfriend, Phuong (Do Thi Hai Yen), to Pyle. At a dance hall, Pyle dances with Phuong. He tells her that he can only speak two words in Vietnamese, beer and haircut. Her older sister (Pham Thi Mai Hoa) hopes to get Phuong attached to Pyle, who she obviously considers a better match than Fowler. Fowler tells Phuong that he must return to London, but that he cant get a divorce from his wife.Later, Fowler is with soldiers investigating Phat Diem, when Pyle appears in a boat, surprising everyone. They find the villagers massacred. That night, Fowler and Pyle are together, and Pyle tells Fowler that he has fallen in love with Phuong. Pyle returns to Saigon first, and when Fowler returns to Saigon he watches a parade to honor General The (pronounced Tay; Quang Hai), who is the leader of a new political party. Afterwards, Pyle comes to Fowlers house, and he proposes to Phuong, but she rejects him, and he leaves.Fowler's editor now wants him to stay in Saigon on account of his story about the massacre. He writes to his wife seeking a divorce, and he tells Phuong that he is doing so. Much later, Fowler drives to the front to interview The and is surprised to see Pyle with his medical team. Fowler can't get to see The, but Pyle arranges an interview for him. Fowler angers The with his questions, and the interview ends. Fowler and Pyle leave together in Fowlers car. Apparently, the Vietnamese have siphoned the gas from Fowlers car, and it runs out of gas on the way back to Saigon. They are in a tower in a village when the village comes under attack. Fowler hurts his ankle, and Pyle goes for assistance. In a further flashback, Fowler remembers how he first met Phuong at a dance hall.Pyle returns and they go back to Saigon. Phuong welcomes Fowler back and gives him a letter from his wife. Fowler tells Phuong that his wife has given him a divorce. However, later, Pyle, Phuong and her sister accuse Fowler of lying about the divorce. Fowler and his Vietnamese colleague, Hinh (Tzi Ma), uncover a shipment of diolacton at a warehouse. They dont know what diolacton is.Phuong leaves Fowler for Pyle. Subsequently, Fowler is sitting on the porch of the Continental Hotel. There is a terrific explosion, and horrific death and injuries. Fowler, in a daze, tries to help. He sees Fowler at the scene. Later, he realizes that Pyle was speaking Vietnamese. Fowler finds out that diolacton is used to make explosives, and he figures out that the Americans are supplying The with explosives. Hinh informs Fowler that Pyle works for the CIA. At Hinh's suggestion, Fowler invites Pyle to his house. Pyle brings his dog with him. Pyle defends The as someone who can inspire the people and stop the advance of Communism. Fowler arranges to meet Pyle at a restaurant that evening. We next see him sitting at the restaurant outdoors, and he watches Pyle cross a bridge with his dog. We next see Pyle kidnapped by Hinh's men with knives. Later, he escapes from them and is running away when he is re-captured by one of the men who stabs him to death. After seeing Hinh leave the area, Fowler leaves the restaurant. Later, the policeman suggests that Pyle had been to see Fowler because Pyles (also) murdered dog had cement from the floor of Fowlers house on its paws. Fowler tells the police that he didnt kill Pyle, and \"there is a war on and people are dying every day.\" It is not clear whether Fowler set up the murder to help Hinh stop the CIA's involvement in Vietnam or to kill his girlfriend's lover, or (most likely) both.In the end, Fowler goes back to the dance hall and tries to get Phuong to dance with him. Phuong tells him to dance with someone else, until he tells her that he will never leave. Fowler says that he feels a need to apologize to someone, but Phuong says \"not to me, never to me.\" Afterwards, news headlines show the beginning and full-fledged advance of the American involvement in the Vietnam war. Its not clear whether we are supposed to think that Fowler's helping Hinh murder Pyle led to the American war in Vietnam."
        ],
        "summaries": [
          "An old British reporter vies with a young U.S. doctor for the affections of a beautiful Vietnamese woman.",
          "British Thomas Fowler enjoys his life in Saigon working as a reporter for the London Times, covering the war in Vietnam between the colonial French powers and the Communists, who seem to be winning the war. In the later stages of his career, he takes his job lightly now, filing stories only on occasion, and no longer doing field work. But most importantly, this posting allows him to escape from what he considers a dreary life in London, including an unsatisfying marriage to a Catholic woman, who will never grant him a divorce, which in turn allows him to have an affair with a young Vietnamese ex-taxi dancer named Phuong, whom he loves and would marry if he were able. Phuong's sister doesn't much like Fowler, if only because he cannot provide a stable future for her. His idyllic life is threatened when the head office suggests he go back to London. In this way, he decides to write a major story to prove to his superiors that he should stay in Saigon. In 1952, Fowler is called into the local Police Inspector's office to provide any information on his friend, thirty-ish American Alden Pyle, who has been found murdered. Fowler had met Pyle the previous year when he arrived in Vietnam to work as part of the American contingent in the Economic Aid Mission. Fowler and Pyle's relationship was not always harmonious, initially as Pyle admitted he too was in love with Phuong and wanted to marry her. That antagonistic relationship would extend to their professional lives, around Fowler believing that the story that would allow him to stay in Vietnam was the rise of a man named General Thé, and Pyle's belief that a third power should come in to take over Vietnam from both the French and the Communists. The question becomes whether Fowler knows more about Pyle's demise than he lets on to the Inspector.",
          "A stylish political thriller where love and war collide in Southeast Asia. Set in early 1950s Vietnam, a young American becomes entangled in a dangerous love triangle when he falls for the beautiful mistress of a British journalist. As war is waged around them, these three only sink deeper into a world of drugs, passion, and betrayal where nothing is as it seems.",
          "Saigon, 1952, a beautiful, exotic, and mysterious city caught in the grips of the Vietnamese war of liberation from the French colonial powers. New arrival Alden Pyle, an idealistic American aid worker, befriends London Times correspondent Thomas Fowler. When Fowler introduces Pyle to his beautiful young Vietnamese mistress Phuong, the three become swept up in a tempestuous love triangle that leads to a series of startling revelations and finally, murder. Nothing, and no one, is as it seems, in this adaptation of Graham Greene's classic and prophetic story of love, betrayal, murder, and the origin of the American war in Vietnam.",
          "Love, politics, and intrigue intermingle in this taut retelling of Graham Greene's classic tale of a disillusioned British journalist, an idealistic young American, and the beautiful Vietnamese woman that comes between them in 1950s Saigon.",
          "In Saigon, 1951, Thomas Fowler is an English journalist, married in England to a Catholic woman, and in love with a Vietnamese girl, Phuong. Thomas meets Alden Pyle in a bar. Pyle is a doctor working in an aid mission, and pretty soon, he falls in love with Phuong. Pyle offers her what Thomas is not possible to give, a marriage and escape of Vietnam. Meanwhile, the political situation in Vietnam is boiling, with the French trying to get control again of the country, the Communists trying to impose their system to the south, and the American secretly giving support to a third Vietnamese part."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Jy_NAIUBmFo8GYv0boMw",
        "_score": 11.80751,
        "title": "Hey Arnold! The Movie",
        "year": 2002,
        "genders": [
          "Animation",
          "Adventure",
          "Comedy"
        ],
        "score": 5.9,
        "directors": [
          "Tuck Tucker"
        ],
        "writers": [
          "Craig Bartlett",
          "Steve Viksten"
        ],
        "synopsis": [
          "The film begins with several shots of Hillwood showing the kids having fun and adults doing their usual routine until Sid notices construction workers demolishing a house. Arnold and Gerald are then seen walking back to the boarding house with a popped basketball after being beaten by 5th graders at a game. Before Arnold walks into the boarding house, he sees several of his neighbors making a fuss about something. One of the gathered neighbors Mr. Green, explains the commotion. He states that Mr. Scheck, the CEO of a real estate company called Future Tech Industries or FTi, wants to buy all the houses in Arnold's neighborhood so the urban development firm can convert them into a futuristic mall.According to the news, Mayor Dixie is already approving plans for the mall. This means that Arnold's neighborhood will be destroyed and everyone who lives there has to move away (which would also mean Helga would not see Arnold again or express her feelings to him). The neighbors state that they should do something about this. During the night, Helga discovers that her dad, Big Bob Pataki, is working with Nick Vermicelli (who had worked with Bob on previous occasions). Bob is revealed to be planning to build a store in Scheck's mall called \"Big Bob's Super Beeper Emporium.\" Helga points out to her dad that people are going to suffer if he builds his store. However, Bob counters by saying that if they leave the neighborhood alone, his store will not exist. He also insists that change is good (as does Scheck at various times in the film) and states that when his store is built, their family will be rich and Helga will be able to buy anything. The next morning, FTi puts up a huge electronic billboard across the street from the boarding house that shows the number of days until construction begins as well as several Future tech Industries ads featuring Scheck stating \"Out with the old, in with the new,\" \"Change is good,\" and \"I've seen the future, and the future is Future Tech Industries.\"Arnold rallies the neighborhood and hosts \"Blockapalooza,\" a block party held to protest against FTi. However, the permit allowing them to close a public street was stolen by Scheck's employees, and Blockapalooza was declared illegal. Arnold's grandmother was jailed for being hostile to the police suppressing the rally. She tries breaking out but keeps getting caught. As demolition day closes in, Gerald tells Arnold to stop looking on the bright side of things and that you cannot always win. Later, Arnold sees how this will effect the citizens as he sees the friendship between Sid and Stinky and the relationship between Mr. Green and his shop and how this will destroy his business.Later on, as the boarders begin packing, Grandpa tells Arnold the history of the boarding house, stating that it was first built in the 1700's and it was the site of the \"Tomato Incident\" (a parody of the Boston Tea Party) during the Revolutionary War. The residents at that time angry over the increase in British taxes for tomatoes. The locals fought the British soldiers by hitting them with the tomatoes, sending them running. Arnold realizes that if he can find a document proving the event happened, then the neighborhood will be declared a historical site and cannot be demolished. With Gerald reluctantly tagging along, Arnold manages to trace the document to FTi, though Scheck denies ownership of the document. Just as Arnold and Gerald are about to give up hope, the boarding house telephone rings, and a mysterious individual named \"Deep Voice\" reveals that Scheck is lying and the document is hidden in his vault, which Vermicelli has the key to. Gerald suggests going to a woman named Bridget who can provide them with the proper gadgets to do the job and sneak the key away from Vermicelli. Arnold and Gerald, now secret agents, follow Vermicelli to a bar, where they disguise themselves as employees. Arnold and Gerald use one of the gadgets to listen to what Vermicelli is saying. Vermicelli's voice is heard over the speakers, and people are confused and wonder about the key that Vermicelli had mentioned. Vermicelli gets angry and accidentally spills his drink. He demands that Arnold and Gerald clean up his mess and replace his drink. Arnold's fake mustache almost slips off, nearly revealing him to be a kid. They walk away, and before Vermicelli can figure out who they are, they leave the bar. Arnold and Gerald follow Vermicelli to his home outside of Hillwood and stay on top of his roof until he eventually falls asleep. Arnold straps himself to a rope to swing down and sneak the key. Gerald is holding on to it, but let's go when his watch beeps. Arnold almost falls down, but Gerald grabs it just in time. Vermicelli wakes up when Arnold's sweat touches his forehead, but luckily, he thinks that Arnold is an angel and goes back to sleep. Arnold gets the key and they leave the rooftop. Deep Voice gives them a call and gives them more information on what they need to do. The bus picks them up and they head to FTI. Big Bob, having read the fine print of his contract, finds that Scheck had taken control of 51% percent of his company in exchange for the right to build his beeper emporium, and takes his anger out on Vermicelli. They engage in a small fight before Bob is dosed in pickle juice (reminiscent of the Hulk) and knocked out. Vermicelli then realizes that the key was gone and alerts Scheck.Meanwhile, Grandpa Phil and the men at the boarding house are trying to develop a backup plan just in case Arnold fails to get the document. They have several ideas, but fight on their weaknesses. However, Phil gets an idea that works. They plan to wire the sewer tunnels beneath their street with dynamite. They would then ignite it and blow a huge hole in the ground so the Future Tech workers would fall in. Arnold and Gerald infiltrate the FTi building and locate several different vaults. When they finally unlock the right vault, they find the document missing. Scheck comes up from behind them, with the document in his hand. He reveals that his ancestor, who was the German leader of the British forces, was humiliated by the Tomato Incident. For generations, Scheck's family has been planning on regaining control of the city and get revenge against the boarders.Scheck then burns the document in front of them. His bodyguards then arrive to detain Arnold and Gerald, who manage to escape and split up. When Arnold is just about to give up hope, he receives another call from Deep Voice, and remembers that FTi has cameras everywhere. He manages to get a video of Scheck burning the document. However, security forces arrive, forcing Arnold to hide on the roof. Meanwhile, Gerald searches for a cab to take them back to the neighborhood. Arnold is then contacted by Deep Voice once again, who is then revealed to be Helga, who, after some pressing from Arnold, confesses her romantic feelings for him and kisses him at the top of the tower. They escape the building and meet Gerald on a city bus. But the driver Murray is unwilling to speed up until he realizes that his former flame lives near Arnold and that her house is going to be demolished. They then ensue into a high speed chase to get back to the neighborhood before Scheck, who is chasing after them in his car and trying to kill our heroes in anyway possible to prevent them from stopping his plans. Scheck tells his workers to let up the bridge so the bus can't cross, but they make the leap, and Murray becomes unconscious. Murray's foot is stuck on the gas pedal. Arnold tells Gerald that he must drive. Though reluctant at first, Gerald eventually is convinced that he must drive it, while Arnold and Helga control the other gears. They almost run over man walking across the street. Phil and the others are waiting with their explosives for FTi to begin taking the neighborhood down. The FTI workers are going to destroy the neighborhood with people still there and inside the buildings. Big Bob is in the area and discovers Phil's plan. Although Bob states they could do some serious jail time, he decides to help because Vermicelli double-crossed him.Meanwhile, Vermicelli's workers blow up the overpass to prevent Arnold, Gerald, Helga, and Murray (who is unconscious at the time) from getting to the neighborhood. However, a truck on the freeway that had a ramp on the back was stopped near the edge. The quartet ride the bus over the truck's ramp to jump the hole and make it to 33rd Street. Back at the neighborhood again, Grandma (who has escaped from jail) hijacks one of the bulldozers and destroys the rest. Soon, a rogue bulldozer and the city bus that Arnold, Gerald, and Helga are on collide. The three kids come out okay a few moments later. Mayor Dixie arrives and Bridget gives Arnold a VCR to show the tape of Scheck burning the document. Bridget hooks it up to the big Scheckivision screen and Arnold shows Mayor Dixie the tape, who then proceeds to claim the neighborhood as a historical landmark. The citizens of the neighborhood cheer for Arnold and Gerald for their bravery and for saving the neighborhood.Scheck then arrives but is dismayed by the incriminating evidence. He gets into his car and tries to run over Arnold and Gerald, only to find that Grandma stripped his car of its wheels. He is then arrested for his crimes and Big Bob gets in another fight with Vermicelli, knocking him out. Arnold's neighbor Harold is exhausted because the exploding freeway woke him up. He sits down on the button that ignites Phil's explosives. The explosives beneath the streets ignite, destroying the FTi billboard. Phil and the boarders run away from the police, and Murray reunites with his ex-girlfriend Mona. As Arnold and Helga watch them, they begin talking about the events of that night and agree that it was all \"in the heat of the moment.\" (As neither of the two were ready to deal with the fallout of the confession.) Arnold and Gerald do their handshake and talk about how they saved the neighborhood. Arnold reminds Gerald that their ball is flat, but Gerald tells him that it's just a little low on air. Arnold questions Gerald's positivity, and Gerald tells him that somebody had to do it, just like Arnold said to him at the beginning of the film. The movie ends with Helga running cheerfully as Eugene sings a song about the neighborhood being saved, but Gerald interrupts the song and tells him that the show is over."
        ],
        "summaries": [
          "Arnold and company must recover a stolen document needed in order to prevent the neighborhood from being bulldozed.",
          "When a powerful developer named Mr. Scheck wants to knock down all the stores and houses in Arnold's neighborhood to build a huge \"mall-plex\", it looks likes the neighborhood is doomed to disappear. But with the help of a superhero and a mysterious deep-voiced stranger, Arnold and Gerald will need to recover a crucial document in order to save their beloved neighborhood.",
          "When corrupt developer Schek threatens to buy the run-down urban neighborhood where a fourth grader Arnold lives, and now Arnold and his cool-as-ice best pal Gerald are on the biggest mission ever to save their neighborhood as they go up against a powerful industrialist who invades the city and buys everything in sight so he can knock it down and erect a huge \"mall-plex.\" It's up to Arnold and Gerald to save their neighborhood before it's too late and they'll have to move somewhere else. But with the help of of a superhero and a mysterious deep-voiced stranger, Arnold and Gerald will need to recover a crucial document in order to save their beloved neighborhood at all costs.",
          "Arnold and Gerald must uncover an important document in order to save their neighborhood from a greedy developer. Sheck plans on destroying the neighborhood so that he can make a mega mall. With the future of their neighborhood at risk, Helga conspires against her father to help Arnold and Gerald. At the same time; Phil and the boarders, along with Big Bob (after realizing he will be swindled by Sheck) try to stop the construction crew from wrecking the neighborhood."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "dy_NAIUBmFo8GYv0bnot",
        "_score": 10.737234,
        "title": "Lamerica",
        "year": 1994,
        "genders": [
          "Comedy",
          "Drama"
        ],
        "score": 7.4,
        "directors": [
          "Gianni Amelio"
        ],
        "writers": [
          "Gianni Amelio",
          "Andrea Porporati",
          "Alessandro Sermoneta"
        ],
        "synopsis": [],
        "summaries": [
          "Immediately after the fall of communism in Albania, two Italians go there to embezzle investment money by creating a fake company. As the chairman/fall guy, they pick a former political prisoner who turns out to be more than meets the eye.",
          "Two Italian racketeers come to Albania just after the fall of the communists to set up a fictive firm and pocket the grants. They need a stooge. They choose an old one in a jail : Spiro. But the youngest italian, Gino, once alone with Spiro, encounter a few problems. Far from his roots, loosing his identity in deep Albania, he begins to change...",
          "This movie depicts a lesson of history before, during and after Mussolini, a transition between socialism and communism, poverty and early technology in the humanity's timeline. It's a beautiful compilation of both worlds, Italy and Albania, on social conditions, promise of a better future, business partnership, adaptation to a new world. Characters speak either Italian or Albanian or both. Spiro Tozaj, the Albanian name of a dual character, is a political prisoner - a true Italian World War II prisoner who admits he deserted to be with his family - lost track of time and events of the world. In his mind, he still has a boy, Giovanni, of 3-4 years old, and a wife, Rosa. In reality, about 50 years have elapsed. Originally from Sicily, he ended up in an Albanian prison and eventually, a home for elderly people. The racketeers are erroneously recruiting him thinking he's an honest Albanian with no relatives, the perfect candidate for business, giving hope to local Albanians for an honest business of a shoes company, Alba Calzature, a money laundering business. While Gino, the Paisa' (short for 'paisano', peasant, as Spiro calls him) starts an adventure on Albanian territory trying to bring the old man to Italy, he learns that his true name is Michele Tallaricoof, a Sicilian. Personal trouble comes upon both when they separate, the old man almost losing his life in an incident where children almost asphyxiated him with smoke. As he's trying to move on towards Italy, other incidents along the way make the characters grow, communicate and discover true introspection into what life really is. Roles shift onto making the old man become the wise one who finally speaks and gives words of wisdom to the young ones. Trouble comes Gino's way when the business falls apart and he ends up in a jail himself. His precious freedom is negotiated for the head of a corrupt Albanian, Dr Kruja - Mr Croce - and his eventual departure to America brings Gino new endeavors, hopes, dreams and introspection into his own solitude. God made both Catholics meet again on the ship to America where they realize they need each other the most."
        ]
      }
    ]
  }
}
