{
  "took": 304,
  "timed_out": false,
  "_shards": {
    "total": 1,
    "successful": 1,
    "skipped": 0,
    "failed": 0
  },
  "hits": {
    "total": {
      "value": 26,
      "relation": "eq"
    },
    "max_score": 31.485577,
    "hits": [
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "mkxi84QBEuMZ1zZ3rFdi",
        "_score": 31.485577,
        "title": "Waking the Dead",
        "year": 2000,
        "genders": [
          "Drama",
          "Mystery",
          "Romance"
        ],
        "score": 6.5,
        "directors": [
          "Keith Gordon"
        ],
        "writers": [
          "Scott Spencer",
          "Robert Dillon"
        ],
        "synopsis": [
          "The first scene of the movie introduces Fielding Pierce (Billy Crudup) as he is watching news footage showing that Sarah Williams (Jennifer Connelly) has been killed in a suspected car bombing. The reporter indicates that Sarah was an activist from Chicago involved in helping refugees from the Chilean government and that her death may cast new light on the movement. Fielding is completely distraught over hearing this news and the movie begins.The first 3/4 of the movie unfolds on parallel timelines in the 70s and early 80s: the progression of Fielding & Sarah's complicated, volatile relationship and Fielding's ascension into power as an upcoming politician dealing with the recent loss (and haunting memories) of Sarah.Fielding meets Sarah as he is returning, in uniform, from duty in the Coast Guard and meeting up with his brother, who is a editor. The brother, Fielding and Sarah all go to lunch where Fielding is very ouspoken in his political ideals about current events. Sarah and Fielding are both immediately intrigued by each other, Fielding's attraction being more sexual and blatant and Sarah's attraction more of curiousity and intrigue. A few dates quickly lead to a sexual relationship despite an obvious difference in political thinking between the two. Sarah asks why Fielding wants to be a senator and his very serious reply is that he doesn't- he wants to be president. Sarah is later quoted as saying \"Ambition is the ice in the lake of emotion.\" And when Fielding tries to comfort Sarah's fear of his Coast Guard duty leading to a Vietnam tour, she replies \"but if you go over there, you'll be shooting at the guys that I want to win.\" Their intense love outweighs their differences, though, and their relationship quickly becomes serious.Meanwhile Fielding is a young politician being groomed to be congressman by the current govenor because of a scandal involving Jerry Carmichael 's (Ed Harris in a cameo role) resignation due to his homosexuality. Fielding seems ambivalent about the offer to be put on the ticket, perhaps because of the nature of the resignation- as he indicates- or pehaps because of the impact of Sarah's influence on his current ambitions. Either way, the governor and his top advisor Isaac (Hal Holbrook) are not comfortable with this lack of enthusiasm and do not offer much hand holding. This confrontation sets the tone for the later timeline in Fielding's life as his insecurities and haunting memories of Sarah eventually lead to hallucinations and his emotional breakdown. Fielding is now dating Isaac's daughter, but their relationship is clearly not as intense as his past relationship with Sarah. Conversations with his sister Caroline (Janet McTeer) and visits with his dad quickly lead to discussions about Sarah and how is haunting memories are leading to him seeing Sarah again. His family is supportive without offering any helpful advice other than to focus more on the political path ahead of him.Sarah and Fielding's relationship takes them to Chicago where they share an apartment as he continues law school and she begins missionary work for a local church led by Father Steven (John Carrol Lynch). Fielding's involvement with Isaac soon begins, and Sarah's aversion to the whole political process becomes more threatening. After a uncomfortable encounter with Sarah at one of Fielding's political events, where her disdain for the situation leads to a verbal attack on one of the attendees, they attempt to reconcile on the subway afterwards. They cannot reach an agreement and she proclaims \"It is so infuriating loving you!\" Fielding chuckes and says that the feeling is mutual. Sarah's long hours away from home, spent working at the church, lead Fielding to foolishly suspect Sarah is having an affair with Father Steven. Their intense bond holds them together through their disagreements and insecurities.Fielding starts the campaign trail even as his memories of Sarah convince him that she may still be alive and is watching him. He even chases someone he believes to be her through town and eventually ending at a church. But his search is fruitless and only further shows his descent into emotional breakdown. His relationship with Molly becomes troubled as he emotionally withdraws from her also. When she tries to reach to him, he does not offer any recognition of her or his feelings.Sarah's missionary work leads to activist work in Chile where her and Father Steven bring back political refugees of the government. At one uncomfortable dinner at the church with Fielding. The refugees are appalled to hear that Fielding is hoping to enter politics, an american institution they feel is overrun with corruption. Fielding tries to convince them he is not entering politics to become corrupt but to affect change. They are not conducive to this idea. He chastises their hypocrisy by observing that as awful as they try to hint his government is, he can't help but to notice when they needed help they ran to this country for freedom. When he turns to Sarah for help, she offers \"You are alone in this conversation.\" Fielding then replies he is alone in this whole room and he is \"choking on the collective sense of superiority.\" Fielding and Sarah's political difference and growing distance is shown at its worst, as no make up scene follows. Soon after Sarah leaves for her fatal trip in Milwauke."
        ],
        "summaries": [
          "A congressional candidate questions his sanity after seeing the love of his life, presumed dead, suddenly emerge.",
          "Fielding Pierce lives the life of an aspiring politician - in 1972 he's serving in the Coast Guard (trying to avoid Vietnam in the most honorable way), and by 1973 he has entered law school. Along the way he falls in love with Sarah, a fiercely idealistic woman who devotes her life to helping others - unfortunately she's killed in an explosion while assisting members of the Chilean resistance. Nine years later, in the middle of a congressional election, Fielding is suddenly flooded with thoughts and visions of his lost love."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ykxi84QBEuMZ1zZ3rFRh",
        "_score": 28.852114,
        "title": "Timecop",
        "year": 1994,
        "genders": [
          "Action",
          "Crime",
          "Sci-Fi"
        ],
        "score": 5.9,
        "directors": [
          "Peter Hyams"
        ],
        "writers": [
          "Mark Verheiden",
          "Mike Richardson"
        ],
        "synopsis": [
          "In 1863, Confederate soldiers are carrying a gold bullion as a payday for the army. Suddenly, they are cornered and shot by a highwayman using anachronistic automatic pistols and futuristic tech equipment, leaving them stranded and dead. The mysterious highwayman steals the trunk containing the gold and then suddenly vaporizes into a gelatin like mist.In 1994, 131 years later in Washington DC, the U.S. government creates the Time Enforcement Commission (TEC) to combat the misuse of newly developed time travel technology. They have discovered that the same gold bullion was used in recent arms purchases. The TEC is to detect \"time ripples\" among the time-lines and to stop them from happening before they reach the present, since people cannot travel forward in time to the future, they always travel back to either change history or steal riches. (Note: the mysterious highwayman who killed the Confederate soldiers in 1863 to steal their gold is never seen again or identified). Senator Aaron McComb (Ron Silver) volunteers to fund and oversee the commission.Meanwhile, police officer Max Walker (Jean Claude Van Damme) is offered a job as a TEC agent. He meets his wife Melissa (Mia Sara) at a local shopping mall where he stops a purse snatcher. He notices three odd-looking punk men following them despite never seeing them before. Walker and Melissa go home to their large fancy house and later make love.Later that same evening, Max is attacked in his home by the same intruders he saw earlier at the mall and Melissa is killed in an explosion, destroying his house.Ten years later in the year 2004, Walker is now a veteran TEC Agent. He is sent back to October 1929, in the midst of the Wall Street crash to arrest his former partner Atwood (Jason Schombing) for taking advantage of the U.S. stock-market crash. After subduing Atwood's bodyguards, Walker interrogates Atwood who reveals that he is working for Senator McComb, who needs money for his presidential campaign. Terrified by McComb's threat by sending hit-men back in time to murder his ancestors, thereby wiping out his existence, Atwood tries to kill himself by jumping out a window. Walker catches him as he falls and takes him back to 2004, but Atwood refuses to testify against McComb and the TEC agency sends him back to 1929, right where he left off, this time falling to his death.Senator McComb arrives at the TEC agency to oversee the work and to congratulate Walker for his recent successful mission. Walker implies to McComb that he knows all about his dirty dealings behind the scenes in Washington and about his means to acquire money for his campaign. McComb leaves the facility and orders his aide to have Walker killed. The next morning, two assassins break into Walker's small apartment and attempt to kill him, but Walker, a trained martial arts expert, kills both assassins after a violent and protracted fight.While still trying to investigate McComb to expose him of corruption, Walker is partnered with agent Sarah Fielding (Gloria Reuben), and sent back to 1994 to investigate a pending ripple, where they find a young Senator McComb arguing with his business partner Jack Parker about their company's new computer chip. Parker offers to buy McComb's share of the company, but suddenly, the older McComb arrives from 2004 to warn his younger self that the chip will make huge profits. A fight starts when Walker is double-crossed by Fielding, who reveals she works for McComb. McComb kills Parker, wounds Fielding, attempts to kill Walker, and manages to escape back to 2004.When Walker returns to 2004, he finds that things have become worse. McComb now owns the computer company, with no record of Parker. He is almost guaranteed the Presidency with his finances and approval rating. The TEC is being shut down due to budget cuts. There is also no record of Fielding. Realizing that he has to fix things, Walker hijacks the original prototype time machine (which McComb had been using for their illegal trips) with the help of Commander Matuzak (Bruce McGill), who sacrifices himself when McComb's men try to stop Walker from escaping.Finding himself once more in 1994, Walker finds Fielding in the hospital, where she agrees to testify against McComb. Whilst trying to find Fielding's DNA from a blood sample in the lab, Walker finds a sample of Melissa's blood and it indicates she is pregnant. Walker realizes her death occurred later that night, and he decides to stop it. After going back to Fielding's room, he discovers that she has been murdered and he is framed as the prime suspect.He goes to the mall where he and Melissa met that night. Eventually, Max Walker finds her and manages to convince her he is from the future. He also sees the three thugs who attacked him and realizes that they are McComb's men whom were sent back to kill him before he joined the TEC.That evening, McComb's thugs break into Walker's home, like before, only this time the older Walker is waiting for them. Without his younger self realizing it, the older Walker helps to fight off the bad guys. Together, they and Melissa win, though the younger Walker is wounded. The 2004 McComb then takes Melissa hostage. When the older Walker finds McComb is holding Melissa, the corrupt senator then sets a time bomb. He then shoots Melissa, just before the young McComb appears, having been tricked into coming to the house by a fake message from Walker. Walker grabs the young McComb and pushes him into the older one, causing them to become a writhing, screaming mass which melts into nothingness (since according to the time theory, no two persons can exist by physically touching each other).Walker carries the wounded Melissa out of the house just before the bomb explodes, destroying the house just like before. He lays the unconscious Melissa beside his younger self and leaves the scene before the local police and fire department arrives. Walker returns to 2004, and the time-line has been corrected. The TEC still exists, Fielding and Matuzak are alive, and McComb does not exist, having \"vanished\" ten years earlier. As Walker returns home, he is happily shocked to find himself living in the same house which was rebuilt. Melissa is alive and their nine-year-old son is waiting to greet him. As Walker walks into the house for dinner Melissa has something to announce to Walker... implying that she is pregnant again."
        ],
        "summaries": [
          "Max Walker, an officer for a security agency that regulates time travel, must fend for his life against a shady politician who's intent on changing the past to control the future.",
          "When the ability to travel through time is perfected, a new type of law enforcement agency is formed. It's called Time Enforcement Commission or TEC. A cop, Max Walker, is assigned to the group. On the day he was chosen, some men attack him and kill his wife. Ten years later Max is still grieving but has become a good agent for the TEC. He tracks down a former co-worker who went into the past to make money. Max brings him back for sentencing but not after telling Max that Senator McComb, the man in charge of TEC, sent him. Max has his eye on McComb.",
          "When time travel was developed by a scientist in 1994, there was the need to create the Time Enforcement Commision (TEC) under the control of Senator Aaron McComb to protect the past from modifications. The police office Max Walker is invited to join the TEC, and when his wife Melissa is murdered by strangers, he accepts the invitation to work under the command of Eugene Matuzak. In 2004, Walker is assigned to capture his former partner Lyle Atwood that is manipulating the stock market in 1929. Atwood tells that he is working for Senator McComb, who is a powerful politician that is running for president. Atwood prefers to die and does not confess that McComb is a criminal. Now Max knows the truth but McComb is changing the past and Max does not know how stop him.",
          "To monitor the illegal use of time travel, the government founds the Time Enforcement Commission, a high-tech police department under Senator Aaron McComb's supervision. However, ten years later, in 2004, the devoted TEC agent, Max Walker, who is still reeling from the untimely and rather mysterious loss of his wife, is summoned to unearth a conspiracy which dates back in time. Will the haunted Timecop use this advanced technology to thwart the evil plans of the megalomaniac who is behind a string of hideous time-crimes? In the end, will Max tamper with the past to right the wrongs, no matter the cost?",
          "The perfection of time travel brings with it new opportunities for criminals. The government sets up a special police force (T.E.C.) to ensure the new technology isn't abused. Max Walker, one of these timecops learns of a corrupt politician's plot to become president using the device. Senator McComb discovers Walker on his trail and the real action begins--in Walker's own past!",
          "In Washington DC in 1994, the Senate Oversight Committee (SOC) is being spoken to in the capitol building by George Spota, who explains that for the past 20 years, Doctor Hans Kleindast, the Nobel laureate who help the government with the space program back in the 1960s and 1970s, has been doing research, and his field of research has been time travel. The SOC believes that Hans is a quack -- until George tells the SOC that Hans actually succeeded in his research and took a trip to the past then back to the present. You can't travel into the future because the future hasn't happened yet. George makes it clear that a covert agency is needed to police time travel, so the Time Enforcement Commission (TEC) is formed. Named as the director of the TEC is Commander Eugene Matuzak, formerly of the Washington DC police department. Senator Aaron McComb, who sees possibilities, agrees to chair the oversight on the new program. Sometime later, at a shopping center, TEC agent Max Walker and his wife Melissa are being watched by a pair of shady looking men. Later, at home. Max and Melissa spend some passionate time together. That night, Melissa is about to tell Max something extremely important when the phone rings. Max answers the phone and is told to go to TEC headquarters. Max gets dressed and as soon as Max opens the front door to go outside, he is attacked by the two men from the shopping center. As the two men are beating Max up. Max sees Aaron looking out the window of the bedroom that Melissa is still in, and Aaron is holding Melissa hostage, forcing Melissa to watch Max's beating. The two men outside then shoot Max, who is wearing a bulletproof vest -- and then an explosion engulfs the house, killing Melissa. On October 30, 1929, on Wall Street in New York City, a man named Lyle Atwood enters an office building and rides an elevator up to an office. There is a sudden ripple in the office, and Max enters from the future. It turns out that Lyle is Max's partner, and Lyle is planning to stop the depression from happening. Max wants to know who Lyle is working for, and Lyie calls two security men into the office to deal with Max. Max beats up the two security men, and Lyle pulls out a gun and opens fire on Max. When Lyle runs out of bullets, Max forces Lyle to admit that he's working for Aaron, and that Aaron has paid off a lot of other TEC agents as well. Lyle then jumps out the window. Max jumps out after Lyle, grabs him, and takes Lyle with him back to present time, which is now the year 2004, ten years after Melissa's murder. TEC judge Marshall sentences Lyle to be immediately executed, so Lyle is sent back to 1929 and is dropped to his death from the point in midair where Max and Lyle disappeared to 2004. At TEC Headquarters in 2004, Aaron, Max, and Matuzak are showing Senator Malcolm Nelson around the TEC building. Aaron reminds everyone that people who go back in time risk coming into contact with a past version of themselves. The same matter cannot occupy the same space at the same time, because if that happens, and if it's a person accidentally making physical contact with their past version, that person will die, and their body will disappear from the face of the Earth. Later, Max tells Matuzak that Aaron wants to shut down the TEC so no one can stop him from altering the past to his advantage, because Aaron is now running for President of the United States. Aaron's fading campaign for president is dealt a blow when he is denied federal campaign matching funds. Just before Max wakes up, two men break into his home to kill him, but Max turns the tables and kills the two men who broke in. TEC internal affairs investigator Sarah Fielding questions Max. Max soon learns that Sarah may be on the wrong side in this. Max must travel back and forth in time to bring Aaron down...and when Max goes back to 1994 and finds out what Melissa wanted to tell him 10 years ago, it gives Max incentive to at least try to prevent Melissa's murder."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "LExi84QBEuMZ1zZ3rF1k",
        "_score": 25.841839,
        "title": "The Foreigner",
        "year": 2003,
        "genders": [
          "Action",
          "Thriller"
        ],
        "score": 3.4,
        "directors": [
          "Michael Oblowitz"
        ],
        "writers": [
          "Darren Campbell"
        ],
        "synopsis": [],
        "summaries": [
          "A freelance agent must transport a package for a mysterious employer, leading him into a web of betrayal and deceit.",
          "Jonathon Cold is a freelance agent hired by a mysterious man to deliver a package from France to Germany. The contents of the package remain undisclosed, even between employer and employee, but whatever it contains seems to be attracting a swarm of political corruption, backstabbing bad guys and murder. However, Cold knows he must stay one step ahead of the evil powers at work, whoever they are, no matter what the cost, as it increasingly becomes a game of step on or be stepped on.",
          "Jonathan \"Jon\" Cold is a former \"foreigner\", or deep cover operative, who now works as a freelance agent. He is frequently commissioned to deliver high-risk packages. As Cold prepares for his father's funeral, Alexander Marquet asks him to take on an assignment. Cold wants to leave the business, but he reluctantly accepts the job. Cold's task is to take a mysterious package from France to a wealthy man in Germany. But Cold will soon find that there are a lot of people who are determined to prevent him from doing so. Cold is accompanied by his colleague Dunoir to a farmhouse to pick up the package, and they are attacked by assassins. Cold fights them off and decides to continue with the assignment. Leaving Dunoir behind in France, Cold heads for his father Jackson's memorial service in Warsaw, Poland, and meets up with his brother Sean before continuing on to Germany. The package turns out to contain a \"black box\" flight recorder from an aircraft that was suspiciously downed, and the recipient -- sinister industrialist Jerome Van Aken -- has a vested interest in its whereabouts. Once Cold arrives in Germany, Cold discovers that he is being pursued by various agents and assassins, while Van Aken's wife Meredith and CIA spook Jared Olyphant also seem to want to get their hands on the package."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "c0xi84QBEuMZ1zZ3rGhn",
        "_score": 25.17309,
        "title": "Gangster Squad",
        "year": 2013,
        "genders": [
          "Action",
          "Crime",
          "Drama"
        ],
        "score": 6.7,
        "directors": [
          "Ruben Fleischer"
        ],
        "writers": [
          "Will Beall",
          "Paul Lieberman"
        ],
        "synopsis": [
          "note: work in progressIn 1949 post-WWII Los Angeles, gangster Mickey Cohen (Sean Penn) has become the most powerful figure in the California criminal underworld, and intends to continue to expand his criminal enterprise across the Western United States, forcing out his rivals in Chicago. The police have not been able to stop Cohen's ruthless rise, as Cohen has eliminated witnesses and bribed both the courts and the police, controlling both illegal and legal sides of L.A.The movie opens as Cohen has a gangster from Chicago killed by shackling him to two cars, which then proceed to rip him in half. He warns the gangster's partner to return to Chicago with news of what he's seen.The next day, Sgt. John O'Mara (Josh Brolin) and his partner are at Los Angeles Union Station when they see one of Cohen's thugs, Mitch, approach a young woman and tell her he is holding auditions, and hands her a card to convince her he is legitimate. O'Mara realizes, however, that Mitch intends to rape her. They tail him to a building that is owned by Cohen. O'Mara's partner refuses to enter, forcing O'Mara to go inside by himself.O'Mara enters the building, telling the man that he is meeting someone. He gets on an elevator, accompanied by two thugs. Things go sour, though, when one of them sees his handcuffs and realizes that O'Mara is a cop. A fight breaks out, during which one henchman is killed and another loses his hand. O'Mara finds the room where the girl is being held captive. He bursts in and after a brawl, subdues the three men and rescues the girl.Although the gangsters are arrested, they are set free on a corrupt judge's order, and Cohen subsequently has them killed by locking them up in an elevator and burning down the building.O'Mara is personally selected by Chief Bill Parker (Nick Nolte) due to O'Mara's special operations background and training at Camp X during World War II to wage guerrilla warfare on Cohen, dismantling his crime empire and forcing him out of Los Angeles. With the help of his reluctant and pregnant wife, Connie (Mireille Enos), O'Mara recruits fellow officers in his squad. Initially he is joined by hard-headed detective Coleman Harris (Anthony Mackie), wire-tapper Conway Keeler (Giovanni Ribisi), and legendary gangster-killer Max Kennard (Robert Patrick). Kennard's partner, Navidad Ramirez (Michael Peña), follows the squad and they reluctantly allow him to join. Sgt. Jerry Wooters (Ryan Gosling), O'Mara's close friend, turns down the offer, as he is disillusioned from the war and his time on the police force.Wooters has been keeping close to his old friend Jack Whalen (Sullivan Stapleton), who is his informant from within Cohen's operations. After meeting for drinks, Wooters becomes infatuated with Cohen's etiquette coach and girlfriend Grace Faraday (Emma Stone). Wooters and Grace begin a secret romantic relationship. After Cohen orders a hit on rival Jack Dragna (Jon Polito) that results in the death of Pete (Austin Abrams), an innocent boy Wooters knew, Wooters becomes motivated to take down Cohen. He saves O'Mara's squad after an unsuccessful hit on one of Cohen's casinos, and later joins them.With organization and better planning the unit strikes several successful blows at the heart of Cohen's criminal organization. The media refer to them as \"The Gangster Squad\". After wire-tapping Cohen's house, Keeler deduces the central location of Cohen's wire gambling business, the heart of his empire. The squad successfully burns down the business, but Cohen's men inform him that they didn't take any of his money. Cohen believes they are a group of honest cops, and believes someone ratted him out and tapped his house. As his men sweep the house for bugs, Grace runs away, fearing Cohen knows of her relationship with Wooters.The Gangster Squad is lured into a trap in Los Angeles's Chinatown by Cohen's head hitman Wrevock (Troy Garity), who was also responsible for Pete's death. Wooters interrupts the ambush just in time to save O'Mara, but Wrevock escapes. Karl Lennox (Holt McCallany), Cohen's right-hand man, kills Keeler in the unit's operation. Wooters asks Whalen to get Grace out of town, but Cohen reaches him first, looking for Grace, and kills him. O'Mara's house is later hit by a drive-by, and Connie gives birth to their son under the stress. Chief Parker tells O'Mara that, as a result of their failure, their careers with the LAPD are over. O'Mara gets Connie out of town, but refuses to leave with the job unfinished. Grace tells Wooters she is willing to testify against Cohen for Whalen's murder, prompting O'Mara, along with the remaining members of his unit, to go to the Park Plaza Hotel to arrest Cohen.Cohen and his men engage in a firefight with the police unit, with Wooters being wounded in the process after killing Wrevock. Cohen and Lennox escape, but O'Mara pursues them, which results in their vehicle crashing into a fountain. Kennard gets shot by Lennox, but manages to kill him with help from Navidad, before dying from his wounds. O'Mara prepares to arrest Cohen, but Cohen tempts him into fighting each other in a bare-knuckle boxing match, while a crowd of onlookers and journalists gather. O'Mara finally beats Cohen and has him arrested, ending his reign as a crime boss and the spread of the mafia into the Los Angeles area. The Gangster Squad was never mentioned in taking down Cohen, their surviving members remaining a secret. Cohen is sentenced to 25 to life, and is welcomed violently by Whalen's friends. Grace and Wooters continue their relationship, while Navidad and Harris become partners on the force. O'Mara quits to live a quiet life with his wife and son"
        ],
        "summaries": [
          "It's 1949 Los Angeles, the city is run by gangsters and a malicious mobster, Mickey Cohen. Determined to end the corruption, John O'Mara assembles a team of cops, ready to take down the ruthless leader and restore peace to the city.",
          "It's 1949 Los Angeles, and gangster Mickey Cohen has moved in, with the intention of controlling all criminal activity in the city. He has bought local judges and police, and no one is willing to cross him or testify against him. Everyone except Sergeant John O'Mara, a former World War II soldier, whose goal is to settle with his family in a peaceful Los Angeles. Police Chief William Parker decides to form a special unit whose mission is to take down Cohen, and chooses O'Mara to lead the unit. O'Mara chooses 4 cops and asks another cop and vet, Jerry Wooters to join him but Wooters is not interested. After Wooters witnesses the murder of a young boy by Cohen's people, he joins them, and they decide to take apart Cohen's organization. Cohen wonders if a rival is going after him, eventually he realizes it's the cops.",
          "1949 Los Angeles. Boxer turned mobster Mickey Cohen, who had been working in Chicago with some other mobster associates, has moved his operation to Los Angeles. He plans to take control of the city, in the process squeezing out all competition by whatever means, usually by violence. In being able to achieve this, Cohen has many in Los Angeles area authority in his back pocket. LAPD Chief Bill Parker asks Sgt. John O'Mara to assemble and lead an unofficial, off-the-books squad to deal with the Cohen problem. Parker makes this request specifically to O'Mara because of O'Mara's previous handling of some cases associated with Cohen's operations. O'Mara and the squad are not to kill Cohen - which would only lead to someone else taking over - but rather disable all his operations in such a way no other mobster would consider coming in. Although she doesn't much like this assignment, O'Mara's loving and very pregnant wife, Connie, convinces her husband that he needs to recruit others with specialized skills as opposed to clones of himself which was his original thought, her advice all in an effort to make sure he comes home alive as a father at the end of it all. O'Mara will have to control the disparate group he has assembled in working toward their common goal. One issue he will have to deal with is the fact that one of his colleagues, Sgt. Jerry Wooters, who has lost his professional drive, has just embarked on affair with Cohen's girlfriend, Grace Faraday, the two whose lives would be in danger if Cohen ever found out. As O'Mara and his team plow ahead without a clear plan, they may encounter problems in finding out who indeed is in Cohen's back pocket, and as they can't ask for any assistance from anyone outside of the squad as being \"unofficial\". Nonetheless, they may be able to continue progressing to their end goal as long as Cohen does not know who they are, namely that they are LAPD undercover. If they are ever discovered, it may not only compromise their work, but may place their lives, and that of their loved ones, in mortal danger.",
          "Having earned the respect of the Italian mob in 1949 Los Angeles, the brutally ambitious Brooklyn-born former professional boxer, Mickey Cohen, and his ruthless gang have spread their tentacles throughout the bustling city. Enjoying a preposterous immunity, and the ample protection of the local police and the corrupt politicians, Mickey brags about how he can dine with judges and police chiefs, who holds them in the palm of his hand, leaving the field clear for Cohen to enforce his omnipotence undisturbed. However, not if a small, top-secret LAPD task force can help it. Now, the brave and honest men of Sgt. John O'Mara and Jerry Wooters dice with death to bring down the vicious gangster's thriving criminal empire. Can L.A.'s Gangster Squad stop Mickey Cohen's reign of terror?"
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "lSJW84QB_Hoamgc57JQY",
        "_score": 23.495739,
        "title": "Getting Back to Abnormal",
        "year": 2013,
        "genders": [
          "Documentary",
          "Comedy",
          "Drama"
        ],
        "score": 7.6,
        "directors": [
          "Louis Alvarez",
          "Andy Kolker",
          "Peter Odabashian"
        ],
        "writers": [],
        "synopsis": [],
        "summaries": [
          "'Getting Back To Abnormal' is an intimate look at race, politics and culture in post-Katrina New Orleans. Five years after the storm, New Orleans has changed. It is less black and less poor, and one polarizing white politician has become a lightning rod for all things racial. Councilperson Stacy Head, a self-styled corruption fighter, takes her sometimes jaw-droppingly politically incorrect style into the tribal world of New Orleans politics as she fights to maintain her seat in a black majority district. Weaved into the narrative are stories about housing, and commentary from only-in-New Orleans armchair philosophers."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "W0xi84QBEuMZ1zZ3rHBq",
        "_score": 23.495739,
        "title": "Getting Back to Abnormal",
        "year": 2013,
        "genders": [
          "Documentary",
          "Comedy",
          "Drama"
        ],
        "score": 7.6,
        "directors": [
          "Louis Alvarez",
          "Andy Kolker",
          "Peter Odabashian"
        ],
        "writers": [],
        "synopsis": [],
        "summaries": [
          "'Getting Back To Abnormal' is an intimate look at race, politics and culture in post-Katrina New Orleans. Five years after the storm, New Orleans has changed. It is less black and less poor, and one polarizing white politician has become a lightning rod for all things racial. Councilperson Stacy Head, a self-styled corruption fighter, takes her sometimes jaw-droppingly politically incorrect style into the tribal world of New Orleans politics as she fights to maintain her seat in a black majority district. Weaved into the narrative are stories about housing, and commentary from only-in-New Orleans armchair philosophers."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "8CJW84QB_Hoamgc57HkJ",
        "_score": 23.470823,
        "title": "City Hall",
        "year": 1996,
        "genders": [
          "Crime",
          "Drama",
          "Mystery"
        ],
        "score": 6.2,
        "directors": [
          "Harold Becker"
        ],
        "writers": [
          "Ken Lipper",
          "Paul Schrader",
          "Nicholas Pileggi"
        ],
        "synopsis": [
          "This complex 1996 drama directed by Harold Becker (Sea of Love) attempts to explore big-city corruption and the flexibility of what's right and wrong in the political arena. John Cusack plays the senior aide to mayor John Pappas (Al Pacino), a popular and seasoned politician whose administration is threatened when what seems to be an accidental shooting of a child reveals a nest of corruption and lifelong personal debts. This tests Cusack's loyalty to the man he thought he knew. Pacino turns in a finely textured performance as a man who has his own lofty ideals, but whose pragmatism sets in motion a series of events with tragic results. Cusack admirably captures the essence of someone polished and savvy at his job but must cope with fundamental disillusionment. This political thriller suffers at times from a lack of focus, but still offers an insightful and poignant treatise on the quagmire of politics in the modern age and the human toll it sometimes exacts."
        ],
        "summaries": [
          "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.",
          "A young boy dies from a stray bullet during a shootout between a cop and mob family member who had previously been supiciously given probabtion, only to break its terms. New York's Deputy Mayor, Kevin Calhoun starts digging for information.",
          "One seemingly routine morning, a little boy is shot dead in the cross fire between a drug dealer and a narcotics detective in a predominantly black New York City neighborhood. John Pappas, the idealistic mayor of the city, cleverly prevents a race riot, and everything seems to be OK. However, things get complicated again when Kevin Calhoun, Pappas's loyal chief of staff, who is even more idealistic than Pappas himself, begins to wonder why the drug dealer, who just happens to be the son of the local Mafia boss, was out on the streets in the first place after receiving a sentence of five year's probation for a conviction which would normally warrant a 10 to 20-year jail term. Further complicating matters is Marybeth Cogan who represents the widow of the narcotics detective. She is trying to find out why the pension for the cop is being withheld and she brings Calhoun deeper into a scandal that makes him take a second look at what he once took for granted."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "tkxi84QBEuMZ1zZ3rFVh",
        "_score": 23.470823,
        "title": "City Hall",
        "year": 1996,
        "genders": [
          "Crime",
          "Drama",
          "Mystery"
        ],
        "score": 6.2,
        "directors": [
          "Harold Becker"
        ],
        "writers": [
          "Ken Lipper",
          "Paul Schrader",
          "Nicholas Pileggi"
        ],
        "synopsis": [
          "This complex 1996 drama directed by Harold Becker (Sea of Love) attempts to explore big-city corruption and the flexibility of what's right and wrong in the political arena. John Cusack plays the senior aide to mayor John Pappas (Al Pacino), a popular and seasoned politician whose administration is threatened when what seems to be an accidental shooting of a child reveals a nest of corruption and lifelong personal debts. This tests Cusack's loyalty to the man he thought he knew. Pacino turns in a finely textured performance as a man who has his own lofty ideals, but whose pragmatism sets in motion a series of events with tragic results. Cusack admirably captures the essence of someone polished and savvy at his job but must cope with fundamental disillusionment. This political thriller suffers at times from a lack of focus, but still offers an insightful and poignant treatise on the quagmire of politics in the modern age and the human toll it sometimes exacts."
        ],
        "summaries": [
          "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.",
          "A young boy dies from a stray bullet during a shootout between a cop and mob family member who had previously been supiciously given probabtion, only to break its terms. New York's Deputy Mayor, Kevin Calhoun starts digging for information.",
          "One seemingly routine morning, a little boy is shot dead in the cross fire between a drug dealer and a narcotics detective in a predominantly black New York City neighborhood. John Pappas, the idealistic mayor of the city, cleverly prevents a race riot, and everything seems to be OK. However, things get complicated again when Kevin Calhoun, Pappas's loyal chief of staff, who is even more idealistic than Pappas himself, begins to wonder why the drug dealer, who just happens to be the son of the local Mafia boss, was out on the streets in the first place after receiving a sentence of five year's probation for a conviction which would normally warrant a 10 to 20-year jail term. Further complicating matters is Marybeth Cogan who represents the widow of the narcotics detective. She is trying to find out why the pension for the cop is being withheld and she brings Calhoun deeper into a scandal that makes him take a second look at what he once took for granted."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Q0xi84QBEuMZ1zZ3rE1e",
        "_score": 23.0043,
        "title": "The Boys in Company C",
        "year": 1978,
        "genders": [
          "Drama",
          "War"
        ],
        "score": 6.9,
        "directors": [
          "Sidney J. Furie"
        ],
        "writers": [
          "Rick Natkin",
          "Sidney J. Furie"
        ],
        "synopsis": [
          "August 1967Five young men arrive at boot camp somewhere in the USA among a bus load of other U.S. Marine recruits for Company C for their induction into the Vietnam War. The five young men make up of: Tyrone Washington (Stan Shaw), an African American drug dealer from Chicago, Illinois; Billy Ray Pike (Andrew Stevens), a volunteer from Galveston, Texas; Alvin Foster (James Canning), an aspiring writer from Emporia, Kansas; Vinnie Fazio (Michael Lembeck) a street punk from Brooklyn, New York; and Dave \"Jesus\" Bisbee (Craig Wasson), a hippie war protester from Seattle, Washington. Alvin keeps a journal of his experience with the hope of being published some day and befriends Vinnie on the bus to training camp.As the men are processed, all of their personal possessions (wallets, house keys, cigarettes, knifes, etc.) are confiscated, but Vinnie smuggles out Alvin's notebook and returns it to him. Alvin hopes to see combat so he can write about it. Once in the barracks, Tyrone warns the others to leave him alone.The next morning, training begins. Drill Sergeant Aquilla (Santos Morales) informs the recruits that if they do not ignore their racial prejudices and learn to rely on each other, they will not survive long in Vietnam. During training, Aquilla chastises Tyrone for not being a team player. Later, Vinnie notices some pretty girls and sneaks away. Billy also slips away to meet his girlfriend Betsy (Karen Hilger) who tells him she is pregnant. Billy encourages her to get an abortion because they are not ready to become parents.Back at training camp, Dave is shot in the arm as he attempts to desert and Alvin is accused of writing anti-American and anti-war propaganda; Vinnie, Billy, Dave and Alvin are sent to the brig for punishment. Their four replacements are racists and harass Tyrone, but when he complains to Sergeant Loyce (R. Lee Ermy), he is ordered to be cooperative because Loyce believes the young man's \"street smarts\" make him a natural leader. Loyce promises to bring Vinnie, Alvin, Dave and Billy back and transfer the racists out of the unit if Tyrone agrees to lead the company.In October, by the time training ends, Marine Company C has become a strong team and is assigned to Vietnam. Before they depart, Tyrone calls a drug dealer friend with a plan to smuggle back heroin. On their way to Vietnam, the soldiers meet their new commander, Captain Collins (Scott Hylands), who uses soccer to convey how the Viet Cong think.The company is under an enemy artillery attack as soon as their ship lands in Cam Ran Bay, South Vietnam and Collins volunteers the soldiers for a convoy to transport urgent materials to a field general. During the convoy, the company falls under an ambush attack by unseen Viet Cong and two men are killed and several more are wounded. When Dave is outraged to discover the \"urgent\" materials are cigarettes, liquor, food and other luxury goods, Collins insists he was not aware of their transport.The company makes it to the general's base and is rewarded with 24 hours R&R leave. As Vinnie and Alvin seek prostitutes, Billy is offered heroin by fellow soldiers and Tyrone talks to locals, hoping to find a drug dealing connection, but he is caught by the local military police and brought to Vietnamese Colonel Dong (Jose Mari Avellana), who accuses him of trafficking heroin. Dong is a drug trafficker himself and when he suggests that he and Tyrone become partners, Tyrone reveals his idea to smuggle the drugs in the body bags of dead soldiers.Later, Tyrone finds Billy overdosing on heroin and nurses him back to health, but he later berates his friend and fears he will put the company in danger. Meanwhile, Dave blows up the general's trailer of luxury goods as revenge. A little later, Vinnie discovers he has contracted a venereal disease from the local prostitutes and wonders why Alvin did not.When Company C is sent back into the combat area to replace another battalion, Captain Collins announces that the military's priority is obtaining a high body count of Viet Cong. In his effort to achieve the highest body count, Collins puts his troops in unnecessary danger, but is easy on Billy, because he is a great soccer player. Resentful, Tyrone disobeys Collins's orders during another Viet Cong attack but still manages to save the day. However, Collins punishes Tyrone by forcing him to lead his men into a dangerous rice paddy. There, Tyrone steps on a pressure release landmine and freezes in fear. Billy helps extricate Tyrone by replacing his weight with ammunition boxes. They both escape uninjured, but Tyrone is furious.One day, the company comes under another ambush attack by unseen Viet Cong on a river crossing bridge. When the enemy departs, the insane Collins orders an artillery attack on a village but Dave refuses to follow his order out of his worry of killing local civilians. Collins' more level-headed and sympathetic second in command, Lieutenant Archer (James Whitmore Jr.), sides with Dave and thinks it is unnecessary to launch any attack with poor knowledge of the area or about the enemy. Eager to increase his body count, Collin leads the attack himself; however, they discover only women and children in the village. Finding a young boy with a baseball, Billy starts an impromptu game.A little later, Colonel Trang (Vic Diaz) and Major Royal (Ken Metcalfe) interrogate the boy and promise Billy that they will not harm him, but after the company leaves the village, the men hear the boy screaming as he is shot to death. Furious, Billy announces he will never play soccer for Collins, provoking the Captain to punish Billy and Dave by reassigning them to patrol the mine-filled rice paddies.Later back at the fire base, Vinnie realizes Alvin never had sex with the prostitutes, and accuses his friend of being homosexual.Fed up with Collins, Tyrone reports a fake Viet Cong sighting and lures Collins out of his tent so he can kill the Captain under the pretense of \"friendly fire,\" but Archer stops Tyrone from shooting Collins and risk being court martialed and executed.Later, Colonel Trang finds Tyrone to discuss his drug smuggling proposition; however Tyrone is no longer interested and pretends Trang found the wrong man.Some time later in January 1968, Company C is sent to destroy an alleged Viet Cong technical operation center and Collins stays behind. During the attack, Alvin is injured by another unseen Viet Cong sniper and taken away by a medical helicopter, leaving Vinnie shaken. Archer soon realizes that Company C is being used as bait to draw out enemy fire, giving the artillery an excuse to counter attack and obtain a higher body count; he reports a false Viet Cong attack while he and the troops relax on the beach as they watch the bombing of an empty hill for several hours.When Tyrone complains about Collin's obsession with forming a soccer team, Archer explains that Collin's plan is to create a military team that will boost morale. If they can put together a winning team, they can leave combat. Tyrone tells Archer they need to get Billy back because he is their best player. Meanwhile, Billy and Dave have befriended local villagers. Billy agrees to play when he gets a letter from his girlfriend Betsy, who informs him she kept their baby, because now he has something to live for.At the climax, Collins organizes a soccer tournament with a local Vietnamese team. Dave brings some of the village children to watch. Company C names their team the \"Muthus.\" Alvin, recovering from his injury, shows up to watch. When the Muthus gain the lead, Colonel Trang complains to General Sloan (Michael Cohen), claiming that it will hurt the country's morale if the Vietnamese lose. Sloan decides that it will be more politically advantageous to let the Vietnamese team win and orders the Muthus to throw the game. They follow orders at first, but Billy can't bear to lose. The Muthus win the game just as the Viet Cong attack. In the confusion of the battle, Collins is killed by enemy mortar fire, and Dave dies while avenging the death of the children he brought to the game by killing Colonal Trang, but gets killed himself by Trang's bodyguards.As the attack comes to an end, Alvin sacrifices himself by throwing himself on an enemy grenade to protect other children. Vinnie and the others are shell-shocked but do not have time to mourn. With Collins dead, Archer takes over command of the company and orders them to rally because they are being sent back to combat for disobeying orders. Before they leave, Tyrone arranges for Billy to be sent home, claiming Billy has a head injury. The film ends with Tyrone and Vinnie rounding up what is left of the company and they all march off the soccer field and back into the combat zone to their new fire base location... which happens to be Khe Sanh.In some versions, the ending closes with a series of texts which say that on January 30, 1968, Company C arrived at Khe Sanh just as the Tet Offensive began and the siege of the forward operating base was well underway.Out of 110 original members of Company C, 43 were killed in action during the three-month siege of Khe Sanh, including Tyrone Washington who was posthumously awarded the Navy Cross.51 others were wounded, including Vinnie Fazio who is permanently confided to the local V.A. hospital in Brentwood, Los Angeles, California.Lt. Archer and two other members of Company C were listed as missing in action.Billy Ray Pike, one of three deserters, left the U.S. Naval Hospital in Da Nang and made his way to Canada where he currently lives with his wife and son.On March 21, 1968, a replacement U.S. Marine company was air lifted from Camp Pendleton, California and relieved what was left of Company C which officially ceased to exist as an active unit in the U.S. Marine Corps."
        ],
        "summaries": [
          "In 1967, five young men undergo boot camp training before being shipped out to Vietnam. Once they get there, the experience proves worse than they could have imagined.",
          "This war drama follows the lives of five young marine recruits from their training in boot camp in 1967 through a tour in Vietnam in 1968 that quickly devolves into a hellish nightmare. Disheartened by futile combat, appalled by the corruption of their South Vietnamese ally, and constantly endangered by the incompetence of their own company commander, the young men find a possible way out of the war. They are told that if they can defeat a rival soccer team, they can spend the rest of their tour playing exhibition games behind the lines. But as they might have predicted, nothing in Vietnam is as simple as it seems.",
          "1967. A group of new recruits arrive at a US Marine base for training. They're from all over the US and all walks of life and will need to work together to survive in combat. After training they're sent to Vietnam where the thing that is most likely to get them killed isn't the enemy but the agendas and incompetence of their officers."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "ZSJW84QB_Hoamgc57HUH",
        "_score": 20.663948,
        "title": "Suspect",
        "year": 1987,
        "genders": [
          "Crime",
          "Drama",
          "Thriller"
        ],
        "score": 6.6,
        "directors": [
          "Peter Yates"
        ],
        "writers": [
          "Eric Roth"
        ],
        "synopsis": [
          "Set in Washington DC, Suspect centers on three disparate characters. Carl Wayne Anderson is a homeless, deaf-mute Vietnam veteran accused of murdering Elizabeth Quinn, a file clerk at the Justice Department. Kathleen Riley is the beleaguered Federal Public Defender assigned to represent Anderson. An agribusiness lobbyist who normally works on Capitol Hill, Eddie Sanger, is made a member of the jury and begins investigating the details of the murder himself, eventually teaming up with Riley to solve the case. We see some early scenes of Sanger's work as a lobbyist on Capitol Hill, including his efforts to win passage of a bill by seducing a Congresswoman. While not relevant to the movie's plot, these scenes are establishing shots giving us a sense for Sanger as a charming, though somewhat ruthless, person.The movie begins around Christmas with the suicide of a United States Supreme Court Justice, for which no explanation or context is given. We only see the Justice making a tape recording and then shooting himself. Shortly after the Justice's suicide, Elizabeth Quinn's body is found floating in the Potomac river, and Carl Wayne Anderson is arrested for the crime, based almost entirely on the fact that he was found sleeping in Quinn's car, which was abandoned in the parking lot where she worked (and was mostly deserted at night). Anderson explains that he found it unlocked and was just looking for a warm place to sleep since it was the dead of winter. But since he was homeless, had no alibi, and was found in Quinn's car, he was arrested for her murder. The establishing scenes show Riley trying to communicate with Anderson and realizing that he is a deaf-mute. Over time, she begins to penetrate his hard exterior and he tries to cooperate with her efforts to mount a defense for him.In the District of Columbia, all crimes are tried in the federal courts, so a murder trial that would normally be in state court was in federal court instead. Riley selects Sanger to be a member of her jury. Soon thereafter, it becomes clear that Sanger is intent on helping Riley with her investigation and defense of Anderson. As the investigation by Riley and Sanger intensifies, they begin focusing on Deputy Attorney General Paul Gray. Figuring that a key found on Elizabeth Quinn's body has something to do with the Justice Department (where Quinn worked), Riley and Sanger break into the file department at the Justice Department late one night and try to find what the key unlocks. They find that it unlocks a file cabinet, which contained trial transcripts from federal cases from 1968 that Quinn was in the process of transcribing.While the investigation goes on after hours, the movie shows scenes during the day from Anderson's murder trial. During the trial, we are introduced to the stern federal judge Matthew Helms (John Mahoney). Helms is rumored to be the President's nominee for a seat on the prestigious United States Court of Appeals for the District of Columbia. Judge Helms begins to suspect that Riley may be collaborating with Sanger, which would be a disbarrable offense of jury tampering, although he does not have concrete proof. One key sequence in a law library (where Riley and Sanger continue looking for the elusive case from 1968 that may be the key to the murder) brings Helms, Riley and Sanger into close proximity. Riley and Sanger narrowly avoid being caught by Judge Helms. Eventually, Judge Helms sequesters the jury to avoid further contact between Riley and Sanger.Riley and Sanger continue tracking the federal court cases from 1968. Their theory is that Elizabeth Quinn stumbled onto something during her transcription of those cases. They look for any case that might have an impropriety. As is explained to the audience, fixing a case requires participation from both the prosecutor and the trial judge. Riley and Sanger think they will find evidence that Paul Gray was a prosecutor on a rigged 1968 case, which would be his motive to murder Elizabeth Quinn if she approached Gray about what she found. Eventually, Riley goes back to Quinn's car (still impounded where it was found in a government parking lot) and finds an audiotape that the police did not uncover in their half-hearted investigation. The tape is the one we saw the Supreme Court Justice making at the beginning of the movie. In it, he confesses to conspiring to fix a case in 1968 (with a politically influential defendant) in return for an appointment from the United States District Court to the United States Court of Appeals for the District of Columbia. Riley assumes the prosecutor on that case was Paul Gray and goes back to the courthouse to retrieve the case book that will confirm this. As she gets to the courthouse (now deserted at night), she is pursued and attacked by an unseen figure. With the help of Sanger (who managed to get away from being sequestered by creating a diversion with a fire alarm), Riley was able to slice the right wrist of her assailant, who then fled unseen.The following day takes place in court. Paul Gray shows up in the courtroom, to the surprise of Judge Helms. Riley then tells Judge Helms that she wants him to take the stand. Irate and perplexed, Helms says that Riley cannot make him testify as he is the presiding judge. Then, in a somewhat-rushed speech, Riley reveals that Judge Helms, not Paul Gray, was the prosecutor in the fixed case in 1968. The Supreme Court Justice was the presiding judge in that case. In exchange for fixing the case, he was promoted from the District Court to the Court of Appeals. Helms, who was the prosecutor on the fixed case, was appointed to the District Court. Judge Helms then waited 17 years (from 1969 to 1986) to be promoted again to the Court of Appeals. Just as he learned he was the President's nominee, Quinn inadvertently discovered the case fixing as she transcribed the cases from 1968. She approached the Supreme Court Justice, who responded by committing suicide. By contrast, when she approached Judge Helms, he murdered her. As Judge Helms angrily bangs his gavel during Riley's accusation, his right wrist begins to bleed from where Riley slashed him the night before, confirming his identity as the killer.The movie ends with Riley reinvigorated in her job and in a relationship with Sanger."
        ],
        "summaries": [
          "When a homeless man is accused of murdering a Justice Department file clerk, a public defender is tasked with mounting his legal defense.",
          "A judge commits suicide, and his secretary is found murdered. A homeless deaf-mute man, Carl Anderson is arrested for her murder. Public defender Kathleen is assigned by the court as his lawyer. She sets to find the real killer, and gets help from the congressional advisor, Eddie Sanger who is called to be on the jury panel. Together they discover a dangerous circle of corruption in high places."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "K0xi84QBEuMZ1zZ3rFFg",
        "_score": 20.663948,
        "title": "Suspect",
        "year": 1987,
        "genders": [
          "Crime",
          "Drama",
          "Thriller"
        ],
        "score": 6.6,
        "directors": [
          "Peter Yates"
        ],
        "writers": [
          "Eric Roth"
        ],
        "synopsis": [
          "Set in Washington DC, Suspect centers on three disparate characters. Carl Wayne Anderson is a homeless, deaf-mute Vietnam veteran accused of murdering Elizabeth Quinn, a file clerk at the Justice Department. Kathleen Riley is the beleaguered Federal Public Defender assigned to represent Anderson. An agribusiness lobbyist who normally works on Capitol Hill, Eddie Sanger, is made a member of the jury and begins investigating the details of the murder himself, eventually teaming up with Riley to solve the case. We see some early scenes of Sanger's work as a lobbyist on Capitol Hill, including his efforts to win passage of a bill by seducing a Congresswoman. While not relevant to the movie's plot, these scenes are establishing shots giving us a sense for Sanger as a charming, though somewhat ruthless, person.The movie begins around Christmas with the suicide of a United States Supreme Court Justice, for which no explanation or context is given. We only see the Justice making a tape recording and then shooting himself. Shortly after the Justice's suicide, Elizabeth Quinn's body is found floating in the Potomac river, and Carl Wayne Anderson is arrested for the crime, based almost entirely on the fact that he was found sleeping in Quinn's car, which was abandoned in the parking lot where she worked (and was mostly deserted at night). Anderson explains that he found it unlocked and was just looking for a warm place to sleep since it was the dead of winter. But since he was homeless, had no alibi, and was found in Quinn's car, he was arrested for her murder. The establishing scenes show Riley trying to communicate with Anderson and realizing that he is a deaf-mute. Over time, she begins to penetrate his hard exterior and he tries to cooperate with her efforts to mount a defense for him.In the District of Columbia, all crimes are tried in the federal courts, so a murder trial that would normally be in state court was in federal court instead. Riley selects Sanger to be a member of her jury. Soon thereafter, it becomes clear that Sanger is intent on helping Riley with her investigation and defense of Anderson. As the investigation by Riley and Sanger intensifies, they begin focusing on Deputy Attorney General Paul Gray. Figuring that a key found on Elizabeth Quinn's body has something to do with the Justice Department (where Quinn worked), Riley and Sanger break into the file department at the Justice Department late one night and try to find what the key unlocks. They find that it unlocks a file cabinet, which contained trial transcripts from federal cases from 1968 that Quinn was in the process of transcribing.While the investigation goes on after hours, the movie shows scenes during the day from Anderson's murder trial. During the trial, we are introduced to the stern federal judge Matthew Helms (John Mahoney). Helms is rumored to be the President's nominee for a seat on the prestigious United States Court of Appeals for the District of Columbia. Judge Helms begins to suspect that Riley may be collaborating with Sanger, which would be a disbarrable offense of jury tampering, although he does not have concrete proof. One key sequence in a law library (where Riley and Sanger continue looking for the elusive case from 1968 that may be the key to the murder) brings Helms, Riley and Sanger into close proximity. Riley and Sanger narrowly avoid being caught by Judge Helms. Eventually, Judge Helms sequesters the jury to avoid further contact between Riley and Sanger.Riley and Sanger continue tracking the federal court cases from 1968. Their theory is that Elizabeth Quinn stumbled onto something during her transcription of those cases. They look for any case that might have an impropriety. As is explained to the audience, fixing a case requires participation from both the prosecutor and the trial judge. Riley and Sanger think they will find evidence that Paul Gray was a prosecutor on a rigged 1968 case, which would be his motive to murder Elizabeth Quinn if she approached Gray about what she found. Eventually, Riley goes back to Quinn's car (still impounded where it was found in a government parking lot) and finds an audiotape that the police did not uncover in their half-hearted investigation. The tape is the one we saw the Supreme Court Justice making at the beginning of the movie. In it, he confesses to conspiring to fix a case in 1968 (with a politically influential defendant) in return for an appointment from the United States District Court to the United States Court of Appeals for the District of Columbia. Riley assumes the prosecutor on that case was Paul Gray and goes back to the courthouse to retrieve the case book that will confirm this. As she gets to the courthouse (now deserted at night), she is pursued and attacked by an unseen figure. With the help of Sanger (who managed to get away from being sequestered by creating a diversion with a fire alarm), Riley was able to slice the right wrist of her assailant, who then fled unseen.The following day takes place in court. Paul Gray shows up in the courtroom, to the surprise of Judge Helms. Riley then tells Judge Helms that she wants him to take the stand. Irate and perplexed, Helms says that Riley cannot make him testify as he is the presiding judge. Then, in a somewhat-rushed speech, Riley reveals that Judge Helms, not Paul Gray, was the prosecutor in the fixed case in 1968. The Supreme Court Justice was the presiding judge in that case. In exchange for fixing the case, he was promoted from the District Court to the Court of Appeals. Helms, who was the prosecutor on the fixed case, was appointed to the District Court. Judge Helms then waited 17 years (from 1969 to 1986) to be promoted again to the Court of Appeals. Just as he learned he was the President's nominee, Quinn inadvertently discovered the case fixing as she transcribed the cases from 1968. She approached the Supreme Court Justice, who responded by committing suicide. By contrast, when she approached Judge Helms, he murdered her. As Judge Helms angrily bangs his gavel during Riley's accusation, his right wrist begins to bleed from where Riley slashed him the night before, confirming his identity as the killer.The movie ends with Riley reinvigorated in her job and in a relationship with Sanger."
        ],
        "summaries": [
          "When a homeless man is accused of murdering a Justice Department file clerk, a public defender is tasked with mounting his legal defense.",
          "A judge commits suicide, and his secretary is found murdered. A homeless deaf-mute man, Carl Anderson is arrested for her murder. Public defender Kathleen is assigned by the court as his lawyer. She sets to find the real killer, and gets help from the congressional advisor, Eddie Sanger who is called to be on the jury panel. Together they discover a dangerous circle of corruption in high places."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "o0xi84QBEuMZ1zZ3rEpc",
        "_score": 19.724716,
        "title": "The Strawberry Statement",
        "year": 1970,
        "genders": [
          "Drama",
          "Romance"
        ],
        "score": 6.6,
        "directors": [
          "Stuart Hagmann"
        ],
        "writers": [
          "James Kunen",
          "Israel Horovitz"
        ],
        "synopsis": [],
        "summaries": [
          "An apolitical college student joins a group of campus protesters to meet girls but gets swept up in their cause and involved in a violent confrontation with police.",
          "Twenty-year-old Simon is a student at a university located in San Francisco, he being on the university's rowing team his way of fitting in. More on a lark in truly being non-political, he attends a student sit-in at the office of the university's President, a protest against what they see as the university's inherently anti-black and pro-war actions. He decides to continue his association with the protesters more as a way to meet girls, or more specifically get to know Linda, one of the protesters with whom he is partnered in certain tasks. As the protests continue, Simon has to decide where his allegiances lie in the seemingly incompatible worlds of the rowing team and the protests, and if his view of the protests change to true commitment like Linda, who may only want to be with whom she sees as someone like herself, or if his commitment is solely to Linda and not to the cause of the protest.",
          "Simon is a student at a college in San Francisco. He is content to be on the rowing team and remain as just a casual observer to the on-campus unrest, demonstrations and protests. However, curiosity gets the best of him and he begins exploring the inner sanctum of the students who have invaded the dean's office. He soon meets Linda and becomes a loyal member of the student revolution to meet girls. However, when he truly discovers the corruption and the madness that his comrades are protesting, his mindset also joins the movement. He becomes a revolutionary leader and prepares his comrades for a very violent climactic showdown with \"the pigs\" at a sit-in."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "SExi84QBEuMZ1zZ3rEVW",
        "_score": 19.441038,
        "title": "The Third Man",
        "year": 1949,
        "genders": [
          "Film-Noir",
          "Mystery",
          "Thriller"
        ],
        "score": 8.1,
        "directors": [
          "Carol Reed"
        ],
        "writers": [
          "Graham Greene",
          "Orson Welles",
          "Alexander Korda"
        ],
        "synopsis": [
          "Sights of Vienna, Austria, flash across the screen as an Englishman's voice (Carol Reed) describes the racketeer trade in the post-World War II era. He describes that many amateurs have tried to get involved in this career, but he implies that they always end up dead. Meanwhile, the city is quartered into sectors policed by occupying forces -- the English, the Russians, the Americans and the French -- though they barely can handle the criminal element and don't even speak the same language. The city is devastated (\"bombed about a bit,\" says the narrator), covered in jagged rubble. He begins to tell the story of an American coming to Vienna named Holly Martins, who has come to accept a job from an old friend.Holly Martins (Joseph Cotten) gets off his train and is surprised that his friend, Harry Lime, isn't at the station to meet him. Holly goes to Lime's flat, but the building porter (Paul Hörbiger), through extremely broken English, tells him that he just missed Lime's friends leaving with a coffin. The porter says that Harry was killed, hit by a truck right in front of the building.Martins goes to a massive graveyard and finds a funeral service. An Englishman (Trevor Howard) hovering nearby informs Holly it is Harry's funeral. Standing by the grave are two middle-aged men, both of whom eye Holly suspiciously. Also in attendance is a pretty woman (Alida Valli) who doesn't notice him. After the funeral, Martins begins to walk back into town, and the Englishman offers him a ride.The stranger introduces himself as Major Calloway, a police officer in the British sector of Vienna, and offers to buy him a drink. Holly agrees and proceeds to drink while reminiscing about Harry. It is revealed that Holly is an author of pulp Western novellas. As he talks about his old friend, Calloway says that it's better that Lime is dead, since he was a murderer and a racketeer. Holly takes umbrage at Calloway's suggestion and reaches to punch him, but he's quickly socked in the face by fellow English soldier Sergeant Paine (Bernard Lee). Paine apologizes and escorts the tipsy Martins to the nearby hotel, explaining to Holly earnestly that he is a huge fan of his books. Calloway sets Martins up at the hotel for the night, telling him he can catch a plane out of Vienna the next day. Holly promises he will prove him wrong about Lime.Happening by on the way out of the hotel is another Englishman named Crabbin (Wilfrid Hyde-White). Paine tells Crabbin that Holly is an author, and though Crabbin has never heard of him, he is excited to have a writer in Vienna. Crabbin introduces himself to Holly and explains he represents the British cultural propaganda department in Vienna. He invites Holly to stay and give lecture in a few days at the department's meeting. Figuring he could use the extra time in town as an opportunity to look into Harry's death, Holly accepts the offer.Holly is then called on the hotel phone by a man who identifies himself as Baron Kurtz. The man says he is a friend of Harry's. Martins and Kurtz set up a meeting at a nearby cafe. When they meet, Holly recognizes Kurtz (Ernst Deutsch) as one of the two men at Harry's funeral. Kurtz is carrying one of Holly's books, which he says Harry had given to him, and a small dog.Holly proceeds to grill Kurtz about the circumstances of Harry's death. Kurtz and Martins go out to the street in front of Harry's apartment building to reconstruct the events of the accident. Kurtz's version is this: he was walking out of Harry's flat with him when Harry saw a Romanian friend of his, Popescu, across the street. Harry then began to cross the street to greet Popescu when a truck drove up and ran Harry over. Then Kurtz and Popescu carried Harry to the sidewalk. Shortly thereafter, Harry's doctor, Dr. Winkel, happened by. The doctor was too late to save Harry, however. Holly asks Kurtz to help him investigate further, but Kurtz says as he is an Austrian, he must be careful with the police. Martins tells him the police think Harry was a racketeer. Kurtz points out most everyone in Vienna is mixed up in some sort of racket, but mostly nothing serious--tires, stamps, etc.Kurtz describes how after Harry was hit, he instructed him to see after Holly when he arrived. Holly points out the porter, who is near them outside the apartment sweeping, told him that Harry died instantaneously. Kurtz looks the porter over and says that Harry died before the ambulance arrived, but that he was still alive immediately after he was run over. Holly tells Kurtz he wants to speak to Popescu, but he says Popescu has left Vienna. At Holly's insistence, Kurtz tells him the identity of the pretty woman at the funeral. He does not remember her name, but he tells Holly she was a companion of Harry's who works as an actress at a local theater. Kurtz tells Holly he lives in the Russian sector but works at the Casanova Club, and if he has any need for advice to contact him there. Holly then tries to question the porter again. However, the porter's wife, overhearing the conversation, looks frightened and calls for her husband to come inside.That evening, Holly goes to theater where the woman, named Anna Schmidt, is performing. He introduces himself as a friend of Harry Lime's, and she tells him to come back after the show. When he meets her afterwards, Martins finds out that Anna, so depressed over Harry's death that she declares she wishes she too were dead, had been dating Harry for some time and that Harry had allegedly asked Kurtz that Anna be taken care of as well just before he died. Martins thinks it funny that Harry had time to think of both him and Anna right after the accident, even though he supposedly died instantly, or at least very quickly. Anna also reveals that the man driving the truck was Harry's own driver. Holly tells Anna that he has a feeling that there's something suspicous about Harry's death -- that seemingly everyone he knew was at the scene -- and he convinces her to help him speak to the porter again.Anna and Holly go to talk with the porter in Harry's apartment. Anna pokes around the flat, seemingly reminiscing, and half-heartedly translates the German for Martins. The porter tells them that Harry's neck was broken in such a way that he had to have died immediately; therefore, there was no way he could have asked Kurtz that Anna and Martins be taken care of. He also says that three men carried Harry to the sidewalk, not two (Kurtz & Popescu), as Kurtz had claimed. Holly asks the porter why he did not reveal this information at the inquest, and the porter responds he didn't want to be mixed up in the situation and that he wasn't the only witness who did not give a complete testimony. As Holly tries to convince the porter take his story to the police, the conversation becomes heated. The porter, who becomes fearful, insists in German that Holly leave and never come back. An elfin boy spies them arguing just before Holly and Anna leave.Holly walks Anna back to her place and they are met by Anna's landlady (Hedwig Bleibtreu), who frantically tells her that the police are inspecting her apartment. Holly and Anna go upstairs to find Major Calloway and Sergeant Paine supervising as her apartment is torn apart. Calloway asks for her passport, which he and Paine inspect and then suspect is fake. The Major tells her he must keep it. Holly tells Calloway that he suspects Harry may have been murdered, but he says he doesn't care how Harry died as long he's dead. He suggests Holly should go back to the airport and go home. As they continue to go through her things, including love letters to her from Harry, Anna explains quietly to Holly about her passport, which she reveals Harry forged for her. She explains that she is Czechoslovakian and that the Russians would claim her and have her deported if it was found out that she was not Austrian. Calloway takes Anna back with the other officers to the police station, and on her way out, Holly asks her to remind him of Harry's doctor's name so he can go talk with him.Holly goes to ask Dr. Winkel (Erich Ponto) about Harry's death. The doctor was the man standing by Kurtz at the funeral. In his home, Holly sees the same small dog that Kurtz was carrying earlier. The doctor tersely adheres to Kurtz's take on the events, and he confirms that he arrived after Harry was already dead. Holly asks if it's possible that Harry was pushed in front of the truck, if he knows if Harry could have died instantaneously or not, and if there was a third man who helped carry Harry's body to the sidewalk. Dr. Winkel tells Holly he can give no additional opinion as to the circumstances of the accident, since he did not witness the event and the injuries would have been the same no matter how it happened. He also says there was no third man on the scene by the time he arrived.At the international police station, Anna sees a Russian officer flipping through her papers as she waits. Calloway comes in and questions her about Harry. He shows her a picture of man named Joseph Harbin and asks if she knows who he is. Anna says she's never seen him before. He explains that Harbin is a worker in a military hospital, but she insists she does not know him. He accuses her of lying, which he says is stupid because he could help her with her passport. He explains that in one of her confiscated letters, Harry had written her to instruct her to place a call to the Casanova Club for someone named Joseph. Anna barely remembers that the message for Joseph was something about meeting Harry at his home. Calloway tells her that the day she telephoned that message to Joseph Harbin, he disappeared. Anna insists Calloway has Harry all wrong, and he sends her away, though he keeps her passport and belongings.Anna then goes with Holly, who was waiting outside the station for her, to the Casanova Club. Crabbin is inside just leaving, and he reminds Holly of the lecture he is to give the next night. Holly and Anna sit at the bar and see Kurtz playing violin for a dining couple. Kurtz looks dismayed to see Holly again and, when questioned, insists that only he and Popescu carried Harry and that the porter must have been mistaken. Kurtz says that Popescu happens to be at the club that night, despite his earlier claim that Popescu was out of town. Holly meets Popescu (Siegfried Breuer), whose account of Harry's death mirrors Kurtz's account in all aspects. Holly again asks if a third man helped him and Kurtz carry Harry's body, but Popescu denies this, asking where Holly heard such a thing. He tells him the porter at Harry's building had heard the accident and witnessed the aftermath. This is evidently news to Popescu, who was unaware that the porter was a witness since he had not given testimony at the inquest.Popescu is then seen arranging and attending a mysterious meeting on a bridge with Kurtz, Dr. Winkel, and an unseen fourth man.The following morning, while Holly wanders thoughtfully in front of Harry's former home, the porter leans out the window and apologizes to Holly for his previous demeanor, arranging to meet with him later to tell him something important. When the porter closes the window and turns around, he reacts with surprise and terror to an unseen person who has presumably snuck up behind him.Holly goes to visit Anna to tell her the porter wants to talk to him again. She is especially depressed about Harry, and she begs Holly to tell her stories about him. They talk about Harry, painting him as a mischievous boy who never grew up. She insists they go see the porter together, accidentally calling him Harry, which lightly miffs Holly.As they walk up to the front of the porter's building, they see a crowd gathered near the door. Anna immediately wants to leave, assuming it to be trouble. Holly, however, walks over to the crowd, where he is told the porter has been murdered. The little boy who had seen Holly and the porter arguing begins insisting something about Holly loudly in German. Slowly, the assembled crowd turns to stare at Holly. Anna explains that the crowd thinks he is the murderer. He grabs Anna and they run away. The crowd pursues them, with the little boy in the lead. Holly and Anna duck into a movie theater, losing the mob. Holly tells Anna to go back home where she'll be safe.Holly eventually makes his way back to his hotel, where he asks the desk clerk for a taxi driver. The clerk indicates that an imposing-looking man standing there is a driver already waiting for him. With Holly in the back seat, the driver speeds off recklessly without Holly saying where he wants to go. Holly, very frightened, asks him if he is taking him to be killed. The driver does not answer and finally stops in front of a doorway. Holly, sure that he's about to be murdered, starts to run, but the door opens. Crabbin greets him, and Holly realizes it is time for the speaking engagement that he'd agreed to.Holly struggles with the intellectual questions posed to him. The audience begins to dissipate, while Crabbin agonizes over the misstep of hiring Holly. Unexpectedly, Popescu arrives, and he asks Holly if he's working on a book. Holly says that he's writing a book called \"The Third Man\" and that it's based on fact. Popescu suggests that Holly stick to fiction, but Holly insists he will finish this \"book.\" As the meeting is closed, two thuggish-looking men arrive and get whispered orders from Popescu. Holly takes off up the spiral staircase at the back of the building and the two thugs pursue him. Holly ducks into in unlocked room, where he is bitten by an unexpected parrot. He makes his way out of a window and finds refuge from the thugs in a car hidden among the wartime rubble.Once safe, Holly goes to the international police station to tell Calloway about his findings. Calloway, though now convinced that Harry Lime was murdered, is still indifferent and explains that it's better that Harry is dead. Holly insists he is wrong, so the Major offers to show Holly why he believes Harry is guilty of racketeering and murder. Calloway then presents a myriad of evidence, proving that Harry obtained penicillin illegally, diluted it, and sold it to war-ravaged, poor hospitals, resulting in the painful deaths of many people. (Watered-down penicillin is not only ineffective, but it also makes the patient immune to future doses of penicillin, thus rendering medical treatment incredibly difficult or impossible.) Many of his victims were children with meningitis; the lucky ones, the Major says, died, and the unlucky ones lived and went insane. He shows Holly a slide of the hospital worker Joseph Harbin, who he explains helped steal the penicillin for Harry. The police forced Harbin to give them information about Harry's operation, but he has recently gone missing. Holly, now convinced of Harry's guilt, is devastated by the news about his old friend and agrees to go back to America.After Holly goes out to a bar and gets drunk, he buys flowers and takes them to Anna in her apartment. He drunkenly calls to Anna's cat, who is indifferent to him, and Anna explains the only person the cat ever liked was Harry. The cat slips out the window. Anna lets Holly know that Calloway also told her about Harry's misdeeds, and though she now believes in his guilt as well, it doesn't change her feelings for Harry.We then see a man outside Anna's window on the street. He ducks into a dark doorway. Anna's cat, who has run out of the apartment, curls up at his feet.In the apartment, Anna says Harry is better off dead, but not because he was punished for doing wrong, as Calloway believes. Holly agrees he's better off dead, and he no longer cares who killed him or why. He believes there was justice in Harry's death, and he says maybe he would have even killed Harry himself. He also tells Anna that he's fallen in love with her, but she makes it apparent that the feeling isn't mutual, as she thinks only of Harry.Disappointed and still drunk, Holly stumbles outside to return to his hotel, but he sees the obscured man standing in the dark doorway, the cat still at his feet. Holly shouts at him to stop spying and to show himself, but he does not move. Holly's noise causes a woman upstairs to turn on her light and open her window to yell at him to be quiet. The light from the woman's apartment shines down into the street, revealing the man in the doorway to be Harry Lime (Orson Welles). Harry smiles at a shocked Holly, but slips away when the woman turns off her light. Seeing Harry's shadow running off down a nearby street, Holly takes pursuit. He follows the sound of footsteps down a passageway that opens into a plaza, but once Holly reaches the end of the passageway, Harry is already gone.Holly brings Calloway and Paine out the area to re-enact the events, but they are unconvinced. However, suddenly a light bulb goes off for Calloway as he eyes a booth in the plaza. Opening the door on the booth, Calloway shows Holly that it is an entranceway to the Vienna sewers, with steps leading downwards. They follow the stairs into the sewers, where they see an endless range of tunnels for Harry to use as escape routes.That night, Calloway leads a team to excavate Harry's grave. When they open the coffin, the body inside is revealed to be that of Joseph Harbin.The international police come to Anna's apartment for her as she lies in bed crying in Harry's old pajamas. Anna surely assumes this is because of her forged papers. As she is led into the station, Holly sees her and yells at her that he's seen Harry alive. Calloway is standing in the hallway as the police lead her through the station, and he instructs them to bring her into his office. He interrogates her alone, asking when she saw Lime last. He explains in his coffin was Joseph Harbin's body. She looks thrilled as she realizes this does mean that Harry is alive, and she asks where he is. Calloway thinks she might know, but it is clear she was not aware he has been alive either. He says they know Harry is hiding in the Russian sector (which is where Kurtz lives, as he told Holly), and that if she helps them catch Lime, Calloway will help her with the Russians, who are about to interrogate her about her passport. She cannot help him, though, and he tells her they will catch him eventually, as Vienna is a closed city. She says that she wishes that he was dead, as he would be safe from \"all of you.\"The next morning, Holly goes to visit Baron Kurtz's apartment in the Russian sector. Kurtz looks over his balcony and invites Holly up, but Holly refuses, as he shouts back that he wants to speak only with Harry. Dr. Winkel comes out on the balcony also, and he and Kurtz exchange concerned looks. Though they admit nothing about Harry, Holly insists that he come meet him at the nearby fairgrounds.As Holly waits next to the Ferris wheel, he spots Harry walking up to warmly greet him, acting as if nothing has changed. They go for a ride on the Ferris wheel. Harry shows no remorse for his penicillin racket, asking Holly about the people far below them if Holly would really care if one of \"those little dots\" stopped moving forever, especially if he were paid for each dot. When Holly reveals that he told the police about seeing Harry, Harry is very unhappy that Holly has been talking to the cops. Harry, staring at Holly, clearly considers shooting him and throwing him out of the Ferris wheel to his death. Holly takes him seriously enough to wrap his arm tightly around the car door should Harry try anything. However, when Holly also says that they've dug up his grave and found Harbin, Harry changes his mind and jokes that neither one of them would ever think of doing something to the other. Harry also reveals that he was the one who informed the Russian police about Anna's forged passport as payment for them letting him hide out in the Russian sector. As they finish the ride, Harry offers to cut Holly in on his schemes, but without waiting for an answer, Harry leaves quickly, telling him that they can meet again any time he wants, but no police.Holly goes to meet with Calloway and tells him he knows where Harry is staying. The Major tries to convince him to help them trap Harry by arranging to meet him at a cafe in the international zone. However, though Holly knows his friend has done wrong, he is unwilling to be the one to doom him. Just then, the Russian officer comes in with Anna's passport, explaining to Calloway that she must be deported. The Major mentions to him that the Russians were supposed to be helping the British police with Harry Lime, but the Russian says the two cases are not related and that they will get to his case eventually. He leaves the room, Anna's passport sitting on Calloway's desk. Calloway, seemingly resigned to Holly giving up in Harry's case, talks about how helpful Holly could have been in getting Lime, but Holly is staring at Anna's papers sitting on the desk. Holly asks what price would Calloway pay for his help, and he tells him to name it.Paine accompanies Anna to board the train that will save her from the Russian authorities. Just as she settles into her car, she spies Holly trying to see her off inconspicuously. Understanding that her leaving must have been part of a deal Holly struck with Calloway, she gets off the train and confronts Holly about why he's there. He admits he has agreed to \"betray\" Harry in turn for her getting away. Anna makes it evident that she's disgusted with Holly and could never do anything to hurt Harry. She leaves angrily, ripping up her passport, and allows the train to depart with her belongings.Now despondent, Holly asks that Calloway and Paine just take him to the airport, having changed his mind to help them catch Harry. He shows them Anna's torn up papers. Calloway agrees, but on the way to the airport, the Major makes an extra stop. It is the children's ward of a hospital, where Calloway shows Holly the devastating effects of Harry's dilluted penicillin. Horrified by the sight of painfully dying children, Holly reluctantly agrees again to entrap Harry.At a cafe Holly waits to meet Harry while Calloway, Paine, and several other policemen stake out nearby in the shadows. Anna comes into the cafe to admonish Holly, his location disclosed to her by Baron Kurtz as he was being arrested. While she talks to him, Harry has snuck in the back of the cafe. Just as Harry enters behind Anna, she yells at Holly for being a police informant. Harry reacts, drawing a gun to shoot Holly. Anna is standing in the way and tells Harry that he must escape or the police will get him. Harry tells Anna to move so he can kill Holly, but he spots Sergeant Paine entering the front of the cafe and turns to run.Harry rushes to the nearest sewer entrance and goes down into the tunnels. Paine, Calloway, Holly, and international policemen pursue Harry through the maze of sewer passages. Harry, for a time, evades the many men, but he is eventually cornered. Holly happens upon the panicked Harry and, hiding from the range of Harry's gun, tells him that he must give up. Sergeant Paine, followed by Calloway, comes rushing to Holly to warn him to get back, but Harry shoots Paine, and he falls. Harry tries to run but is shot by Calloway.Harry manages to crawl out of sight while Calloway leans over the dying Paine. Holly takes Paine's gun and sets off after Harry, and Calloway tells him to shoot on sight. In a passageway, badly wounded, Harry strains to climb up steps to escape through a sewer grate. He manages to make it to the top of the staircase, where he reaches his fingers up through the grate, feeling the air above. However, he is too weak to lift the manhole cover, and he drops his head into his arms. Holly walks up and aims the gun at Harry. Harry weakly lifts his head and nods slightly at Holly, a silent okay for Holly to mercy-kill him. A shot rings out in the sewers. Calloway sees the figure of Holly emerging from the passageway alone.Soon after, Harry again has another funeral in the same cemetery. Holly, Calloway, and Anna are the only attendees. After the service, Calloway begins to drive Holly to the airport. Seeing Anna walking behind them down the same tree-lined trail as the first time he saw her, Holly asks to get out to speak to her. Holly waits for Anna as she walks down the long road toward him. When she nears him, though, she does not acknowledge his presence and walks by. Holly doesn't say anything, but he puts his head down and lights a cigarette."
        ],
        "summaries": [
          "Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime.",
          "An out of work pulp fiction novelist, Holly Martins, arrives in a post war Vienna divided into sectors by the victorious allies, and where a shortage of supplies has led to a flourishing black market. He arrives at the invitation of an ex-school friend, Harry Lime, who has offered him a job, only to discover that Lime has recently died in a peculiar traffic accident. From talking to Lime's friends and associates Martins soon notices that some of the stories are inconsistent, and determines to discover what really happened to Harry Lime.",
          "Pulp novelist Holly Martins, portrayed by Joseph Cotten, has traveled to Vienna because his friend, Harry Lime, portrayed by Orson Welles, has offered him a job. However, upon his arrival, Martins is told that Lime died in an accident. Driven to investigate Lime's death, Martins soon discovers incredible dark secrets about Lime's life and death.",
          "In the post Second World War, the unemployed pulp fiction writer Holly Martins arrives in Vienna to meet with his old friend from school, Harry Lime, who has offered him a job. On the arrival, he learns that Harry has just died, hit by a truck in front of his building, and he goes to his funeral. Holly Martins sees a beautiful woman, Anna Schmidt, and a friend of Harry and sooner he learns that Anna was Harry's lover. Maj. Calloway, who is commanding the investigation, offers the ticket to Holly return home, but while waiting for the trip, he talks to two friends of Harry that tell that they had been the firsts to help his friend. However, the porter of Harry's building tells that there was a mysterious third man that helped Harry and Holly Martins becomes intrigued with the inconsistency and decides to investigate further. Sooner he discloses that Harry Lime was the leader of a gang that robbed penicillin from the military hospital to adulterate and resell it, and has caused the death and anomalies in many children. He continues to investigate and he has a great surprise when he finds who the third man is.",
          "Holly Martins, a hack American dime store novelist, broke, has just arrived in Vienna as his longtime friend, Harry Lime, offered him a job, the plane ticket on Harry's dime. Holly's arrival coincides with Harry's graveside memorial service as he was just killed in a traffic accident outside of his apartment building. Meeting him at the service, Holly further learns of accusations by a Major Calloway, a British military officer as the Brits control that sector of the city, that Harry was one of the biggest racketeers in town. Calloway is continuing his investigation not so much of Harry's death, but his criminal activities. While corruption does run rampant in this post-war era as Vienna is being rebuilt both literally and figuratively, Holly does not believe the accusations. As such, Holly finds any excuse to remain in Vienna, especially as what happened to Harry does not seem to add up leading to Holly believing he was murdered. Holly also believes that many of the people that were at the memorial service were somehow involved, the person who he wants to get to know the most being the beautiful young woman. He will learn that she is actress Anna Schmidt, a Czechoslovakian national in Austria on forged papers, she who claims to have been Harry's girlfriend. As Holly collects more and more stories from people who purportedly saw or heard or helped in the aftermath of Harry's death, he ultimately is in search of the mysterious \"third man\", the unknown person assisting two other known people carrying Harry's dead body away. He will find that in getting deeper and deeper into the investigation, Holly is putting his own life in danger.",
          "An American pulp writer arrives in post-WWII Vienna only to find that the friend who waited for him is killed under mysterious circumstances. The ensuing mystery entangles him in his friend's involvement in the black market, with the multinational police, and with his Czech girlfriend."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "OiJW84QB_Hoamgc57Jca",
        "_score": 19.370625,
        "title": "Another World",
        "year": 2014,
        "genders": [
          "Documentary",
          "Biography",
          "Drama"
        ],
        "score": 6.7,
        "directors": [
          "Rebecca Chaiklin",
          "Fisher Stevens"
        ],
        "writers": [
          "Mark Monroe"
        ],
        "synopsis": [
          "On September 17, 2011, a group of young people, inspired by the Arab Spring, gathered to march on Wall Street. Most of them had never met before - and many had never participated in a protest. They had connected through social media- and a shared desire to put an end to the corporate greed that had brought down the world economy. Occupy Wall Street quickly caught fire, capturing the imaginations and hearts of people across the globe. Almost overnight, the movement transformed the national dialogue about economic inequality and corporate corruption. This documentary follows several of the key players. Bobby Cooper is from rural New Hampshire, where the farm that has belonged to his family for generations is on the verge of foreclosure. Hero Vincent - a charismatic, aspiring hip-hop artist from North Carolina could not understand how his loving family ended up homeless after his father lost his job. Sandy Nurse grew up an army brat. Her mother still works at the US Department of Defense. Sandy was on a fast tract to a diplomatic career- but decided to play hooky from graduate school on September 17th to march on Wall Street. Amin Husain grew up poor in Palestine. He came to New York with a full scholarship to Columbia Law School and landed a high paying job as a corporate transactions lawyer. But his life felt meaningless and he longed for something more. Lisa Fithian, a passionate activist who has been called by conservative media, has dedicated her life to social justice work. Patrick Bruner just graduated with honors from Skidmore College. Frustrated with his inability to find work and drowning in student debt, he showed up in Zuccotti Park.On the morning of September 17th, these characters were amongst those who converged on Wall Street and collectively decided that they would not go home until they inspired major systemic change in America. The living conditions in the protest camp were incredibly difficult. There were no bathrooms, running water, or electricity. People were sleeping on the cold concrete in the rain and snow. Yet nearly every day, there was a new creative action to call attention to and brainstorm solutions for our countrys social injustices. The wealth of ideas was astounding. The willingness to sacrifice everything, for the possibility of building a more just, compassionate world, created a palpable sense of hope. Soon, OWS surged from a fringe protest to a major news headliner. Occupations across the world began popping up with tens of thousands of participants worldwide. Occupiers pressed forward with incredible urgency and inspiration - but it also felt out of control and unmanageable. Direct democracy revealed itself to be both beautiful and messy. As the movement exploded, the police became increasing aggressive with their tactics to undermine the impact of OWS. Infiltrators began subverting the movements activities and community meetings. As filmmakers, we were deeply moved by the stories of these remarkable young people and what had led them to abandon their lives and homes to live in Zuccotti Park. With limited resources, we followed our characters through the dramatic events that unfolded over the course of the next year."
        ],
        "summaries": [
          "What would drive someone to drop everything and move into a city park in lower Manhattan? In the fall of 2011 hundreds of people did just that as a public protest against corporate greed and with the hope of creating an alternative society. Occupy Wall Street started as an under attended protest that quickly caught fire and capturing international headlines, the imaginations and hearts of people across the globe. Almost overnight the movement transformed the national dialog about economic inequality and corporate corruption. The slogan 'We are the 99 percent' instantly became part of the national lexicon. This documentary is an intimate portrait of several key players who helped create the movement and their wild ride through the rise and fall of Occupy Wall Street."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "AExi84QBEuMZ1zZ3rHNr",
        "_score": 19.370625,
        "title": "Another World",
        "year": 2014,
        "genders": [
          "Documentary",
          "Biography",
          "Drama"
        ],
        "score": 6.7,
        "directors": [
          "Rebecca Chaiklin",
          "Fisher Stevens"
        ],
        "writers": [
          "Mark Monroe"
        ],
        "synopsis": [
          "On September 17, 2011, a group of young people, inspired by the Arab Spring, gathered to march on Wall Street. Most of them had never met before - and many had never participated in a protest. They had connected through social media- and a shared desire to put an end to the corporate greed that had brought down the world economy. Occupy Wall Street quickly caught fire, capturing the imaginations and hearts of people across the globe. Almost overnight, the movement transformed the national dialogue about economic inequality and corporate corruption. This documentary follows several of the key players. Bobby Cooper is from rural New Hampshire, where the farm that has belonged to his family for generations is on the verge of foreclosure. Hero Vincent - a charismatic, aspiring hip-hop artist from North Carolina could not understand how his loving family ended up homeless after his father lost his job. Sandy Nurse grew up an army brat. Her mother still works at the US Department of Defense. Sandy was on a fast tract to a diplomatic career- but decided to play hooky from graduate school on September 17th to march on Wall Street. Amin Husain grew up poor in Palestine. He came to New York with a full scholarship to Columbia Law School and landed a high paying job as a corporate transactions lawyer. But his life felt meaningless and he longed for something more. Lisa Fithian, a passionate activist who has been called by conservative media, has dedicated her life to social justice work. Patrick Bruner just graduated with honors from Skidmore College. Frustrated with his inability to find work and drowning in student debt, he showed up in Zuccotti Park.On the morning of September 17th, these characters were amongst those who converged on Wall Street and collectively decided that they would not go home until they inspired major systemic change in America. The living conditions in the protest camp were incredibly difficult. There were no bathrooms, running water, or electricity. People were sleeping on the cold concrete in the rain and snow. Yet nearly every day, there was a new creative action to call attention to and brainstorm solutions for our countrys social injustices. The wealth of ideas was astounding. The willingness to sacrifice everything, for the possibility of building a more just, compassionate world, created a palpable sense of hope. Soon, OWS surged from a fringe protest to a major news headliner. Occupations across the world began popping up with tens of thousands of participants worldwide. Occupiers pressed forward with incredible urgency and inspiration - but it also felt out of control and unmanageable. Direct democracy revealed itself to be both beautiful and messy. As the movement exploded, the police became increasing aggressive with their tactics to undermine the impact of OWS. Infiltrators began subverting the movements activities and community meetings. As filmmakers, we were deeply moved by the stories of these remarkable young people and what had led them to abandon their lives and homes to live in Zuccotti Park. With limited resources, we followed our characters through the dramatic events that unfolded over the course of the next year."
        ],
        "summaries": [
          "What would drive someone to drop everything and move into a city park in lower Manhattan? In the fall of 2011 hundreds of people did just that as a public protest against corporate greed and with the hope of creating an alternative society. Occupy Wall Street started as an under attended protest that quickly caught fire and capturing international headlines, the imaginations and hearts of people across the globe. Almost overnight the movement transformed the national dialog about economic inequality and corporate corruption. The slogan 'We are the 99 percent' instantly became part of the national lexicon. This documentary is an intimate portrait of several key players who helped create the movement and their wild ride through the rise and fall of Occupy Wall Street."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "d0xi84QBEuMZ1zZ3rF1k",
        "_score": 17.975077,
        "title": "Out for a Kill",
        "year": 2003,
        "genders": [
          "Action",
          "Crime",
          "Thriller"
        ],
        "score": 3.4,
        "directors": [
          "Michael Oblowitz"
        ],
        "writers": [
          "Danny Lerner",
          "Dennis Dimster",
          "Sam Hayes"
        ],
        "synopsis": [],
        "summaries": [
          "An unsuspecting university professor is an unwitting accomplice in a foiled Chinese cocaine deal. Wrongly imprisoned, he escapes to take his revenge and prove his innocence.",
          "Archeology Professor Robert Burns is on location leading an important dig in the ancient ruins on the Far Eastern Chinese border. He accidentally discovers that the Chinese Mafia, the Tong, is using his newly discovered ancient Chinese artifacts to hide and smuggle narcotics across the border. Robert immediately tries to flee with his assistant and narrowly manages to escape the pursuing Tong but not without a heavy price. His loyal assistant is killed and he is framed with the evidence at the Chinese border by the Chinese military and U.S. Drug Enforcement Agency. He is locked up in a Chinese prison where he is guilty until proven innocent. His loving wife Maya vows to help get him out of jail. The DEA finally convinces the Chinese military that Robert may be of more help to them outside jail by leading them to the real smugglers. Once he leaves his Chinese prison cell Robert would rather enjoy his freedom back in the U.S. and keep his past behind him, but The Tong catches up to him and threatens not only his life but that of his wife. They threatened the wrong man. Secrets of Robert's past start to emerge as he unleashes his awesome martial arts fighting abilities to defend himself and his wife. Now that The Tong and their drug cartel know who he is they will stop at nothing to kill Robert to protect their own corrupt interests. To avenge the lives of loved ones he has lost, Robert must hunt down, pursue and find each of the Tong members. In a classic homage to Chinese martial arts films, he is involved in intense hand to hand combat including sword fighting, guns, car chases, and other ingenious forms of fighting to mame and kill these Tong members. He deciphers their ancient coded Tong tattoos which leads him to their don, Wong Dai- The Emperor; the man who controls an empire of crime and corruption across many borders. As an added twist Robert discovers upon meeting Wong Dai, that the evil man himself has been manipulating our protagonist in order to have him kill Wong Dai's own Tong members and thus, secure the ill gotten gains of Wong Dai's empire of crime for himself.",
          "Wong Dai, the world's most powerful Chinese drug kingpin, is sitting at a long table in an old building in Paris, France, going through the motions of a gigantic merger between himself and several other major Chinese drug dealers. Sai Lo controls shipments in the French heroin market in Paris, using laundromats all over Paris as a front. Tang \"The Bird\" Zhili controls the entire New York drug conglomerate from the Chinatown section of New York, and runs Mahjong gambling rackets. Yin Quinshi of Sofia, Bulgaria, controls an Eastern European drug cartel. Li Bo controls drug exports in Shang Hai, China, and has a penchant for French restaurants. Fang \"The Barber\" Lee controls a Paris drug cartel, and he is known to hire unique assassins. And Mr. Chang controls drug money in London, England. Yale University archeology professor Robert Burns, who has just recently won the prestigious and much-coveted Winthrop Award for excellence in archeology, stumbles onto the fact that his expedition to China, near the China/Kazakhstan border, is being used by Wong Dai as a cover for a drug smuggling operation. Realizing the danger of sticking around, Burns and his assistant, Luo Yi, make a run for it, but in the resulting gunfight and chase, Luo Yi is killed, and when Burns reaches the border, he finds that Wong's smugglers have set him up for smuggling the drugs. Burns lands in a Chinese prison, framed for drug-running. Burns is questioned by beautiful Chinese narcotics cop Tommie Ling and surly DEA agent Ed Gray, who want to release him and use him as bait to nail the smugglers. Burns is quickly released and sent to the USA, where he promises Luo Yi's father Luo Dazhong that he will get revenge for Luo Yi's murder, but Wong Dai is not done with Burns yet. Wong Dai sends hit men to Burns's house in New Haven, Connecticut to plant a bomb in Burns's house, which explodes and kills Burns's wife Maya. With the two people closest to him dead at the hands of Wong Dai and his minions, and with Tommie and Gray shadowing his every move, Burns is out for revenge. As it turns out, Burns was not always a Professor. He was once a master thief of Chinese artifacts, who served time in prison and earned his archeology degree while in prison, and he changed his name and married Maya after he was released. With his determination to exterminate those who killed Maya, Burns tells Tommie and Gray to stay out of his way, as he cuts a bloody path through Chinatown and across Europe on his way to a confrontation with Wong Dai."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "3Exi84QBEuMZ1zZ3rFNh",
        "_score": 17.426548,
        "title": "The Advocate",
        "year": 1993,
        "genders": [
          "Crime",
          "Drama",
          "History"
        ],
        "score": 6.6,
        "directors": [
          "Leslie Megahey"
        ],
        "writers": [
          "Leslie Megahey"
        ],
        "synopsis": [],
        "summaries": [
          "In medieval France, young lawyer Richard Courtois leaves Paris for the simpler life in the country. However, he is soon drawn into amorous and political intrigues. At the same time, he is pushed to defend a pig, owned by the mysterious gypsy Samira. The pig has been arrested for the murder of a young boy.",
          "Set in fifteenth century France. A Parisian lawyer wearies of the cynical sophistication of the capital and solicits appointment as the public defender in a remote, rural province. He finds himself expected to defend a pig in a murder trial. (As the public prosector says, \"Anyone who knows animals knows there are good ones and bad ones.\") What initially appears to be a case based on simple rural superstition turns out to conceal a far worse corruption. Eventually the lawyer returns to the capital, having learned that cynical sophistication is not so easily evaded."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "20xi84QBEuMZ1zZ3rGBl",
        "_score": 17.110119,
        "title": "V for Vendetta",
        "year": 2005,
        "genders": [
          "Action",
          "Drama",
          "Sci-Fi"
        ],
        "score": 8.2,
        "directors": [
          "James McTeigue"
        ],
        "writers": [
          "Lilly Wachowski",
          "Lana Wachowski",
          "David Lloyd"
        ],
        "synopsis": [
          "\"Remember, remember the fifth of November, the Gunpowder Treason and Plot. I know of no reason why the Gunpowder Treason should ever be forgot.\"The film opens with a recitation of these words as a flashback sequence brings us to early 1600's England. Guy Fawkes is captured and executed for his attempt to blow up Parliament, a plan he hoped would restore Catholic rule to a Protestant throne.In the near future, in Great Britain, a young woman named Evey Hammond (Natalie Portman) is shown preparing to go out for the night while she watches a TV program hosted by Lewis Prothero (Roger Allam), the proclaimed 'Voice of London' and a firm supporter of the fascist Norsefire Party that has replaced the old government. A mysterious figure dressed in black mirrors Evey's actions as he too watches the program from his own home. Prothero reveals that the government is based around religion and faith, reciting the mantra 'Strength through unity. Unity through faith'. Disease, violence and war (blamed primarily on the 'former' United States), and the fear and resentment of particular groups within the country including homosexuals, Muslims, and immigrants fueled the dramatic change and put the current leader, Chancellor Adam Sutler (John Hurt), in command.Evey shuts off the program and heads out the door. As she walks into an alley, she is stopped by a few men who scold her for being out past curfew. When they become physical she pulls out a can of mace but they then reveal themselves to be members of the Norsefire secret police; 'Fingermen', and threaten Evey with sedition. She pleads for mercy before the men grab hold of her with the intent to rape her. The cloaked figure in black appears in the alley, wearing a Fawkes mask and hat, and quickly dispatches the Fingermen before introducing himself to Evey as 'V' (Hugo Weaving). Showing a penchant for theatrics with an impressive play on words, he invites Evey to accompany him to a nearby rooftop to watch a performance of his. There, they have a clear view of The Old Bailey and V explains that he's there to commemorate a special day in history, one he intends to use as a symbol against the tyranny that has replaced Lady Justice with a false idol. As Big Ben tolls midnight, the fifth of November, V recites the centuries-old adage before conducting the finale to Tchaikovsky's 1812 Overture which plays over the loudspeakers throughout the streets of London. At the moment of crescendo, The Old Bailey explodes in a brilliant display. V laughs hysterically while Evey can only watch in horror.Following the explosion, a congregation of Norsefire's elite meets in a secret conference with Adam Sutler, his face projected on a large screen. Included are Inspector Eric Finch (Stephen Rea) of the police, Roger Dascomb (Ben Miles) of television broadcasting, Brian Etheridge (Eddie Marsan) of the auditory surveillance system, Peter Creedy (Tim Pigott-Smith) of the secret police, and Conrad Heyer (Guy Henry) of the CCTV. Effectively and respectively, they make up the nose, mouth, ears, fingers, and eyes of the government, with Sutler sitting at the brain. Sutler decrees that the destruction of The Old Bailey is to be announced as an impromptu demolition project to make way for a new building while an investigation ensues to find out who the man in the Fawkes mask is. While V's remains a mystery, Evey's identity is quickly discovered thanks to video surveillance and Sutler demands her capture and interrogation.The next morning Evey, working as an assistant within the broadcasting station, jokes with security guard Fred (Andy Rashleigh) before delivering an unmarked package to the costume department. As her supervisor opens it and discovers black cloaks and Fawkes masks, V walks into the lobby of the station with a bomb strapped to his chest. Inspector Finch and his partner Dominic Stone (Rupert Graves) hurry to the station in order to apprehend Evey while V disengages the elevators and forces most of the station to evacuate. As Evey nervously walks through the crowd towards the stairs, she catches sight of Finch and Dominic backed by supporting officers. She runs and hides in a nearby office while V orders the television crew to run a video on the emergency broadcast system, allowing his message to play on every TV in London. He addresses the general populous and introduces the fact that there is something wrong with the country. He encourages people to speak about the truths of cruelty and injustice and put away the fear that, he explains quite frankly, put them in this situation in the first place. V admits to blowing up the Old Bailey, explaining that he sought to end oppression where freedom should stand and invites all of London to join him in one year in front of Parliament where he promises to give them a fifth of November that will never be forgot.As the broadcast ends, Dascomb grabs a small video camera and follows the police to the studio where they manage to break down the door. Heavy fog obscures the room and a dark figure runs towards the police. They shoot the man, who is wearing a Fawkes mask, but discover that he's an employee who explains that everyone in the room was given the costumes to wear. Finch orders everyone on the ground as he and the other officers go to the control room where V left his bomb wired to the control system. Dascomb attempts to disarm the bomb and is successful. Two men in Fawkes masks fall out of an elevator at the other end of the floor in front of two officers and the first figure screams that the other is 'him'. However, as one officer pulls off the mask to find it's Fred, the real V stands behind them and dispatches the officers with hidden knives. Fred passes out. V goes to leave but is stopped by Dominic who fails to see Evey sneak up behind him. She taps his shoulder and maces him before he blindly hits her with his gun, rendering her unconscious. V knocks Dominic out and stops to contemplate Evey.A bruised but alive Dominic watches the surveillance tapes later on with Finch who watches as V looks at Evey. He comments that Evey is with him now, for better or worse. Meanwhile, footage of the police raid on the station is broadcast with claims that the terrorist was presumably shot and killed, much to the disbelief of one bespectacled girl (Billie Cook).Evey wakes up in a bed that is not her own and follows the sound of music coming from an old jukebox inside an enclosed foyer. V appears behind her and explains that, since she saved him but was unconscious, he made to decision to carry her to his lair, the Shadow Gallery, a place filled with various bits of art and culture that had previously been confiscated by Norsefire. Evey thanks him and asks to be released but V tells her she must stay here until his goal to destroy Parliament is completed in a year's time, otherwise she would be quickly captured and forced to give information about V. Naturally upset by her forced containment, Evey runs to her room. Much later, Evey concedes to leave her room and she finds V in the kitchen cooking eggs. He serves her and pours her tea while acknowledging his sincerity in the video he sent across London. He plans to destroy Parliament, not just to bring down a building, but to instill a very powerful idea in the British people and to impress that their government should be afraid of them, instead of the other way around.Some time later we see Prothero showering in his home while watching one of his own broadcasts, repeating every word with vigor as he denounces the terrorist as a coward. V silently enters his loft with Evey's ID card and confronts Prothero as he comes out of the shower. When V addresses him as commander, Prothero suddenly recognizes him. Later, Finch and other officers investigate Prothero's loft where his body lies on the bathroom tiles, vomit beside him and a rose across his chest. During research, Finch finds out that Prothero was a very wealthy man well before his broadcasting show and used to be a commanding officer at Larkhill, a now abandoned government facility.Back in the Shadow Gallery, after a play bout with a suit of armor, V invites Evey to watch The Count of Monte Cristo (1934) with him, a film about love and revenge. After the film, Evey catches a glimpse of the news where the death of Prothero is announced. Suspicious, Evey questions V who admits that he killed Prothero and plans to kill others for justice, though Evey doesn't understand his motives. Shaken by this, she resolves to escape V's lair. To do so, she offers her assistance and some back story to her life. She explains that her parents both protested the government following the death of her little brother due to a deadly virus leak at his school. She was young but remembers the riots and protests and how her parents were taken from her in the middle of the night, black bags forced over their heads. She was sent to a juvenile detention center but never forgot the lessons her parents taught her. Inspired by this, V agrees to let her help and comes up with a plan for his next victim.Bishop Anthony Lilliman (John Standing) walks through his church and is met by a page who tells him his latest 'guest' has arrived but is older than expected. Lilliman walks to his room where Evey, dressed as a young girl, is waiting for him. While V scales the rooftops, Evey attempts to warn Lilliman of the danger he's in, but the bishop thinks that her story is part of an act and tries to have sex with her, forcing her down on the bed. She manages to kick him off her, resulting in a slew of un-priestly curses from him, before V enters the room. Evey apologizes and runs off before V assaults Lilliman, promising no mercy. A nearby surveillance van picks up the audio conversation between Lilliman and V and calls dispatch. Finch arrives shortly to find Lilliman dead, also having vomited and with a rose on his body, before Creedy arrives with his own special force. He puts Finch under surveillance, claiming that the extra precautions are needed since a couple of respected party members have been slain and argues that Finch put a hold on his investigations surrounding the terrorist's link with the victims.Evey finds sanctuary with her boss, Gordon Deitritch (Stephen Fry), whom she had been going to see the night she met V. He allows her to stay with him and, as a sign of trust, shows her a hidden room behind his wine cabinet. There, he reveals a copy of the Koran amid photographs of homoerotic scenes with muscular men. He admits to being, like her, a fugitive and explains that he hides his true self in plain sight on television and by entertaining young women like Evey within the privacy of his home. The next morning, he coincidentally makes Evey the same breakfast V served her while she was in the Shadow Gallery. Gordon finds the coincidence funny and quips that only the things that matter most should be considered with such humor.Finch continues his investigation unabated with Dominic and focuses his attention on Larkhill, the records of which prove to be stubborn in revealing much information. He does find that Lilliman was also stationed there as a priest for enemies of the state that were confined there. Out of the list of high ranking officials left alive, Finch finds just one; a woman who worked as a chemist, although her name is unavailable. He then goes to see a coroner named Delia Surridge (Sinéad Cusack) and presents her with the flower that he found on Lilliman. Delia recognizes the flower as a scarlet carson, thought to be extinct, but admits that she can't offer any other information. When Finch returns to headquarters, Dominic informs him that he's found out who the mystery woman is; Delia. Shocked, having just seen her, Finch leaves, hoping he's not too late.Delia wakes in her bed and speaks to the shadows in her room, asking if he's come to kill her. V appears and responds yes, to Delia's relief. She converses with V, admitting fault in what happened to him but defending her intentions, which were for the best. Though V tells her he cannot allow her to live, he reveals to have given her a quick injection while she slept, providing an easy and painless death. Delia apologizes and succumbs peacefully moments before Finch arrives to find her in bed with a scarlet carson in her hand and a small red notebook on her bedside table.Finch presents the notebook to Sutler who dismisses the contents as either propaganda written by the terrorist or the ravings of a delusional ex-party member. Sutler advises Finch to forget about the journal, but Finch can't help but recall what he read. The notebook was a diary of Delia's and chronicled her start at Larkhill 20 years prior as a medicinal chemist. She writes how she tested virulent drugs on vagrants and deviants of society who she found herself despising because of their pathetic disposition. She mentioned working alongside both Prothero and Lilliman. All tests on subjects proved fatal except in the case of one man who resided in room five. In his case, though he had a near complete loss of memory, he developed quick reflexes and strength. On November fifth, the laboratory where she worked exploded violently and, as she escaped the compound, saw the man from room five, horribly burnt and roaring in anger.Evey, meanwhile, shares an evening with Gordon as he shows her the premiere of a new show he wrote that morning and uncensored by the department. She gulps her champagne as she watches Gordon welcome Chancellor Sutler (an actor impersonator, as the real Sutler watches from his own home) to his studio while armed soldiers hold shotguns towards the audience, prompting them to applaud. Sutler is offered a glass of warm milk in reference to the real Sutler's habit of drinking one every night (we see this is indeed true). A hilarious skit ensues as an actor dressed as V ties Sutler's shoelaces together while he calmly assures everyone that the terrorist has been neutralized. Upon discovering V trying to blend in the studio band, Sutler stumbles on his feet and a comedic chase progresses across the stage to the sound of Yakety Sax. Finally, Sutler grabs hold of V and removes his mask to reveal another Sutler copy who says that he's the real one. They both order the soldiers to open fire and are shot down while the audience laughs and the real Sutler breaks his glass in fury.While Evey is worried that Gordon will face severe repercussions, he is optimistic and tells her not to fret. However, that night, Evey awakes to glass breaking as Gordon rushes into her room, telling her to hide. She gets under her bed (mirroring the scenario when her parents were taken from her) as the bedroom door is broken down. Creedy enters with soldiers and they beat and restrain Gordon, placing a black bag over his head and taking him away. Evey manages to climb out the window down to the back yard, but she is apprehended and black-bagged just before she can escape. When the bag is removed, she finds herself in an interrogation room with a government official hidden in darkness asking her about the location of the terrorist. When she is unable to answer, she is 'processed'. Her head is shaven and she is tortured and given rotten food while kept in a small cell. One day, she hears a rustle from inside one of the side walls and discovers a small note written on toilet paper. She uses the light coming from under the door to read the note from a woman named Valerie who tells a brief story of her life and how she wound up confined. Valerie (young - Imogen Poots older - Natasha Wightman) describes how she first fell in love with a girl in her class named Sarah (Laura Greenwood) and when she was disowned by her parents for being a lesbian. She met the love of her life, Ruth (Mary Stockley), while acting in a film and they moved to London together as America's war worsened and the government began to change. Fear and persecution against anyone unworthy in Sutler's mind, including homosexuals and Muslims, led to their detainment. Ruth was taken away shortly before Valerie was. She ends her note by offering some solace in the fact that, while her life may be taken, she will still retain her integrity as a human being and tells the reader that, though she does not know them, she loves them.Tearfully inspired, Evey is once again brought to the interrogation room where she refuses to cooperate, despite threats of death. She is returned to her cell to await execution. An official arrives and asks Evey to give just one bit of information to save her life, but Evey says she'd rather die. The man then tells her that she now has no fear and is completely free before leaving. Confused, Evey gets to her feet and walks out the open door. She goes down a corridor and turns a corner to see that she is in none other than the Shadow Gallery. V appears before her and explains that he was the one to bring her here and that Gordon was unfortunately executed once the police found the hidden room behind the wine cabinet. V tells her that, while her imprisonment was a farce, it was to bring out in Evey what V experienced; to allow her to let go of fear and hate and realize that there's something more important than even her life. Evey angrily retorts, claiming the inability to feel anything anymore and collapses to the ground, short of breath. V catches her and comforts her, asking her to remember the atrocities committed against her and her family and recall what she felt when she said she'd rather die than give in. But Evey begs to be let outside, feeling faint. V takes her to the roof where it is raining. Before he can cover her with a blanket, Evey steps out into the rain and raises her arms, laughing in a moment of pure release, just as V once did.Back in the Gallery, Evey tells V that she can no longer stay with him and, now that she fears nothing, will return to the outside world to take her chances. She motions to give V the note she found, thinking he wrote it, but he shows her a shrine surrounded by scarlet carsons with Valerie's photo above it. He tells Evey that the note was delivered to him as it was to her and that Valerie died in Larkhill where he was also kept. He maintains his vindication that what was done to him must be repaid. Evey approaches V and thanks him before agreeing to his request to visit one last time before the fifth. She then leaves. V returns to his room and removes his mask, throwing it against the vanity mirror and breaking down in tears.At an elite meeting with the party members, Sutler reminds them that their inadequacies are mounting, especially those of Creedy, in the attempt to apprehend and stop the terrorist. He issues stricter curfews and harsher surveillance on civilians who, he is angered to hear, converse regularly about the terrorist and how they believe he is still alive.Finch is contacted by a mysterious man named William Rookwood who promises to give him invaluable information regarding his investigation. Intrigued and having come to his own predispositions about the shady goings on of the government, Finch goes out to meet him in a secluded lot. Rookwood tells him of the origins of Adam Sutler who came into his own by starting his own party that gained recognition by divulging in tests for biological weapons in the name of national security. From the blood of one of their victims (namely, V, which explains his determination for retribution; he feels to blame) they were able to procure a deadly virus that they secretly released, with strategic precision, within their own country; inside a school, a tube station, and a water-treatment plant for maximum effect. Naturally, when the public panicked and went in search of a savior, the very party that released the virus is the one to magically provide a cure. In return, they gained power, using fear and scapegoats out of political extremists to justify their cause and to blame the initial virus on. Rookwood then advises Finch to put surveillance on Creedy so that Rookwood may feel confident to show himself again and prove all he's said to the inspector. Finch hesitantly agrees. However, he is infuriated later when he discovers that the character of Rookwood has actually been dead quite some time; it was V in disguise all along. Finch goes back to his previous investigation while Creedy remains under supervision.V visits Creedy in his home, playing loud music so that their conversation cannot be taped and offers Creedy a proposition. He tells him that, once he destroys Parliament, Sutler will have no use for Creedy and will offer him up as someone to blame. If Creedy gives Sutler to V, Creedy's position will be suddenly promoted and he will have V to deal with as he chooses.As the fifth of November nears, thousands of crates are delivered throughout London, including to Finch. He opens the box to discover a costume with a black cloak, hat, and Fawkes mask. The little bespectacled girl seen earlier proudly wears her costume on the streets but Sutler decrees that anyone seen wearing them will be arrested on site. Finch speaks with Dominic in private, speculating that what follows will be what V wanted all along; complete and utter chaos. Everything is part of a plan; a grand scheme that was put into effect before the government had even fully formed, even before Larkhill. And when someone does something stupid, everything will fall apart. This speculation is metaphorically shown as die falling into place within a large arrangement that V sets up on the floor of his gallery, all while citizens across London begin to riot. The bespectacled girl is shot down by a fingerman in her costume and, though he displays his Norsefire badge to enraged adults, he is mercilessly beaten.The Norsefire party convenes for the last time in front of Sutler where he fumes over their inability to capture the terrorist. He proclaims that, should anything happen to Parliament, the only thing that will change will be that he reads Creedy's resignation the following morning instead of the newspaper. He then demands, amid claims that record arrests are being made, that the citizens of the nation need to be reminded of why they need the government.Evey returns to the Shadow Gallery on the eve of the fifth where V is musing over his music. He admits that he never expected to see her again and asks her to dance. She asks to see his face, since she still knows nearly nothing about him, but he affirms that the face he has is not who he really is. He then says he has something to give her and leads her out of the gallery to an abandoned subway tunne beneath the building. There sits a train filled with explosives which V says will course along its track straight to Parliament, as long as Evey decides it should. V says that the decision to move forward should be the people's to make, not his. He will, meanwhile, go meet his fate. Evey begs him to stay, kissing him, but he solemnly refuses and disappears down the tunnel.While V heads to a dark section underground to meet Creedy with his most trusted soldiers, Sutler gives a speech on the emergency broadcast system throughout London, urging people to stay in their homes and vowing swift justice against anyone caught outside past curfew. However, each room and venue the speech plays to is void of an audience. V appears to Creedy who has held his end of the bargain; Sutler, bound and black-bagged on his knees. V places a scarlet carson in Sutler's lapel before Creedy shoots him in the head. Creedy then demands that V remove his mask. When V refuses, Creedy orders his men to open fire. V is hit by a barrage of bullets but composes himself. He rushes forward with his knives, killing each soldier before they can reload. Creedy shoots V multiple times, wondering aloud why he won't die, before V tells him that beneath his mask is more than flesh; \"there's an idea, and ideas are bullet-proof\". V puts his hands around Creedy's neck and breaks it swiftly before staggering back down the tunnel. He removes a large metal chest plate, having saved himself from immediate death, but continues to bleed profusely from other wounds.Evey waits for him back by the train, contemplating what he told her, as he returns, collapsing to the ground. She takes him in her arms and he tells her that he 'is done and finished' before confessing to having fallen in love with her after so many years of living with nothing but revenge as the reason for his existence. Evey tells him she doesn't want him to die, to which he says that that's the most beautiful thing she could have given him, before dying.Meanwhile, armed guards surround Parliament but cannot get in touch with anyone of authority. Soon, they see a massive mob of people walking towards them, all clad in Fawkes costumes. Without a voice to give orders, they are forced to put down their weapons and allow the people to walk past them. Finch finds his way into the subway and discovers Evey at the controls to the train. She had placed V on a bench inside the train, arms crossed and covered in roses. She tells Finch that the country needs more than a building now; it needs hope, as she pulls the lever and steps out of the train. As the car moves forward, she leads Finch to the roof where they have a clear view of Parliament. In front of them, and all the people convened, Parliament explodes in a radiant display to Tchaikovsky's Overture. Finch asks who V was. Evey says that he was her brother, father, mother, and friend. \"He was you, and he was me. He was all of us\", setting in her words that V represented the whole country, finally strong enough to take back its freedom. The citizens in front of Parliament remove their masks, revealing Gordon, Ruth, Valerie, the bespectacled girl, and all those who dreamed of freedom and finally received it.Evey gives a closing narration, stating \"no one will ever forget that night, and what it meant for the country. But I will never forget the man, and what he meant for me.\" as several red fireworks launch in a V formation, symbolizing the man who gave that country hope.The screen fades to black and credits roll."
        ],
        "summaries": [
          "In a future British dystopian society, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow the tyrannical government - with the help of a young woman.",
          "In the distant future, Evey Hammond is an average citizen of the United Kingdom, which is under the rule of the fascist and tyrannical Norsefire Party. She is an employee of the state-run British Television Network, but soon, she becomes the number one enemy of the state together with an enigmatic and larger-than-life freedom fighter known only by the letter \"V\". V informs Evey that she must hide in his underground lair for at least one year, and while she is reluctant to the idea at first, a bond soon forms between the two individuals. In the meanwhile, the mysterious past of V is gradually revealed to the police inspector tasked with capturing him, Eric Finch, and it is not long until he starts questioning everything his government stands for.",
          "Tells the story of Evey Hammond (Natalie Portman) and her unlikely but instrumental part in bringing down the fascist government that has taken control of a futuristic Great Britain. Saved from a life-and-death situation by a man in a Guy Fawkes mask who calls himself \"V\" (Hugo Weaving), she learns a general summary of V's past and, after a time, decides to help him bring down those who committed the atrocities that led to Britain being in the shape that it is in.",
          "Set against the futuristic landscape of totalitarian Britain, this movie tells the story of a mild-mannered young woman named Evey (Natalie Portman), who is rescued from a life situation by a masked guy known only as \"V\" (Hugo Weaving). Incomparably charismatic skilled in the art of combat. V detonates two London landmarks and takes over the government, urging his fellow citizens to rise up. As Evey uncovers the truth about V's mysterious background, she also discovers the truth about herself and emerges as his unlikely ally in the culmination of his plot to bring freedom and justice back to a society fraught with cruelty and corruption.",
          "In the not too distant future, Britain is filled with torture cells, unfair punishments, prejudice against minorities. However, in the midst of all this chaos, one man known only by the name V (Hugo Weaving) dares to stand up to the government and is labeled as a terrorist. One night V rescues a mild young woman called Evey Hammond (Natalie Portman), and an unlikely bond between the two emerges which results with Evey becoming Vs ally. But though V may be charismatic and have a passion for justice he also is bitter and has his own personal hatred of the government for something they did to him long ago. As November the 5th, the day V says he and those who will follow him will stand up to the government once and for all approaches, Detective Finch (Stephen Rea) becomes more and more determined to uncover the truth about V, however his search leads him to ask to question whether or not he is on the right side.",
          "In this obscure and Gothic tale, one attractive girl, Evey (Natalie Portman), gets involved accidentally in a terrorist attack, perpetrated by a masked and megalomaniac character, V (Hugo Weaving). V is following the same steps of Guy Fawkes, a sort of terrorist of the XVII century, who wanted to blow up the English Parlament in London. However, in present time, the Orwellian London lives under the fascist government of Chancellor Adam (Sir John Hurt), and V will fight against his regime, using the power of powder, blowing up important buildings. Evey will be chased by the Secret Police, thinking that she's the accomplice of V, who will accomplish Fawkes' mission of destroying the Parlament on the 5th of November, in this mixture of The Phantom of the Opera, George Orwell's 1984, and Batman."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "Lkxi84QBEuMZ1zZ3rHBq",
        "_score": 16.145765,
        "title": "The Family",
        "year": 2013,
        "genders": [
          "Comedy",
          "Crime",
          "Thriller"
        ],
        "score": 6.3,
        "directors": [
          "Luc Besson"
        ],
        "writers": [
          "Luc Besson",
          "Michael Caleo",
          "Tonino Benacquista"
        ],
        "synopsis": [
          "The camera pans out on a family of four eating a meal together. The doorbell rings, and the husband/father answers. As he puts his eye to the peephole, a bomb explodes, blowing his corpse back to the dining table. The wife/mother frantically tries to call the police as a man in a black hat and coat walks through the destroyed door, holding a gun. He rubs out the rest of the family, including both adolescent kids, without a word. He then takes a hatchet from his briefcase and hacks off a finger from the man's hand.The voice of Fred Blake (Robert De Niro) says that the only question people should ask is the value of a man's life. Fred says he's worth $20 million, and he'd give away the entire fortune to get his old life back.Fred is riding in a car driven by his wife, Maggie (Michelle Pfeiffer), while their two kids, Warren (John D'Leo) and Belle (Dianna Agron) ride in the back with the family dog, Malavita. They're all heading toward a new home in Cholong-sur-Avre in Normandy, France. Maggie is unsure of the house's exact location because the houses on the street have no numbers, but Fred is able to locate the correct house due to instructions from an acquaintance named Stansfield.They all get settled in, unpacking some of their belongings, which are already there (although the TV is late in arriving). During small talk, it's revealed that the Blake family has lived in the Riviera and Paris.Maggie offers to help Fred unpack, but he tells her to get the kids to bed, as they have school the very next day. The real reason, however, is that unknown to the rest of the family, Fred had a dead body in the trunk. He buries it in the back yard while nobody is looking.In the morning, over breakfast, it's revealed that the Blake family has used different surnames in different parts of France. After Warren and Belle leave for school, Maggie tells Fred she's going to pick up groceries, and that Stansfield said that until he arrives that day, Fred shouldn't step outside the house. They need to come up with something to tell the neighbors, and if anyone were to ask, they should say they're American.The Blake family are federal witnesses. Fred's real name is Giovanni Manzoni, and he and his family were part of a mafia family from Brooklyn. Giovanni's grandfather drove one of the cars at the funeral procession for Vito Genovese's wife, and Gio's father was one of 107 mob bosses to attend a notorious 1957 Apalachian Convention. Giovanni and his family are in Witness protection because he turned informant and testified against a high-ranking Don named Luchese (Stan Carp), sending him to jail. Squeaking rats being one of the most despised things among the mafia, the whole Manzoni family has a $20 million bounty on their heads. Stansfield is the family's FBI contact.Soon as Maggie is gone, Fred steps outside. He's seen through a camera lens, and he seems to turn right toward it, as if he knows the person or persons with the camera, are there. Later, he rummages through some of the family belongings until he finds something he appears to prize: a manual typewriter.The Manzonis waste little time starting to run afoul of the locals and the way of life in Cholong-sur-Avre, and they deal with it the best way they know how: mafia style. Maggie stops for coffee and learns the closest sightseeing attractions are in another town, twenty kilometers distant. Warren runs into a group of young French students led by Andre (Jonas Bloquet), who want to shake him down for some cash, take his backtalk with disdain, and mudhole stomp him in a locker room.Maggie is annoyed with the stereotypical anti-American sentiment of the French grocery store owner and two French customers. She grabs some materials that act as a makeshift explosive and sets it off in the back of the store, destroying much of it.Meeting for lunch, Belle and Warren strategize. As the outsiders in a foreign school, they need to stick close together. Warren has cased a majority of the students and has learned who runs 'contraband' (like cigarettes), and who can be exploited for what-- including the potential to turn the tables on Andre's gang, who beat him up and hit on Belle.Fred begins typing a memoir of his life on the typewriter. Later, he goes out into the backyard and is spotted by a neighbor tending to his rose garden. The neighbor strikes up small talk, which proves troublesome for Fred. Asked about his work, he says he's a writer. Afraid to say he writes novels, because he doesn't know anything about it, he says he's writing about the armed forces landing at Normandy on D-Day... and finds his neighbor knows a lot about this subject; much more than Fred himself.Maggie visits a church, where the local priest makes her acquaintance. He greets new arrivals cordially, which is something Maggie feels she and her family need right now.After school is done for the day, Warren goes right to work. He finds that an engineer's son collects trading cards for the Paris S.G. and is only missing one card, ready to give anything in return for it. Warren assures the youth he'll see if he can help acquire it. Meanwhile, Belle is walking home when Andre and his gang start following her in their car, offering her a ride. When Belle realizes she missed a turn trying to ignore them, they take advantage, asking where she lives and then telling her it's miles away, and it'll be dark before she gets home. Against her better judgment, Belle accepts the offer of a ride, and she doesn't need long to see through the French boys' charm; they drive to a local leisure park and lay down a picnic blanket. They clearly have seduction on their minds. Their overconfidence proves deadly, as they allow Belle to rummage through the trunk of their car, where she finds a tennis racket. She knocks Andre down and viciously bashes the racket against his head until it breaks, before giving the shocked boys a stern lecture on how young women deserve to be treated. She gets in their car and drives off, leaving them there. She drives partway home before leaving the car on the shoulder of the road and walking the rest of the way.The scene shifts to Attica State prison, where a guard delivers a bucket of ice to Don Luchese. Despite being in prison for life, Luchese lives like a king, with a private cell furnished nearly as well as a good quality motel room, and at least one of the guards caters to him as well. One of Luchese's underlings is in the prison with him. He takes the bucket and dumps it in the sink; among the ice is the finger hacked off from the man who was killed the beginning of the movie. The ice kept it fresh so that Luchese is able to take a fingerprint and compare it to Fred's prints from a copy of his Buffalo police record. The prints don't match, so Luchese knows that the Manzonis are still alive. They call Rocco (Jon Freda), who carried out the hit, to inform him, and he promises to continue looking.The Manzonis are making small talk over dinner when Stansfield (Tommy Lee Jones) shows up to see how their first day went. He's also there to make sure the Manzonis behave themselves: two weeks ago, in Nice, Maggie bought a dozen lobsters from a man named Mourad, that turned out to be rotten; Fred beat Mourad to a pulp, and two days ago, Mourad went missing (he's the stiff that Fred buried in the backyard). That the Manzonis bought a whole dozen lobsters smacks of a 'business deal;' the kind the Manzonis aren't allowed to make, as per the terms of the Witness Protection program. Stansfield has had to relocate the Manzonis numerous times because of how they all handle 'fitting in' at each new place. His job is to keep them safe, but they're making his job very hard.That night, Fred has a nightmare about a party he and Luchese's men co-hosted back in Brooklyn; he happens to turn and look at Luchese, who runs a finger across his throat, and suddenly every guest at the party turns toward Giovanni, pointing a gun at him.Fred is at his typewriter again, continuing his memoirs. He says, in a voiceover, that Stansfield's duty is to tell the 'official' version of what happened to get a $20 million bounty on the lives of all four Manzonis. Fred wants to write down the whole truth, just once, without any deception, even if nobody reads it. He says his story is impossible to just make up. It turns out Maggie has suspected what Fred was up to, and she's plenty angry about it, even a single typed hardcopy, as opposed to something written on computer disk, is at risk of being seen by the wrong eyes. Maggie insists she could have been consulted, but the last time Fred did that, she had him say he was an architect and suddenly everyone was coming to him for advice on expanding their homes. For now, Maggie wants her husband to be a plumber; the sink's tap water is brown, and can't be trusted for washing or drinking. She called the local plumber twice and he never showed.Maggie steps outside, looking around for prying eyes, and goes to a nearby house where two FBI agents, Caputo (Domenick Lombardozzi) and DiCicco (Jimmy Palumbo), are watching over their safety. She brings them some home-cooked food, making pleasant small talk. Unlike Fred, Maggie knows the value of proper diplomacy and keeping on the agents' good side... and she can use the company, being Americans in a country infamous for not looking kindly on most Americans. During small talk, it's revealed that Stansfield is arranging for the Manzonis to host a block barbeque to meet and get acquainted with most of the neighbors.The next day at school, during lunch, Belle and Warren again strategize. Warren has been hard at work doing 'business' of his own; he's made a fake copy of the last trading card the engineer's son needs; in return he gets a copy of math homework which he trades to another student for another favor. He also gets a copy of the Goth girl's school report, promising to alter it in a way her parents would like, in return for an equal share of the cigarette market. He also 'picked up' a splinter so he could raid the school nurse's medicine cabinet for some energy pills he sells. Belle, meanwhile, found out who took something from her purse, and beat the girl to a pulp in the rest room.Belle looks across the lunch room and her gaze falls across a handsome young man, who Warren knows is a college student doing substitute teaching work for a disliked regular who's on maternity leave. The substitute is studying for a very difficult math exam, and all the senior-level girls have the hots for him.Still with Caputo and DiCicco, Maggie looks through their binoculars with which they spy on, and gather information about, all the neighbors, to watch for any security threats. Maggie also sees the plumber show up at her house, and smiles to herself in satisfaction.The plumber, Ramirez (Tonio Descanvelle), tells Fred that the brown water could be a result of either the house's pipes, which are very old, or the town water mains. If it's the mains, the Manzonis would need to take it up with the town mayor; if it's the pipes, they'll need a full overhaul, which will cost a great deal of money and take a great deal of time. Ramirez gets very condescending and rude as he suggests Fred call Ramirez's wife, pay 50% up front and make another appointment. He boasts about his family, fathers and sons, being plumbers for five generations.When Ramirez asks Fred about his line of work, Fred turns toward a nook in the basement and pulls out a baseball bat. Cut to Maggie still watching through the binoculars, and she sees Fred carrying an unconscious Ramirez out of the house and putting him in the back of his plumber van, before Fred gets into the driver's seat and drives the van off.As school ends, Belle makes her move on the substitute, Henri (Oisín Stack), telling him she needs private tutoring in math.Andre and gang meets the engineer's son to acquire a hi-fi they need for a pre-prom party, only to find that the engineer's son and several other students are working with Warren. The bully gang gets their taste of being on the wrong end of a beatdown.Fred has brought Ramirez to a hospital after having beaten him with an inch of his life with the baseball bat. He's unable to explain to the doctor how Ramirez became so badly injured from 'a fall down stairs,' but finally provides a street-smart escape by saying he's not a doctor himself.Rocco is speaking with Mourad's family, showing them a photo of Fred. He's posing as an FBI agent looking into disappearances. Mourad's wife tells Rocco that Fred is a friend of her husband, and unlike in the photo, he has a beard now. Rocco's questioning makes one of the sons suspicious and he asks to see Rocco's FBI badge. Rocco flashes an evil smile as he agrees to the request, and we then see him looking around shiftily as he steps out of the apartment, after he's killed the whole family.Fred is writing his memoirs, and in a voiceover and flashbacks, he goes over a list of ten points that show he's a 'good guy;' of course, the flashbacks show scenes of his time running a crime ring in Brooklyn that demonstrate just how 'good' of a guy he really is. His top point is that he only causes pain with good reason. Cut to his beating Ramirez senseless with the baseball bat, pounding on him until the bat breaks, and then picking up where he left off with a short-handled mallet.Maggie confronts Fred about crippling Ramirez, but he shuts her up by pointing out he knows about the supermarket she blew up. He starts coming on to his wife, and she's reluctant at first, but Fred knows how to turn the charm up in ways she can't resist.Preparing for the barbecue, Maggie tells Belle that Henri called to find out what time it was. Despite Belle's protests that he's just tutoring her in math, Maggie knows what is really on her daughter's long-term goal list. Warren arrives home with bottles of Coca-Cola, assuring his mother that the French neighbors will be expecting 'greasy, fatty American slop' from the American family living among their midst.As Warren predicted, the whole neighborhood shows up for the barbeque. Stansfield calls Caputo and DiCicco and tells them to go too, as all the neighbors are there and they need to blend in.Maggie greets the incoming guests, playing perfect hostess, until she notices one neighbor (who Caputo and DiCocco had told her, was kleptomaniac) quietly pocketing some silverware. Maggie pours the neighbnr some champagne and whispers to her to put the silverware back or Maggie will break her arms.Fred hasn't come out yet; he's still writing. Maggie sends Belle to get him. Fred quietly tells Belle one of his regrets; despite the zeal with which he carried out his work as a crime boss, he regrets not always having done right by his kids. Belle assures him that she loves him and wouldn't trade him for any other father, and this convinces him to come out.No sooner is Fred preparing the barbeque, however, when several neighbors start telling him that the method he's using isn't efficient, and how he should really be doing it for better results. He smiles politely, but his eyes show his irritation. As they continue laughing, we see Fred lose his cool and start maiming them-- until Stansfield taps his shoulder, showing it was just Fred imagining it. Sharing a drink with Fred at the bar, Stansfield reveals that Whalberg, a contact who's recently been elected to the Senate, was worried about Fred telling the latest neighbors that he's a writer. Whalberg and Stansfield know that Fred is writing personal memoirs, and Stansfield is there to caution him about what he puts in them, and whether or not it's a good idea to let anyone see them.As the party is wrapping up, Maggie comforts Belle about Henri not having shown, and Stansfield drops a not-so-subtle warning to Fred regarding one of Gio's former associates.The next morning as they walk to school, Warren tells Belle that Fred can turn the word 'fuck' into one of the most versatile in the human vocabulary, which makes it curious how he spends so much time writing.Fred goes to see the mayor about the town water main, only to be given a runaround. The mayor insists that the water main is working normally and makes a sticking point about the Manzonis being new in town. Fred shakes hands politely, but we see him enjoying the thought of grabbing the mayor and using the mayor's desk drawer to crush his fingers.At the school study hall, Henri notes that Belle has improved considerably, but she sees she really has her work cut out for her when she learns that once he passes his exams, he plans to move to Paris in search of a full-time main teaching position.Meanwhile, following the trail, Fred visits the town water main. The maintenance supervisor shows that the water is already brown when it reaches the water main, and he suspects a nearby chemical fertilizing plant; the only one of its kind in the area.Maggie is praying at church when the priest arrives. The priest notes that Maggie often comes to pray during midday, but never at Mass. He asks if she's interested in making confession. Maggie warily asks about priest confidentiality, and he assures her that the oath is sacred.During class, one of Warren's teachers requests a homework assignment that's overdue from him; a short story written in English, on wordplay and double meanings, for the school newspaper. She gives him a strict deadline, leaving him scrambling to come up with something on the fly. Remembering a neighborhood mafia party at which all of Luchese's family were present, Warren remembers a double entendre recited by Luchese regarding Boris Godunov: \"If it's Godunov for you, it's good enough for me.\" The much younger Warren had found it funny and laughed along with it. Warren quickly writes it all down for his teacher, and it's printed in the school newspaper. Of course, a copy of this newspaper ends up in the one pair of hands it was never meant for: Don Luchese (a funny series of actions shows how the paper arrives in his cell and gets his attention). He recognizes the short story immediately and glares at the credit: \"Warren Blake, 3e2.\"Fred has just enough time to walk into the office of the chemical fertilizer company president, Mr. Chambard (Serge Tranvouez) when he's told not to talk about the 'brown water' problem. Chambard gives a shockingly rude and crude suggestion to buy bottled water instead of using free tap water. This time it's no mere moment of personal imagination when we see Fred drag a badly beaten Chambard out onto a road with Chambard's motorcycle, threatening to drag him along the road by the cycle. Chambard tells him about one of the turbines and where it is; if his company is responsible at all, the turbine would be the culprit.Fred arrives home to find Stansfield reading his memoir manuscript, and they have it out over the writing, as well as Fred continuously escaping regular FBI surveillance, which is enough to warrant termination of Witness Protection. Stansfield tells Fred he wants the manuscript when Fred is finished.Henri is packing to take a train to Paris, and has prepared some home work for Belle. But it's Belle who's donning the teacher's cap for a lesson in something quite different from math, in the privacy of the office.Mr. LeMercier (Cédric Zimmerlin), the English teacher whose face Fred imagined pushing down on the hot barbeque grill, calls to tell Fred that he's hosted Cholong's film society for five years now; they show a classic film, followed by a debate on it. He's asking Fred to attending a showing of the classic film Some Came Running (1958) by Vincente Minnelli. Not wanting to come across as rude, Fred tells LeMercier that he'll get back to him.Soon as Fred hangs up, DiCicco, who along with Caputo, listen in on all calls to and from the Blake home, promptly grills Fred about his response. Stansfield shows up a few moments later, furious at Fred's leaving the decision open, because it can blow his cover. Trying to defend himself, Fred points out he's supposed to 'integrate' to the community and didn't want to give them a rude brush-off. Fred insists he's going to get a copy of the movie in advance of the showing, watch it at home, and then he's bringing Stansfield to the film society showing and debate, which will earn Stansfield a good write-up in Fred's memoirs (a promise that draws a chuckle from Stansfield).Don Luchese sees Fat Willy (Vincent Pastore), one of the heavy muscle in his organization, and shows him a copy of the newspaper from the school Warren and Belle attend. He orders all available men to head there at once and kill all of the Manzoni family.Warren is summoned before a faculty board to answer twenty-two student complaints. The committee head offers for him to take his pick of where to start: assault, corruption, bullying, and threatening students and faculty alike.Caputo and DiCicco are finding continued surveillance of Fred getting tedious, as he simply sits at his desk in the shed. But in fact, they're watching a cleverly made-up mannequin, as Fred has gone to the chemical fertilizer plant's main turbine. He wires a batch of explosives to a wind-up alarm clock and places it where it will do the 'most good,' but not be easily spotted.Henri calls Belle to tell her that he's certain he's gotten an excellent grade on his exam to qualify for a full-time teaching position, and he's going to stay in Paris a few days to look for an apartment and see his father. Belle's smile reverses as Henri then tells her that her seduction of him was 'a fabulous moment' and 'an experience.' Belle starts to cry as Henri tries to downplay what she thought was a declaration of her undying love (even Caputo and DiCicco call him an asshole for 'doing it over the phone'). Belle tells Henri that love was the only thing that could extract her from the crazy life she's been required to lead, and he's just crushed it, before she hangs up and breaks down in tears.Stansfield shows up to attend the film showing and debate with Fred. He's still quite displeased at being roped into it. Rather than walk, Stansfield says they'll take his car.If life was not taking enough of a downturn for the Manzonis, Maggie goes to the church during a flea market, to find the priest has turned against her. He's appalled and horrified at the confession she's made as the moll of a mob boss. He's under sacred oath not to share the confession, but it's haunted him all week, calling her family out as having made a pact with the devil. He demands she leave the church and not return.The film showing is about to start when LeMercier announces that the Normandy Cinema association has sent the wrong film. Instead of Some Came Running, the film of the night will be Goodfellas (1990), by Martin Scorsese. Stansfield is horrified, wanting to drag Fred away and out of the showing then and there, but Fred pushes for them to stay, because it would look too suspicious if they ran away now; and more importantly, because Fred is extremely familiar with the meaning of the movie's storyline and background, he can be a very credible figure in the debate.Belle overhears Warren hurriedly arriving home and hastily packing. Warren tells his sister that he doesn't want the Feds blaming her and their parents for what he's done at school, so he's running off to Paris. He's prepared forged ID and a passport to assist him in 'starting in the business.' Warren sees that Belle is wearing one of Maggie's pearl necklaces; she tells him she's going to be with the man she loves. Belle hugs her brother and wishes him good luck, telling him she loves him.The showing of Goodfellas finishes and LeMercier asks Fred to sit up front for the debate. Stansfield listens as Fred starts to describe the start of a young teenage boy's start in a life of crime that sounds eerily like his own beginnings.Warren is at the train station waiting for a train to Paris. A train pulls up, and a number of burly men debark, all carrying heavy leather cases and wearing trenchcoats. Warren nearly has a heart attack as he recognizes these men as Luchese's. For a moment he thinks he's dead, but the men walk past him, not paying attention, and not recognizing him, as it's been several years since any of them had last seen him as a child. They pile into two black cars that are waiting for them.With Rocco and Willie are a number of serious heavy hitters: Bernie (Anthony Desio), Tommy (Ted Arcidi), and Billy the Bug (Michael J. Panichelli Jr.), all of whom are huge and burly. Seasoned hit men Paulo (Raymond Franza), Mezzo (David Belle), and Albert (Paul Borghese) round out the hit team.Warren hurries to a phone booth to warn his family. Caputo and DiCicco wonder why nobody's answering, until they see Maggie's car pull in. But just as Maggie reaches the phone, Warren has run out of the phone booth, leaving the phone dangling off the hook.As the two cars drive down the road, Rocco calls Albert on a cell phone and tells them to take care of the fire house, and then meet him and his group outside the town hall. His men will be getting a feel for the town in order to carry out their mission quietly, quickly, and without raising a general alarm.Fred is a huge hit at the post-movie debate, but Stansfield isn't pleased. He calls Caputo and DiCicco, telling them to round up Maggie and the kids for Plan B.Belle calls Henri from a cell phone she's mugged another girl for. She tells him that she just wanted to say that she loves him and that she wanted to hear his voice one more time, 'before she goes.' The camera pans out to show she's on the roof of the Cholong church, and the meaning of 'before she goes' becomes ominously clear.As it happens, Belle is right across from the local police station, and she glances down to see Rocco and Bernie with their men arriving there. They quickly ambush and kill the officers on duty, and access the computer, inputting the name Warren Blake. When a Fred Blake, Maggie Blake and Belle Blake all also come up at the same address, they know they've hit paydirt. Belle watches in growing fear as Rocco and his men exit the station and return to their car. She hurriedly tells Henri she'll call him back; all thoughts of killing herself turning into a need to protect her family.The other group of Luchese's men arrive at the fire house, taking out the one man on duty and puncturing all the tires on all the fire trucks. Warren sees them pulling up to the fire house and turns away desperately, so they don't see his face.Maggie checks in with Caputo and DiCicco, who tell her that Stansfield has ordered emergency evacuation of the family. Fred's performance at the debate has earned him the accolades of, and a standing ovation from, everyone except Stansfield, who's sure that loose lips about his regalement of them with his stories, will lead back to him. Little does Stansfield know that Luchese's men, in a cafe not far, are already meticulously planning their hit; a fully coordinated assault on the Manzoni household. They're not taking any chances at blowing the $20 million bounty. They synchronize their watches; it will be midnight, French time, in 15 seconds.Midnight hits, and the explosives Fred planted at the chemical fertilizer plant's turbine, goes off, destroying the turbine and giving Fred an airtight alibi; he was at the film society meeting, with Stansfield in attendance, the whole night.Everyone, however, feels and hears the rumble from the explosion: Luchese's men, Caputo and DiCicco, and Fred and Stansfield. The feds call the emergency response crews to find the switchboards are down, which they know means serious trouble. Racing back to the Manzoni house with Fred in tow, Stansfield warns Fred that there had better be no trail leading anywhere near him; that Fred's alibi is so airtight is exactly what makes him so suspicious.Stansfield drops Fred off at his house, forbidding him to leave, and calls DiCicco to tell him that he wants the whole family in the house while he swings by the police station.Rocco and crew pull up to a town square and spread out to get a feel for the area. Rocco knows that the Manzonis have federal officers nearby watching them, and he dispatches Bernie to find and deal with them.Despite orders to the contrary, Caputo and DiCicco give in to Maggie's pleas that she be allowed five minutes to find Warren and Belle, and pack some clothes. As she heads toward her house, she spots several of Luchese's men carefully spreading out and staking out key street intersections and all possible avenues of escape for them to cut off and intercept. Making it back to the fed house, she gasps for air and tells Caputo and DiCicco. \"They're here. The streets are crawling with them.\"Stansfield arrives at the police station and finds the dead officers. He warns his men that a cleanup operation is underway.Fred turns on his water faucet and is pleased at seeing clear, clean water emerge. It's the urgent barking of the dog, Malavita, that alerts him to possible trouble. Luchese's men are unpacking all their hardware for the cleanup. Peeking through the window, Maggie gasps in horror at seeing Billy the Bug preparing a portable rocket launcher. She calls Fred, tearfully begging that he pick up the phone. Fred stares at the phone as it rings, listening to both the ringing and Malavita's agitated barking. He's unsure whether the incoming call is to verify that he's home as preparation for a hit.Billy releases the rocket, and the explosion is seen and heard across Cholong. Stansfield steps on the gas to hurry to the Manzoni home. Caputo covers Maggie's mouth to mute her scream. Paulo, on lookout, kills two neighbors who step outside, including Arnaud. Grabbing their heaviest duty ordnance, DiCicco and Caputo tell Maggie that they're going to step out their back entrance, and Maggie is to wait for their signal before following.The two feds never reach the door: Bernie is waiting outside with his automatic rifle, and he kills them both before they know what hit them. Maggie cowers in a corner, but it takes Bernie very little time to find her. Bernie has enough respect for Maggie as a person, that he wants to kill her clean and quick. But mob rules demand no such respect for the family of a rat. She must be raped before she's killed. But although dirty and a little shaken up from the explosion, Fred is otherwise unscathed, and has made it there unseen. He jumps on Bernie's back from behind, grabs Bernie's belt, which the enforcer had removed while undoing his pants, and uses the leather strap as a garotte. Bernie fights viciously, but Fred hangs on like a bulldog. The chokehold finally starts to sap Bernie's strength. Seeing her husband's defense of her, and Bernie weakening, Maggie finally grabs a big kitchen knife and stabs Bernie in the chest, finishing him.Paulo goes to reload, but Warren and Belle have arrived back home. Belle whacks Paulo from behind just as he turns back around, and she and Warren arm themselves with spare guns. They ambush the remainder of Luchese's men, and even Malavita gets in a kill. Both Belle and Warren run out of ammo, and Warren hurries to the car to grab another. He grabs a shotgun and turns just in time to kill Mezzo. The recoil knocks Warren back against the car and stuns him. Belle catches him before he falls.One last enforcer has to be dealt with: Rocco himself. He points his gun at Belle, poised to kill the girl-- but he, too, is out of ammo. Dropping Warren, Belle turns and runs as Rocco chases her down. But at an intersection, just as Rocco runs through it, a mere few meters behind Belle, he's run down by Stansfield, arriving on the scene to make the final save. Belle collapses to her hands and knees on the street and sobs, as Warren comes to, comes up behind his sister, and holds her.Maggie is at the wheel of the Manzoni car as they drive through the late night to their next home. Fred is pleased with himself; he's fixed the brown water problem, was a hit for one night at Cholong-sur-Avre's film society, and he believes his family is more close-knit than anything. The bounty on his head is probably double what it was before, but the only real bummer to him is that he has to rewrite his memoirs from the start, and they have to change their names again."
        ],
        "summaries": [
          "The Manzoni family, a notorious mafia clan, is relocated to Normandy, France under the Witness Protection Program, where fitting in soon becomes challenging, as their old habits die hard.",
          "A mafia boss and his family are relocated to a sleepy town in France under the witness protection program after snitching on the mob. Despite the best efforts of FBI Agent Stansfield (Tommy Lee Jones) to keep them in line, Fred Manzoni (Robert De Niro), his wife Maggie (Michelle Pfeiffer) and their children Belle (Dianna Agron) and Warren (John D'Leo) can't help but revert to old habits and blow their cover by handling their problems the \"family\" way, enabling their former mafia cronies to track them down. Chaos ensues as old scores are settled in the unlikeliest of settings.",
          "In New York, mobster Giovanni Manzoni makes a deal with FBI agent Robert Stansfield and snitches on his mafia family. In return, Giovanni is included in the witness protection program and receives a new identity, Fred Blake. Giovanni, together with his wife Maggie and their teenager children Belle and Warren, are relocated to the small town Cholong-sur-Avres, in Normandy, under the protection of Stansfield and two other agents. Meanwhile the mafia offers a 20 million-dollar reward to the killer that executes Giovanni and his family. Soon the Blake family uses the mafia methods to improve their lives in the town. But when the mafia accidentally discovers the whereabouts of the Manzoni family, Cholong becomes a no man's land.",
          "Brooklyn kingpin Giovanni Manzoni (De Niro) had it all until the day he became a snitch. Now no matter how many times Agent Stansfield (Tommy Lee Jones) relocates Giovanni and his family, danger is never far behind. When they blow their cover once again, Giovanni, his wife Maggie (Michelle Pfeiffer), and their two kids Warren (John D'Leo) and Belle (Dianna Agron) are shipped off to a sleepy village in France. It seems like the perfect place to escape the long arm of the lawless until the criminally inclined family resorts to their treacherous old ways, once again becoming a blip on the syndicate radar. Now the thugs are moving in, and they mean business. As the Manzonis use their unique set of skills to survive the relentless storm of bullets, bombs, and rockets, the citizens of this peaceful French village suddenly find themselves in the middle of an all-out Mafia war zone.."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "iSJW84QB_Hoamgc57IIO",
        "_score": 15.838593,
        "title": "Belly of the Beast",
        "year": 2003,
        "genders": [
          "Action"
        ],
        "score": 4.6,
        "directors": [
          "Siu-Tung Ching"
        ],
        "writers": [
          "Thomas Fenton",
          "Steven Seagal",
          "James Townsend"
        ],
        "synopsis": [],
        "summaries": [
          "An ex-CIA agent's quest to find his kidnapped daughter leads him on a trail of political intrigue, corruption, danger and betrayal; he will stop at nothing to save her.",
          "Ten years ago, Jake Hopper was a CIA agent who was stationed in Thailand. Then one day, things went sour, and his partner, Sunti barely escaped with his life...after accidentally killing a woman. Jake called it quits and returned to the United States when his wife died, and Sunti became a Buddhist monk to atone for his sins. For the past 10 years, Jake has run a successful private security business, and has been raising his daughter Jessica, who is now an adult. While hiking in Thailand, Jessica and her friend Sarah Winthorpe are kidnapped. A group of Islamic fundamentalists known as the Abu Karaf claims responsibility. Sarah is the daughter of United States senator John Winthorpe. For ransom, the Abu Karaf demand the release of 20 prisoners from American custody. The US Secretary of State urges restraint -- he won't negotiate. Tom Collins, an ex-colleague of Jake's, recognizes Jessica on the ransom tape and tips Jake off. Jake knows that he must rescue the girls himself. An old CIA buddy puts Jake in contact with Leon Washington, an active CIA agent who is working in Thailand. Jake goes to Bangkok, and escapes an assassination attempt. Leon arranges a meeting for himself with with Soku -- the internal security chief for General Jantapan. Jantapan is a rebel military general who is making a play to be one of the most powerful men in Thailand. Secretly, Jantapan is messing with some dangerous spiritual forces. Soku provides Jake with a cover story, but the CIA wants Jake out of it -- they are planning to take out the Abu Karaf with the aid of the Thai army, and they don't want a civilian in the middle. Jake is a spiritual man, so he contacts his spiritual master Paijan Paitoon. As Jake is in trouble, Paitoon offers to arrange a divination from the oracle of the order. Jake enlists the help of Sunti. Jake gets Lulu, the girlfriend of arms dealer Fitch McQuoid, to steal information leading to the Abu Karaf. Jake and Sunti follow the leads to a warehouse where they discover evidence of highly sophisticated weaponry. With their enemies now after Lulu, Jake takes Lulu under his wing. Jake shares some of his info with Leon. Can he trust Leon? Another attempt is made on Jake's life -- and this time, Jake is sure that Leon was involved. Finally, the Abu Karaf contact Jake to arrange a meeting -- the pieces are coming together, and Jake figures out that it was not the Abu Karaf who kidnapped Jessica and Sarah. Jantapan tries to send the spirit of an ancient warrior demon to kill Jake, but the ceremony goes wrong and the spirit enters Jantapan himself, giving Jantapan amazing physical and spiritual powers. Jake and Sunti go to meet Mongkol, the leader of the Abu Karaf. Mongkol confirms that ever since the terrorist attacks of September 11, 2001, Jantapan has worked to corner the narcotics and arms markets. It was Jantapan who kidnapped the girls, blaming the Abu Karaf so the army would wipe out his competition. Mongkol knows where the girls are, and he gives Jake plans and intelligence. They both need the girls alive. Jake must engage in a battle that will put both his physical and spiritual powers to the ultimate test."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "T0xi84QBEuMZ1zZ3rF5k",
        "_score": 15.838593,
        "title": "Belly of the Beast",
        "year": 2003,
        "genders": [
          "Action"
        ],
        "score": 4.6,
        "directors": [
          "Siu-Tung Ching"
        ],
        "writers": [
          "Thomas Fenton",
          "Steven Seagal",
          "James Townsend"
        ],
        "synopsis": [],
        "summaries": [
          "An ex-CIA agent's quest to find his kidnapped daughter leads him on a trail of political intrigue, corruption, danger and betrayal; he will stop at nothing to save her.",
          "Ten years ago, Jake Hopper was a CIA agent who was stationed in Thailand. Then one day, things went sour, and his partner, Sunti barely escaped with his life...after accidentally killing a woman. Jake called it quits and returned to the United States when his wife died, and Sunti became a Buddhist monk to atone for his sins. For the past 10 years, Jake has run a successful private security business, and has been raising his daughter Jessica, who is now an adult. While hiking in Thailand, Jessica and her friend Sarah Winthorpe are kidnapped. A group of Islamic fundamentalists known as the Abu Karaf claims responsibility. Sarah is the daughter of United States senator John Winthorpe. For ransom, the Abu Karaf demand the release of 20 prisoners from American custody. The US Secretary of State urges restraint -- he won't negotiate. Tom Collins, an ex-colleague of Jake's, recognizes Jessica on the ransom tape and tips Jake off. Jake knows that he must rescue the girls himself. An old CIA buddy puts Jake in contact with Leon Washington, an active CIA agent who is working in Thailand. Jake goes to Bangkok, and escapes an assassination attempt. Leon arranges a meeting for himself with with Soku -- the internal security chief for General Jantapan. Jantapan is a rebel military general who is making a play to be one of the most powerful men in Thailand. Secretly, Jantapan is messing with some dangerous spiritual forces. Soku provides Jake with a cover story, but the CIA wants Jake out of it -- they are planning to take out the Abu Karaf with the aid of the Thai army, and they don't want a civilian in the middle. Jake is a spiritual man, so he contacts his spiritual master Paijan Paitoon. As Jake is in trouble, Paitoon offers to arrange a divination from the oracle of the order. Jake enlists the help of Sunti. Jake gets Lulu, the girlfriend of arms dealer Fitch McQuoid, to steal information leading to the Abu Karaf. Jake and Sunti follow the leads to a warehouse where they discover evidence of highly sophisticated weaponry. With their enemies now after Lulu, Jake takes Lulu under his wing. Jake shares some of his info with Leon. Can he trust Leon? Another attempt is made on Jake's life -- and this time, Jake is sure that Leon was involved. Finally, the Abu Karaf contact Jake to arrange a meeting -- the pieces are coming together, and Jake figures out that it was not the Abu Karaf who kidnapped Jessica and Sarah. Jantapan tries to send the spirit of an ancient warrior demon to kill Jake, but the ceremony goes wrong and the spirit enters Jantapan himself, giving Jantapan amazing physical and spiritual powers. Jake and Sunti go to meet Mongkol, the leader of the Abu Karaf. Mongkol confirms that ever since the terrorist attacks of September 11, 2001, Jantapan has worked to corner the narcotics and arms markets. It was Jantapan who kidnapped the girls, blaming the Abu Karaf so the army would wipe out his competition. Mongkol knows where the girls are, and he gives Jake plans and intelligence. They both need the girls alive. Jake must engage in a battle that will put both his physical and spiritual powers to the ultimate test."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "6Exi84QBEuMZ1zZ3rFpj",
        "_score": 14.527443,
        "title": "Exit Wounds",
        "year": 2001,
        "genders": [
          "Action",
          "Crime",
          "Thriller"
        ],
        "score": 5.6,
        "directors": [
          "Andrzej Bartkowiak"
        ],
        "writers": [
          "Ed Horowitz",
          "Richard D'Ovidio",
          "John Westermann"
        ],
        "synopsis": [
          "A tough cop runs up against fellow cops selling drugs."
        ],
        "summaries": [
          "Orin Boyd, a tough cop in an inner-city precinct discovers a web of dirty cops and corruption.",
          "Orin Boyd (Seagal) is a Detroit cop who doesn't follow rules. After he saved the Vice President by violating every order he received he is transferred to one of the worst precincts in the city. There he quickly encounters some corrupt cops selling heroin to drug dealers. The problem is, it's very difficult to tell who is the bad guy and who you can trust.",
          "Orin Boyd is a cop who works in Detroit's 21st precinct, and his attitude and rough means of enforcing the law always end up annoying the precinct captain, Frank Daniels. When terrorists try to kill the Vice President of the United States, Orin kills the terrorists. Even though Orin saved the Vice President's life, Frank doesn't like the way Orin did it, so Frank transfers Orin to the 15th precinct -- Detroit's worst precinct. Orin's new captain, former internal affairs officer Annette Mulcahy, knows of his reputation and tells him that she won't tolerate it, and she sends Orin to an anger management class where he meets Henry Wayne, the high-strung host of a local talk show called \"Detroit AM.\" Despite this measure, Orin doesn't change his ways of doing his job, and it's not long before he comes across local drug dealer Latrell Walker and his fast-talking sidekick T. K. Johnson doing a shady deal with a man named Matt Montini. After a brief fight, Orin discovers that Montini has been working undercover trying to nail Walker, and Orin messed it up, a point that doesn't sit well with Montini's musclebound partner Useldinger. Not all of the cops of the 15th precinct give Orin a hard time. Sergeant Lewis Strutt steps in to cool things down when Orin gets in a fight with Useldinger, and George Clark is assigned to be Orin's partner. After Orin stumbles upon the theft of $5,000,000 worth of heroin from Piper Tech, a place where evidence is stored, Orin and George begin focusing their efforts on Latrell and T.K., and also Shaun Rollins, a man that Latrell has been visiting at the local jail. Orin asks Henry to do some digging on Latrell's background. What Henry discovers is that Latrell is not a drug dealer. Latrell is a computer expert and billionaire whose real name is Leon Rollins -- he's the brother of Shaun Rollins. Orin confronts Leon, who explains that a group of corrupt cops were in danger of losing one of their drug dealers, so the corrupt cops planted heroin on Shaun, setting Shaun up to take the rap so they wouldn't lose their dealer. Sergeant Lewis Strutt is the leader of the group of corrupt cops, who also include Montini and Useldinger, and Strutt and his gang are the ones who stole the heroin from Piper Tech. Leon and his friend Trish have been videotaping the corruption, hoping that it might help prove Shaun's innocence and get him out of jail. Orin meets with Annette at a parking lot and he gets in Annette's truck and tells Annette what's going on. When Montini and Useldinger and a bunch of their men show up and try to kill Orin and Annette, Annette screeches out of the parking lot with Orin still in her truck. Orin and Annette are chased, and Annette is killed in the chase when her truck slams into the back of a bigger truck, sending her into her windshield. Orin tells Frank that Strutt will be having a meeting at a warehouse in about an hour, to sell the heroin that was stolen from Piper Tech. Strutt plans to try to sell it to Leon and T. K., not knowing that Leon is working against him. Frank promises that he'll be there with some backup. Orin then goes to George's house and tells George what's going on. George agrees to help Orin bring Strutt and his gang down. But it may be someone higher up who is behind the whole thing."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "zCJW84QB_Hoamgc57JUZ",
        "_score": 13.4849415,
        "title": "A Most Violent Year",
        "year": 2014,
        "genders": [
          "Action",
          "Crime",
          "Drama"
        ],
        "score": 7,
        "directors": [
          "J.C. Chandor"
        ],
        "writers": [
          "J.C. Chandor"
        ],
        "synopsis": [
          "Abel Morales is a businessman who tries to do everything honestly. He has been building his business of fuel distribution to quite a big position. He now lands a deal to purchase a bay-front storage facility that will increase the business greatly. But this deal has a risky clause which states that if Abel fails to pay the rest of the due payment, the facility and the deposit will be gone. His trucks have been targeted by robbers from the last few months, which scared his drivers. He even gets an intimidation visit by burglars. Additionally, the DA wants to charges the business with felony counts. His wife suddenly reveals a gun she purchases for her protection, of which he strongly disagrees. Despite his disapproval, Abels drivers arm themselves with guns but lack the permit for them. When another heist occurs and one of his driver fires shots, Abel has to go himself and find the missing driver to turn him to the police. The driver Julian is found, but he ran away when hes about to be turned in. Abel goes every where to get loans as the closure time nears.From one of his competitors the Lefkowicz, Abel gets a deal for 500 thousand dollars or the 1.5 millions he needs. The facility owner grants him an extra three day time, in which he uses to see his brother to ask him to mortgage his apartment to help Abel. He also convenes all his other surrounding competitors saying that he knows at least one of them is in league with his trucks hijackers. On his way home he accidentally finds one of his trucks being hijacked. He follows the truck through a chase. After capturing the robber he finds that one of his competitors has been buying the stolen fuel. When the money needed is only 600 thousand more, he runs out of time. But his wife suddenly pulls out a bank account with enough cash in it. To his surprise, his wife has been skimming money from the company all this time. Finally he decides to use the money and completes the deal. Julian comes to the facility; angry thinking that he gets nothing while Abel gets everything. Abel convinces him theres a second chance, but he commit suicide then and there. Abel then asks for a deal with the visiting DA for his business."
        ],
        "summaries": [
          "In New York City 1981, an ambitious immigrant fights to protect his business and family during the most dangerous year in the city's history.",
          "A crime drama set in New York City during the winter of 1981--statistically one of the most violent years in the city's history--and centered on the lives of an immigrant and his family trying to expand their business and capitalize on opportunities as the rampant violence, decay, and corruption of the day drag them in and threaten to destroy all they have built.",
          "In 1981 New York City, Abel Morales, from an immigrant background, is trying to live the American Dream on his own moral terms. Married to WASP Anna Morales née Robbins, Abel bought Standard, his father-in-law's heating-oil distribution business operating in the New York market. Operating totally above board, Abel has made such a success of the business that he, Anna, and their two daughters are moving into a palatial new mansion. It looks like he is the front-runner among those competing to purchase a $2.5-million prime riverside property that would allow him to expand the business and become the largest New York heating-oil distributor. If successful in his proposal--$1 million of his own money down, with the remaining $1.5 million, financed through the bank, due in 30 days--this purchase would be the most important business move of his career. However, the industry in New York is known to be fraught with illegal activity, so much so that the Assistant D.A., Mr. Lawrence, has been tasked with cleaning up the crime ingrained in the industry. Anna's father and most if not all of Abel's major competitors were and are corrupt. Lawrence's investigation includes looking into Abel's business during his father-in-law's ownership, and Abel could be charged if they look into the books from those years despite Abel having done nothing wrong himself. He and Anna haven't yet been able to go through the books themselves to hide whatever is required to remain clean. Also, someone--most likely one of his major competitors, is using scare tactics and intimidation to bring him down: hijacking his trucks, so far to the tune of $200,000 worth of stolen oil, beating up his drivers, beating up his salesmen, and making veiled personal threats against him and his family. Even if it is not one of his major competitors orchestrating these attacks, he knows at least one of them is in collusion, as the amount of oil stolen could not be stored anywhere but at one of their facilities. Anna, who is more cutthroat than her husband, wants Abel to fight back using whatever tools, including like violence, to protect himself, the business, and their family. As Abel tries to remain true to himself, Julian, one of his immigrant drivers who was severely beaten during one of those hijackings, could undermine all that Abel has achieved so far, as Julian strives for his own piece of the American Dream."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "kkxi84QBEuMZ1zZ3rHFr",
        "_score": 13.4849415,
        "title": "A Most Violent Year",
        "year": 2014,
        "genders": [
          "Action",
          "Crime",
          "Drama"
        ],
        "score": 7,
        "directors": [
          "J.C. Chandor"
        ],
        "writers": [
          "J.C. Chandor"
        ],
        "synopsis": [
          "Abel Morales is a businessman who tries to do everything honestly. He has been building his business of fuel distribution to quite a big position. He now lands a deal to purchase a bay-front storage facility that will increase the business greatly. But this deal has a risky clause which states that if Abel fails to pay the rest of the due payment, the facility and the deposit will be gone. His trucks have been targeted by robbers from the last few months, which scared his drivers. He even gets an intimidation visit by burglars. Additionally, the DA wants to charges the business with felony counts. His wife suddenly reveals a gun she purchases for her protection, of which he strongly disagrees. Despite his disapproval, Abels drivers arm themselves with guns but lack the permit for them. When another heist occurs and one of his driver fires shots, Abel has to go himself and find the missing driver to turn him to the police. The driver Julian is found, but he ran away when hes about to be turned in. Abel goes every where to get loans as the closure time nears.From one of his competitors the Lefkowicz, Abel gets a deal for 500 thousand dollars or the 1.5 millions he needs. The facility owner grants him an extra three day time, in which he uses to see his brother to ask him to mortgage his apartment to help Abel. He also convenes all his other surrounding competitors saying that he knows at least one of them is in league with his trucks hijackers. On his way home he accidentally finds one of his trucks being hijacked. He follows the truck through a chase. After capturing the robber he finds that one of his competitors has been buying the stolen fuel. When the money needed is only 600 thousand more, he runs out of time. But his wife suddenly pulls out a bank account with enough cash in it. To his surprise, his wife has been skimming money from the company all this time. Finally he decides to use the money and completes the deal. Julian comes to the facility; angry thinking that he gets nothing while Abel gets everything. Abel convinces him theres a second chance, but he commit suicide then and there. Abel then asks for a deal with the visiting DA for his business."
        ],
        "summaries": [
          "In New York City 1981, an ambitious immigrant fights to protect his business and family during the most dangerous year in the city's history.",
          "A crime drama set in New York City during the winter of 1981--statistically one of the most violent years in the city's history--and centered on the lives of an immigrant and his family trying to expand their business and capitalize on opportunities as the rampant violence, decay, and corruption of the day drag them in and threaten to destroy all they have built.",
          "In 1981 New York City, Abel Morales, from an immigrant background, is trying to live the American Dream on his own moral terms. Married to WASP Anna Morales née Robbins, Abel bought Standard, his father-in-law's heating-oil distribution business operating in the New York market. Operating totally above board, Abel has made such a success of the business that he, Anna, and their two daughters are moving into a palatial new mansion. It looks like he is the front-runner among those competing to purchase a $2.5-million prime riverside property that would allow him to expand the business and become the largest New York heating-oil distributor. If successful in his proposal--$1 million of his own money down, with the remaining $1.5 million, financed through the bank, due in 30 days--this purchase would be the most important business move of his career. However, the industry in New York is known to be fraught with illegal activity, so much so that the Assistant D.A., Mr. Lawrence, has been tasked with cleaning up the crime ingrained in the industry. Anna's father and most if not all of Abel's major competitors were and are corrupt. Lawrence's investigation includes looking into Abel's business during his father-in-law's ownership, and Abel could be charged if they look into the books from those years despite Abel having done nothing wrong himself. He and Anna haven't yet been able to go through the books themselves to hide whatever is required to remain clean. Also, someone--most likely one of his major competitors, is using scare tactics and intimidation to bring him down: hijacking his trucks, so far to the tune of $200,000 worth of stolen oil, beating up his drivers, beating up his salesmen, and making veiled personal threats against him and his family. Even if it is not one of his major competitors orchestrating these attacks, he knows at least one of them is in collusion, as the amount of oil stolen could not be stored anywhere but at one of their facilities. Anna, who is more cutthroat than her husband, wants Abel to fight back using whatever tools, including like violence, to protect himself, the business, and their family. As Abel tries to remain true to himself, Julian, one of his immigrant drivers who was severely beaten during one of those hijackings, could undermine all that Abel has achieved so far, as Julian strives for his own piece of the American Dream."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "WUxi84QBEuMZ1zZ3rG1p",
        "_score": 12.295637,
        "title": "Bad Ass",
        "year": 2012,
        "genders": [
          "Action",
          "Comedy",
          "Crime"
        ],
        "score": 5.4,
        "directors": [
          "Craig Moss"
        ],
        "writers": [
          "Craig Moss",
          "Elliot Tishman"
        ],
        "synopsis": [
          "--written by KrystelClaireThe film starts with photos and shorts of the Latin quarters. There are buses, plenty of grafitti, highways in the middle of the city of LA. Some of the shots have been taken from YouView, which works, obviously, the same as YouTube.Frank Vega (Shalim Ortiz) is travelling by bus, and two punks get in. He starts remembering his teenage years, saying that they were the simplest and the happiest. He was the son of some small local farmers, and had a beautiful girlfriend called Lindsay (Jillian Murray). He has to do something with his life, so he decides to join the Army, and ends up being tortured and wounded in Viet Nam. When he returns to the USA, he has to follow rehabilitation, and then he tries to come back to his life.However, when he visits adult Lindsay (Donzaleigh Abernathy), she is already married with two children. He tries to join the police forces, but his wonds cause him to be rejected. He can't find a decent job, as all the possible employees want university degrees and experience. Finally, he starts selling hot dogs in a street post. And 40 years have gone by, and Frank (Danny Trejo)'s life has slipped through his fingers.He repents about his life. When two punks enter the bus, they bother a passenger. Frank tells them to stop, so he becomes the object of their wrath, but he defends himself and ends up beating them to a pulp. Some other passengers record this with their mobile phones, and they upload it onto YouView with the title Bad Ass. Frank becomes an instant celebrity, and he and Mrs Vega (Tonita Castro) are interviewed at the morning programme LA Mornings by a journalist (Sam Rubin). Now, his community and the police respect him. Officer Marlak (Patrick Fabian) even takes with them on patrol.Three months later, Frank's mother dies. Father Miller (Richard Riehle) gives out a deep and nice speech, but Frank is sad anyway. He takes all the cutlery to their local church, as stated in her will. The rest will be for him.On TV, Mayor Williams (Ron Perlman) wants to improve the safety of the Latin quarters.He is about to move in with his best friend in Mrs Vega's home. During the moving, they stop to drink Mrs Vega's drinks and they reminiscence about the old times in Nam, how Klondike Washington (Harrison Page) saved Frank's life, and they talk about the best day of their lives, which is yet to come. Klondike also gives Frank a pen drive, saying that it's important for Frank to keep it in Mrs Vega's old safe. Klondike mentions a plan to become rich.Klodike goes out to buy more liquor, and two punks threaten him. They are looking for something, which he says he doesn't have. It looks as though Klodike has won the fight. However, the guy called Sebastian (Craig Johnson) shoots Klodike and kills him. He and the other (Dorian Kingi) run away.Frank beats the crap of three punks at a liquor shop, so that the clerk (Ezra Buzzington) gives him the things he didn't have money to pay.A neighbour lady called Amber Lamps (Joyful Drake) offers him some consolation, stating that it's impossible to live on the neighbourhood anymore.Frank decides not to go out with his cop friend, and thinks that Detective Shah (Frank Maharajh) is not doing anything to investigate Klondike's death because he was black. He watches TV, and a news anchour (Christine Clayburg) says that 20 detectives were implied in the investigation of a person's runover. Frank feels frustrated when he sees some detectives playing games instead of working, so he decides to take things in his own hands. In fact, he goes to the place of the fight and finds one strange cartridge and a necklace with a photograph inside. He has a conversation with a boy but his father (Chris Spencer) tells the boy not to talk with unknown people and neighbours.It is a hunter weapon, a Baretta, something designed for the government and its army. The gun shop says that the girl in the photo looks like a girl who usually attends his church. He visits that lady, who is fed-up with the man who supposedly lost her necklace at Frank's, called Terrance (Erik Betts). She tells him that he's been away for a week, probably playing ball with his friends. At 22nd Street park, Terrance's friends (Joe Holiday, Buddy Sosthand & Mark Rhino Smith) are beaten until they tell Frank to look for Renaldo (Andy Davoli).He visits Renaldo's apartment, and a man dressed as a Catholic priest (Jack Freshkin) thinks that he was going to rob them, so he attacks them.Williams talks to Panther (Charles S. Dutton), the former's contact on the streets. Williams is facing re-ellection in 90 days, and it all depends in finding that pen-drive. Williams is afraid of Frank. Panther says that the streets are his, and that he'll take care of Bad Ass, because his brothers dealth with Klonkike in the wrong way.Frank helps an elderly lady (Norma Michaels) with her bags, and somebody shoots him. Frank still talks to Martin (John Duffy) the cutely savvy son of his neigbhbour, who has put violent Terrance out after he has hit her.Frank questions about Renaldo in a bar, starting a bar prawl, who he wins. The bartender (Tommy Rosales) tells him that Renaldo is upstairs. A pimp tells that Renaldo is with Tatiana (Winter Ave Zoli). At Mrs Vega's, a thug asks Frank about a pen drive. Frank tells Martin to use it, and that's how they see all the plans for the regentrification of the whole neighbourhood.Frank goes to Tatiana's massage parlour. Tatiana is a blonde masseuse who says she has split up with Reanldo and leaves Frank.Looking for Renaldo, a Bad-Ass fan (Esteban Cueto) neighbour tells him to burglar it in; in fact, he tells him that Tatiana always leaves her back door open. Tatiana and Renaldo are at it. Frank takes Renaldo's hand through the rabbish disposal system, and cuts several fingers. He says that Sebastian killed Klondike, and that Buster was the one who called the shots. On leaving, all the kitchen stained with blood, Frank says that Renaldo's wife sends a message: \"Fuck You\".Frank defends Martin's mother from Martin Sr., who's hitting her. Frank gets all cute to have dinner with her at her garden, which reminds Frank of his own mother.Frank gives to his friend Officer Malark the pen - just in case something bad happens to him. Frank goes to confess, because he's looking for revenge. Frank goes to Panther's garage directly. Two thugs are there, but Panther decides to face him directly, but not on his own. Panther tortures Frank with electricity, the same kind of torture that he had to face in Nam. Panther finds a photograph of Amber at Frank's wallet, so he threatens him with him going to attack her. As soon as Panther leaves, Frank releases himself with a lighter - in a cheese moment, in my opinion - and then there's this huge fight. Fire is everywhere, and then everything blows up. Panther runs away and takes a bus from a driver (Robert Sean Burke). When Frank tells a bus driver (Craig Moss) that he needs to steal his bus, the driver happens to be a fan of Frank's, so he will let him take his bus happily. Frank runs after the bus,creating havoc and chaos on their way, until Frank bumps onto a building. Panther decides to meet Frank face to face at the LA Market premises. On the last second, Frank swerves, but Panther's bus is crashed by an incoming train.Of course, this doesn't stop either of them. They both reach Amber's at the same time, and they fist-fight. Panther wonders how Frank Vega was able to find such a sexy lady. Amber takes Frank's side, obviously, but is Frank Vega who gives Panther the final punches. Frank says that he never had a woman rescuing him. She is worried because Frank's got a black eye and is bleeding. She takes Frank inside to take care of him, while Panther is left on his own, thrown to the soil, with a bleeding face, in the outside garden yard. A journalist says that the audience may remember Frank Vega \"Bad Ass\", but that he uncovered a major political corruption case, which meant that the mayor's office was linked to a terrorizing streetgang. The mayor is seen alleging that he's being attacked by special terrorist groups which are trying to destroy his political and economic agenda for the city. Frank is named an honorary police officer, and Malark gives him his badge. Frank goes speechless.Amber and her son dine together with Frank. Frank says that that was the best day of his life. The son tells him to trim that damn beard."
        ],
        "summaries": [
          "A Vietnam veteran who becomes a local hero after saving a man from attackers on a city bus decides to take action when his best friend is murdered and the police show little interest in solving the crime.",
          "Decorated Vietnam hero Frank Vega returns home only to get shunned by society leaving him without a job or his high school sweetheart. It's not until forty years later when an incident on a commuter bus (where he protects an elderly black man from a pair of skin heads) makes him a local hero where he's suddenly celebrated once again. But his good fortune suddenly turns for the worse when his best friend Klondike is murdered and the police aren't doing anything about it."
        ]
      },
      {
        "_index": "movies",
        "_type": "docs",
        "_id": "9Exi84QBEuMZ1zZ3rF5k",
        "_score": 10.331497,
        "title": "X-Men: The Last Stand",
        "year": 2006,
        "genders": [
          "Action",
          "Adventure",
          "Sci-Fi"
        ],
        "score": 6.6,
        "directors": [
          "Brett Ratner"
        ],
        "writers": [
          "Simon Kinberg",
          "Zak Penn"
        ],
        "synopsis": [
          "(For the sake of continuity and uniformity, each mutant's 'human name' will be listed only once, and they will thereafter be referred to by their 'mutant' names.)The movie opens in a quiet suburban neighborhood in the 1980's. Professor Charles Xavier (Patrick Stewart) and Eric Lensherr/Magneto (Ian McKellen) are arriving at the Grey home to both personally evaluate a potential new student for the school Xavier has established for mutants. Mr. and Mrs. Grey call their young daughter, Jean, down to speak with Magneto and Xavier. As Jean sits, Xavier senses immediately that she's telepathically reading his and Magneto's thoughts, and gently admonishes her, saying that he and Magneto are 'like her.' In a surprisingly adult-like voice for a young adolescent, Jean says she doubts either of them are like her. A second later, all the cars outside begin to levitate, much to the amazement of Xavier and Magneto. A man watering his garden gawks as the water coming out of his garden hose begins to flow straight upward. Xavier quietly asks Jean if she wishes to learn to control her immense power, or let it control her.Ten years later, in a high-rise luxury building, a boy scrapes at his back, crying as he does so. The boy's father, Warren Worthington II (Michael Murphy) knocks on the bathroom door, concerned. He asks his son to open the door. Warren III cries out suddenly, in fright, for his father to give him one second, and starts hurriedly trying to hide what he's been doing. Several bloody rags are seen beside the sink, and Worthington hears the sound of clanking as his son rushes to hide his razor and several other sharp metal objects. Knowing something is seriously amiss, Worthington kicks the door in and sees what his son was trying to hide. Several bloody feathers are on the bathroom floor, having sprouted from bony protrusions under the skin on Warren III's back. Warren III is a mutant.In the present day, the X-Men are in the Danger Room, Xavier's training simulation chamber, playing out a defense against a futuristic robotic attack. Peter Rasputin/Colossus (Daniel Cudmore) turns himself and Marie D'Ancanto/Rogue (Anna Paquin) into organic steel to protect them both from flying debris. Bobby Drake/Iceman (Shawn Ashmore) stops an incoming guided missile by freezing it, knocking out its heat sensors. Just then, another one comes flying in, and Kitty Pryde/Shadowcat (Ellen Page) grabs him and puts both he and herself out of phase, so the missile passes harmlessly through them.Ororo Munroe/Storm (Halle Berry) and Wolverine/Wolverine (Hugh Jackman) note that the massive robotic entity they are training against is routing all of the X-Men. Wolverine tells Storm that the younger, less experienced of the X-Men aren't practiced and strong enough yet. Over Storm's protests that the X-Men need to work as a team, Wolverine has Colossus hurl him straight at the robot, using his adamantium claws to tear the head off the robot. The robot's head, that of a Sentinel, crashes to the ground. Wolverine walks out from behind it.Storm and Wolverine argue as the X-Men leave the simulation room. The training exercise was meant to help the team learn to operate together and defend, while Wolverine believes in the best defense being a good offense. Wolverine also reminds Storm that he's just a substitute for Scott Summers/Cyclops (James Marsden), who's been severely depressed since his girlfriend, Jean Grey, drowned while saving the X-team at Alkali Lake.Scott sits alone in his room, haunted by the loss. Meanwhile, Rogue has a brief spat with Iceman. She loves him, but their relationship torments her because he can't touch her bare skin safely because of her life-leeching powers. In another part of the school Wolverine finds Cyclops heading out of the school and there is a brief, but emotional, confrontation over both of them having loved Jean and are mourning her death.Hank McCoy/Beast (Kelsey Grammer), Secretary of Mutant Affairs in the presidential cabinet, is reading a scientific magazine with articles on mutation and the gene that helps bring it about, relaxing while hanging upside down from the ceiling. His secretary announces the start of a Presidential staff meeting.As Beast arrives at the meeting, Homeland Security secretary Trask (Bill Duke) announces that they lost a track on Magneto, but have successfully captured Raven Darkholme/Mystique (Rebecca Romijn). A surveillance camera shows her being interrogated by FBI. Mystique refuses to answer to her human name, and even when the interrogator accommodates her, she frustrates and vexes him by shapeshifting into him in order to mock him. When the interrogator loses his patience and demands she tell him where Magneto is, Mystique suddenly headbutts him and shows how, even with her wrists in heavy shackles, she is still a dangerous enemy. It takes several FBI guards to finally overpower her.Beast is dubious about the Presidential cabinet's ability to hold Mystique, and knows that holding her will make Magneto angry, though it gives the cabinet some diplomatic leverage. But Beast realizes that diplomacy with Magneto is not why the President (Josef Sommer) called for his attendance. The President shows Beast a folder with documents that Mystique was trying to steal from the FDA when she was captured. Beast opens the file to find a series of biochemical analyses from Worthington Labs, along with a profile on a young boy named Jimmy, also known as Leech (Cameron Bright). The analyses show that Jimmy is capable of suppressing the mutant X-gene. The President tells Beast that the research is believed to be viable, and the potential effect it will have on the mutant community is exactly why the cabinet desperately needs Beast's considerable diplomatic skills, now more than ever.Xavier is giving a lecture to mutant students in the school, discussing Mutant ethics. An example he gives is a brain-dead patient of Dr. Moira MacTaggart (Olivia Williams, uncredited). The psychic ability to transfer a human consciousness, even that of a family man with four children, and who is dying of cancer, into the body of the brain-dead man, raises serious ethical issues. Xavier suddenly pauses, staring vacantly, Outside, the skies turn darker as heavy clouds begin to gather and converge. Xavier tells his class that they'll break early and continue tomorrow.Xavier finds Storm on the terrace; her mind heavy with troubles which were causing the sudden weather shift. Magneto is a fugitive, Beast is on the Presidential cabinet and the US President has shown a lot of goodwill toward mutants -- so, as Storm believes, the Academy shouldn't need to be in hiding. Xavier says it's not hiding as much as staying wary of the Academy's remaining enemies and protecting the students. When Xavier mentions he sees Storm becoming the new Headmistress of the academy one day, Storm freezes. She thought that Cyclops was the natural successor. Xavier says Cyclops has never been the same since Jean's death. Storm knows there's something Xavier is hiding, but he continues on toward his office without acknowledging.Xavier and Storm find Beast in Xavier's office, and Wolverine joins them a few seconds later. The reason for Beast's visit is to report what he was shown during the cabinet meeting: a major pharmaceutical company has developed a way to suppress the mutant X-gene... and its effects are reportedly permanent. The company is calling the research a cure for mutancy, turning any mutant back into a regular human.The impact of the discovery hits right there, as Storm reacts in outrage to the news. Storm sees the discovery as equivalent to humans calling mutancy a disease in need of treatment. Xavier quietly cuts Storm off, saying the pharmaceutical company is making a public announcement as they speak.On Alcatraz Island, Warren Worthington II is making a public announcement about the cure. His speech carefully declares mutants to be people, just like humans, before breaking out the 'scare words' like mutancy being a disease and a corruption of healthy cellular activity. He says that any mutant who wishes to undergo the cure is welcome to. As several Academy students watch the announcement on TV, Rogue appears to listen with rapt interest. She goes to Xavier's office, where Xavier is still speaking to Storm, Beast and Wolverine about the ethical and moral dilemma brought about by the discovery. Rogue seems very eager to hear if a mutant cure is real. Storm angrily tells her that there is nothing about them that needs curing; there is nothing wrong with any of the mutants at the academy.A group of mutants call for a meeting at a local church to discuss the issue. The leader of the meeting is looking to pursue peaceful negotiation with the government in order to protest the cure. Also attending the meeting are Magneto and John Allerdyce/Pyro (Aaron Stanford), looking to recruit angry mutants for the Brotherhood. Magneto warns the mutants at the meeting that while they try to pursue negotiation and peaceful methods, humans, especially the humans in government, will start to force the cure on them a few at a time in a divide-and-conquer strategy. Inciting some of the mutants with these warnings, Magneto gains four new members for his Brotherhood-- Kid Omega (Ken Leung), who can extend poisonous spines all over his body; Psylocke (Mei Melançon), who can teleport through shadows; Arclight (Omahyra), who can loose concussive air pressure shockwaves; and Callisto (Dania Ramirez), who can move with superhuman speed, and also sense the nearby presence, and strength, of other mutants; she knows that Magneto and Pyro are the only mutants in the building higher than class III in the degree of their powers. Magneto is particularly intrigued by Callisto's power to sense other mutant presences, and asks if she can locate a particular one for him.A heavily armed police convoy is escorting a fortified, armored police semi-truck serving as a mobile prison, which is carrying a captive Mystique and several other mutants. Mystique is confined behind a heavy barred gate, her wrists shackled to the trailer's ceiling. Mystique taunts the guards watching over her by mimicking first the President, and then a very young girl. One guard threatens to spray her with pepper spray, and she tells him that she's going to personally kill him.Beast arrives at Alcatraz Island to tour Worthington Labs and meet with Leech, the young boy whose DNA is the source of the cure. He is greeted by the company's chief researcher, Dr. Rao (Shohreh Aghdashloo). Beast is there to see that Worthington Labs' treatment of the young boy meets with the standards set by the Department of Mutant Affairs. Dr. Rao brings him to the room where Leech stays in order for him to meet the boy, learn the range of his mutant powers, and see for himself that the boy is being kept fully comfortable.As Beast walks toward Leech to introduce himself and shakes hands, he pauses as he sees his outstretched hand suddenly lose its dark blue coloring, and the coarse hair around the back of his hand suddenly recede; making his hand look human. Mere proximity to Leech causes mutant powers to cease functioning as long as the mutants in question are within a certain distance of his body. Beast's hand returns to 'normal' (for him) once he turns away.Cyclops rides down the road on his motorcycle, heading toward the Alkali Lake reservoir where Jean Grey died. As he walks onto a small natural rock jetty overlooking the lake, he hears the whispered sound of Jean's voice calling his name. Tormented by the whispering voice, he yanks off his red sunglasses and a bright beam of light shoots from his eyes, strafing along the lake's surface. When he regains control of himself and replaces the glasses, he sees that the lake is churning and a large whirlpool has formed in its center. From the whirlpool emerges a blast of water and air pressure that knocks Cyclops on his back. Regaining his bearings, he's stunned to find Jean (Famke Janssen) standing alive and well in front of him.Jean asks Cyclops to remove his glasses so she can see his eyes. Scott is reluctant to look her in the eye because he can't control his optic blasts when his eyes are open. She gently removes his glass, and the bright red flash from his eyes slowly fades out to reveal the natural color of his eyes. Cyclops and Jean begin to kiss. As Jean starts kissing him more passionately, Cyclops' face begins to distort, causing him obvious pain.At the mutant Academy, everyone hears the telepathic voice of Xavier calling out Cyclops' true name. Storm and Wolverine rush to Xavier's office, where he tells them to hurry to Alkali Lake.The two of them arrive at the lake to find cloud cover hanging low over the surrounding hills and a thick fog obscuring vision. Storm clears the fog away, and she and Wolverine find that small rocks, leaves, and even dew on the leaves, levitating in the air. Storm and Wolverine split up to look around, and Wolverine turns to see one of the objects floating in the air in front of him is Cyclops' glasses. Storm yells out to him suddenly, and he finds Storm kneeling over Jean, who lies unconscious but alive.Jean is brought back to Xavier's labs in the Academy where an MRI is run on her brain. Xavier's only theory as to how she survived the incident at the lake that should have killed her, was that her powers wrapped her in a cocoon of telekinetic energy. Jean is the only mutant Xavier has ever met whose power is ranked at Class Five, meaning there are no known limits to her powers. Making her even that much more dangerous is that her mutation is contained in the unconscious part of her mind, which even psychically enhanced mutants have very limited control over. Deeply concerned about Jean's ability to control her powers, Xavier placed a series of psychic barriers around her mind when she first came to the Academy as a teenager, isolating her powers from her consciousness... but this had an unforeseen effect, causing Jean to develop a disassociative personality disorder; causing her subconscious to manifest an entity calling itself the Phoenix. Jean was the disciplined thinking mind, while the Phoenix was pure instinct and emotion, the essence of every feeling Jean experienced, including desire, joy... and rage.Xavier tells Wolverine that he's unsure whether the Jean that lay before them is truly the Jean they know, or the Phoenix struggling furiously to break free and take full control, and that Xavier is trying to restore the psychic barriers and cage the beast again. Wolverine rebels, warning Xavier that a caged beast often becomes angry at its confinement, and protesting that Xavier is forcing his will on another mutant, which is supposed to stand against everything the X-Men believe in and have been taught by Xavier himself. Xavier becomes defensive, telling Wolverine he doesn't need to explain his actions to anyone, least of all him.At the headquarters of Worthington Labs, a news report is covering the mutant cure starting to become available publicly. The reporter notes that the mutant community has been split heavily over the cure's development. Some mutants are desperate to be cured, believing it's the only way they can fit in among human society, while others are offended at the cure's mere existence.The first patient to undergo the procedure is Worthington's son, Warren III (now played by Ben Foster), who's grown into a young man. Worthington is there to witness. Just as Dr. Rao prepares to administer the injection, Warren III rebels, breaking free from the medical assistants trying to hold him steady. The camera pans slightly away from him as he breaks free, showing him spreading a pair of fully developed, beautiful white-feathered wings from his back. Telling his father that the cure, and especially curing Warren himself, was only what his father himself wanted, Warren smashes through the window and uses his wings to take flight as Angel, the mutant name he's given himself. As he soars away from the Worthington tower, Leech watches in awe from his room on Alcatraz.The prison convoy carrying Mystique speeds down the road, to find Magneto waiting for them. Before any of the escort vehicles can react, Magneto effortlessly crushes them and sends them all flying in various directions with a few waves of his hands, then detaches the cab of the semi from the trailer, sending the cab flying as well, and the trailer skidding to a halt. The guard who Mystique had threatened is sent flying to slump against the bars confining her. Mystique immediately thrusts her legs through the bars, grabs the guard and snaps his neck. Showing remarkable agility with just her left leg and foot, she grabs the guard's keys with her foot and unlocks her heavy shackles.Magneto easily forces open the trailer's sealed door and walks in to greet Mystique. Her capture and imprisonment served its purpose: she's learned that the source of the cure was a child at Worthington Labs, and without him, the Brotherhood is safe. Magneto unseals two confinement capsules to recruit two more dangerous mutants: James Madrox/Multiple Man (Eric Dane), who can produce unlimited duplicate copies of himself (Mystique mentions he robbed seven different banks simultaneously), and Cain Marko/Juggernaut (Vinnie Jones), a huge, hulking, powerful man who, once he takes off running and builds momentum, cannot be halted by anything.The second guard, who'd been knocked cold when the trailer was detached from the cab, starts to come to. He reaches for a special gun, loads with a magazine of darts, and lazes up Magneto from behind him. At the last second, Mystique spots the ambush and steps in front of Magneto, her body shielding him. But firing from the guard's weapon is no bullet, but a specially designed needle. As the needle punctures Mystique's skin, she slowly slumps to the ground, shuddering and convulsing as her body begins changing, losing her natural blue coloring and scales. Magneto stares sadly at Raven Darkholme, now cured of her mutation and stripped of all her powers; a normal human again. Gratefully acknowledging that Mystique saved him, Magneto suddenly tells Raven rather coldly that she's no longer one of them. Turning his back to her, leaving her lying naked and powerless, Magneto ushers his fellow mutants out of the trailer, abandoning Raven.News of the convoy attack quickly reaches the President. When Beast hears that the cure has been weaponized in this manner, he resigns from the presidential cabinet in protest. But he shares the President's deep concern that the cure's continued existence is only going to further aggravate relations between mutants and humans in the general populace. Beast says this is another reason why he needs to be where he belongs... with Xavier and the Academy.Wolverine watches over Jean as she sleeps; still laying on the metal gurney; a plastic covering over her head, fitted with wires that monitor her brain activity. As he reaches out to touch her neck, her left hand suddenly grabs his wrist; the plastic covering lifting from her head. Jean's eyes open and she comes to, smiling and looking and feeling seemingly quite well. Wolverine watches as she slowly pulls several electrodes off her upper chest, and Jean notices, saying she didn't need psychic powers to read Wolverine. Slowly, sensually, Jean sits up on the gurney and starts kissing Wolverine. But what starts as a simple kiss quickly escalates as Jean starts to become aggressively passionate in making out with Wolverine. At first, Wolverine reciprocates her affections, until her fingernails slash his skin (the gashes immediately healing). Wolverine starts to remember Xavier's warnings and understands that it isn't Jean trying to seduce him, but the Phoenix; Jean's purely emotional alter-ego. This becomes more clear and obvious when she bluntly tells him that Xavier has gotten into Wolverine's head as well, 'taming' him.Wolverine asks Jean where Cyclops is. Hearing the name 'Scott' quickly snaps the real Jean to the surface as she looks around in confusion at her surroundings. Wolverine shows Cyclops' partially broken glasses to Jean, asking her where Cyclops is. Remembering what happened, Jean's grief and sorrow quickly manifest in telekinetically wrecking the lab room. Wolverine holds her head gently, trying to get her to focus.Suddenly Jean, looking grieved, begs Wolverine to kill her. Her inability to completely control her emotions, and the scope of her power when her emotions rush to the surface and shape her responses, make her a threat to everything and everyone around her. Desperate to keep that from happening again, Jean now wants to die and put the turmoil to rest. Wolverine stares at her, unable and unwilling to carry out her wish. He pleads with her to let Xavier help her. But in a sudden self-defense response, the Phoenix manifests again and hurls Wolverine against the wall, before ripping the door off its hinges and disintegrating it, walking out into the underground halls of the mansion.Meanwhile, Magneto is conferring with Pyro, Juggernaut and Multiple Man. Magneto holds the gun that was used to cure Mystique. This is all the proof Magneto needs that the mutancy cure will be forced on mutant kind. He intends to use it as a lightning rod to incite more mutants to his cause, and to subjugate humanity, before humanity can wipe them out.Suddenly Callisto tells him she's sensed a massive electromagnetic force coming from a mutant; so powerful that the mutant has to be Class Five, more powerful than anything Callisto's ever sensed before. Magneto's face freezes as he recalls the only such mutant he's met who wields such power, and asks Callisto, 'Where is she?'Xavier and Storm find Wolverine unconscious in the wrecked lab room. Xavier is angry at Wolverine, saying he warned him about the threat Jean posed. Closing his eyes in concentration, he senses that Jean has left the mansion, but is erecting a psychic barrier around herself in an attempt to block out Xavier's senses.Xavier, Wolverine and Storm drive to Jean's old house where Xavier and Magneto first met her twenty years ago. Magneto is there as well, complacently inviting Xavier in with him to speak to Jean, just like they did when they first met her. But as he passes by Juggernaut, he glances at Storm and Wolverine and says softly, 'No one gets inside.'Xavier and Magneto find Jean sitting alone in her living room, her face an intense mask. All the furniture around her is levitated a foot off the ground, dropping back down as Xavier and Magneto enter. This time, however, Magneto and Xavier are opposed in their intentions for Jean. Xavier desperately tries to get Jean to understand that she needs his help to control her powers, while Magneto accuses Xavier of keeping Jean on a leash (much in the same way that Wolverine accused Xavier of the same thing). When Xavier reminds Jean that she killed Cyclops in a fit of emotion, she lashes out at them both, creating a telekinetic shock wave that hurls Magneto back out into the kitchen and shoves Xavier's wheelchair back several feet.Wolverine decides he won't wait outside any longer, He and Storm must now fight against Juggernaut, Callisto, Arclight and Kid Omega. Storm's command of wind and lightning quickly incapacitate Kid Omega and Arclight, but Callisto's speed lets her fight back effectively. Meanwhile, Juggernaut hurls Wolverine through walls from room to room. In the living room, Xavier tries to withstand the psychic force of Jean's anger and grief, desperately trying to force a telepathic link to her to reach her, while Magneto remains pinned and helpless against the kitchen counter.Slowly Jean rises from her chair to her feet. Xavier is lifted out of his wheelchair into the air, as the Phoenix begins tearing the whole house apart in her building rage. Jean's face twists, her eyes bulge; she looks almost like a monster. The house lifts up off its foundation, psychic winds pinning Wolverine and Juggernaut against the ceiling. Magneto shouts desperately for Jean to stop and hold herself back, but the Phoenix, in full command of Jean's body and powers now, pays no attention.Jean raises her arms and time seems to slow. Wolverine uses his claws to pull himself along the ceiling and open a casement door that lets him see into the living room. Xavier makes a final plea to Jean, not to let her power and emotions control her, before Xavier's whole body disintegrates completely, leaving no trace of him. The house is released from the psychic storm and crashes back down onto the ground, completely wrecked.Magneto is stunned at the seeming death of Xavier; despite their being on opposing sides of mutant ethics, and therefore technically enemies, Xavier is one mutant Magneto still loved like a brother. But with no other recourse for the immediate moment, he rises, quietly walks over to Jean and politely asks her to come with him. Jean offers no resistance as Magneto leads her away.Storm and Wolverine make their way to the living room, finding Xavier gone, his wheelchair unattended. The scene closes with both of them weeping bitterly over the loss of their mentor.Xavier's wheelchair is placed in his office back at the mansion, and Storm gives a moving eulogy at a memorial service at the Academy mansion, where a headstone has been placed in the back gardens. All the students at the academy attend, as does Dr. Moira MacTaggart. Some time later, Iceman goes to see Shadowcat at her room. To cheer her up, he gets her to sneak the two of them out of the mansion proper by going through the wall, and takes her to a large fountain in the back gardens, where he freezes the water into an impromptu ice rink, and they skate together on the ice. Rogue is seen watching from her room, looking not at all pleased.Rogue has packed her bags and is leaving the mansion. Wolverine sees her as she reaches the door. To her surprise, he's not ordering her back upstairs ('I'm your friend, not your father,' he tells her), but he does urge her to think very carefully and be completely certain that she's doing the right thing, before she steps out of the front door. Rogue does take a few seconds to think after Wolverine turns away, and then she leaves.Magneto's Brotherhood has grown into a sizable army which has built a small camp in the woods. Magneto approaches Jean as she watches the camp mutants mill about. Magneto talks about how he saw the next stage in evolution when first met Jean, and wonders why Xavier wanted to hold her back when her power was virtually unlimited. He holds up the weaponized cure gun and lets it float in the air as he speaks about this. Jean stares at the gun and it comes apart, the cartridge breaking apart until the needles float in the air and begin to turn toward Magneto. Frightened suddenly at the threat, Magneto pleads for her to stop as she smirks in delight. Finally she lets the needles drop and asks how Magneto's desires regarding her are different from Xavier's. Magneto tells her that he wants to let her grow into whatever it is she's destined to grow into, but they must fight for their freedom first, as the weaponized cure, as Magneto believes, is meant for all of them.Callisto tells Magneto she's worried about Jean's presence; she can tell that Jean's power is completely unstable. Pyro, meanwhile, believes that Jean is still one of the X-men at heart. Pyro himself used to be, but has been loyal to Magneto since he first began his own crusade. But Pyro goes too far when he says he'd have killed Xavier if Magneto let him. Magneto quickly reins Pyro in with a stern reminder that although he and Xavier were completely opposed in their dealings with humanity, both shared the same vision of a mutant kind free from fear and prejudice, and Magneto is deeply saddened that Xavier had to die for the Brotherhood's dream to live.Wolverine, Storm, Beast, Iceman and Shadowcat are in one of the classrooms of the Academy, discussing its future. Beast believes it might be best if the Academy ended and the students sent home. But Iceman points out that many of the students there have no home to go to, many being unwelcome among their families.Angel suddenly enters, saying he'd heard that the school was a safe haven for mutants. Looking intently at him, Storm is moved to action; she promises to get a room at the mansion for Angel, and tells Beast to spread the word that the Academy will stay open.Iceman goes to Rogue's room and finds it empty. He learns from Colossus that Rogue left the Academy.Wolverine is paying respects at Xavier's headstone when suddenly he's assaulted by a psychic bombardment; Jean's subconscious voice calling out to him. Feeling drawn to it, Wolverine hurried packs some of his belongings to head out in search of her. Storm tries to talk him out of it, but cannot.A line of mutants stands in front of a medical clinic to receive the cure. Across the street is a mob of angry mutants reciting a chant that they don't need a cure. Knowing that Rogue has probably come here, Iceman has come in search of her. As he stands behind the barricade where the protesting mutants stand, Pyro finds his way to him. Pyro quickly realizes why Iceman is there and taunts him about Rogue's desire to be cured. Iceman manages to hold his temper and avoid starting a fight with his one-time friend. As Iceman turns away, Pyro ignites the lighter strapped to his wrist and sends a large blast of fire to blow out the windows in the medical clinic, sending people and mutants alike scattering.Magneto delivers a message that is broadcast on television, that the attack was only the first salvo in the Brotherhood's fight. He warns all of humanity that until the cure ceases to exist, no human will be safe, anywhere. He asks all mutants that don't want to join his fight, to simply stay out of the way, as he's strongly opposed to seeing any more mutant casualties. The President and Secretary Trask watch the broadcast in the Oval Office. The President orders Worthington Labs seized and secured, and all troops armed with cure weapons. He says if Magneto is going to war, he'll give Magneto one.Army bases are seen mobilizing. Soldiers are ordered to turn in all metal, including bayonets and even dog tags. Cure rifles made entirely out of plastic, which will be effective against Magneto, have been made ready, along with plastic cartridge magazines loaded with plastic cure needles. Many newly armed soldiers have secured the medical clinics where the cure is still being offered. A bus drops Rogue off, and after looking around apprehensively for a moment, she quietly gets in the line.Wolverine has tracked Jean by her scent to the woods. As he reaches the perimeter of the camp, he's attacked by some of the mutants keeping guard, including one who can project from his wrists, and then throw, spike-like projections made of horn. Wolverine defeats all the guards and infiltrates the camp where Magneto is delivering a rousing speech to incite them further. As Magneto speaks and the Brotherhood army cheers, Wolverine happens to lock eyes with Jean. She sees and recognizes him and turns away.Wolverine follows Jean and calls out to her. She turns to face him, when suddenly Wolverine is thrust backward by an unseen force and pinned against a tree. This force doesn't come from Jean, however, but from Magneto, who'd been able to smell the adamantium inside Wolverine's body. Magneto shows that Jean is at the camp with the Brotherhood of her own accord, and surely she is far too strong for anyone, even Magneto himself, to hold her prisoner. Scoffing at Wolverine's assertion that he's only leaving when Jean comes with him, Magneto hurls him halfway through the woods to a painful crash landing.A contingent of armed forces soldiers is preparing to converge on Magneto's base of operations. A satellite shows a thermal signature display of the soldiers moving in on a large body of mutants on all sides, surrounding them. The President notes, with satisfaction, that Raven Darkholme has provided Army intelligence with all the information they needed to conduct this raid, in retaliation for her being abandoned by Magneto. At the President's command, the soldiers charge in on all sides, their special rifles aimed.Suddenly the thermal signatures display for the large body of mutants begin simply dropping off the satellite display. Trask and the President stare at the monitor in total bewilderment. All of the mutants merge into one Multiple Man, who condescendingly surrenders. Multiple Man made the perfect decoy so that Magneto and the Brotherhood army could slip away before the armed forces could locate them. The only question is, where have they gone.Magneto stands the coastline overlooking Alcatraz Island, along with Callisto, Arclight, and Juggernaut. Their plan is to seize control of Worthington Labs there and kill Leech, whose DNA is the source of the cure. Worthington Labs has been able to replicate the DNA, but not generate it from scratch. As to how to get the whole Brotherhood army across the water to the island, Magneto has a plan.Wolverine makes it back to the Academy mansion to mobilize the X-Men. The odds against them are indeed daunting-- only Wolverine, Beast, Storm, Colossus, Iceman and Shadowcat are available to fight against Magneto... and Jean being among the Brotherhood makes their strength seem unbeatable. As Wolverine, Beast and Storm prepare to suit up, Angel is seen looking out from his room momentarily.The six available X-Men meet at the entrance to the hangar where the X-Men jet rests. Iceman isn't ashamed to hide his deep concern at how badly outnumbered they are. Stepping up to a leadership role, Wolverine acknowledges this, but says that unless they fight with their all, everything that Cyclops and Xavier died for, will die as well. Nodding, both Iceman and Shadowcat say they're in and will fight to defend what they stand for. As they prepare to board the jet, Storm has one question to Wolverine: whether he will do what he needs to do when the time comes.Magneto breaks the Golden Gate bridge free from its moorings and moves the whole bridge to span from the spot on the coastline where his army has gathered, to Alcatraz. This is seen on satellite at the White House, to the horror and shock of the President and Trask, and all the military commanders stationed there. The Brotherhood marches across the bridge to stand just shy of a rock outcropping on Alcatraz Island.Pyro gives the signal and a wave of Brotherhood mutants begin charging onto Alcatraz Island from the bridge. Juggernaut readies to also charge, but Magneto raises a hand to stop him, telling him that the pawns always make the first moves in chess.The Alcatraz guards prepare their weapons, launching waves of cure needles. Magneto notes to his consternation that all of the guards' weapons and gear are plastic, rendering his own powers ineffective against them. The guards begin completely routing the first wave of mutants, using specially designed cluster rocket launchers to spray waves of cure needles. Magneto has to improvise when a cluster rocket is launched at the bridge, maneuvering several large slabs of metal from the bridge to act as shields, blocking the needles.Magneto now moves a knight in the chess game, having Arclight step forward and use her air-pressure shock waves to shatter all the plastic weapons and cluster launchers. Magneto then deploys both his knights and his bishops: the second wave of Brotherhood mutants now begin to charge the island, turning the tide of battle. Arclight, Psylocke, and Kid Omega rush into the prison complex to find Worthington. Watching the siege via satellite, Trask and the President can only pray. Jets and tanks would be decimated instantly by Magneto and the nearest contingent of ground troops are a half hour away.But the X-men jet has arrived. Landing on the roof of the prison complex, Storm and Wolverine lead the X-Men into battle. Storm flies in, using barrages of lightning to halt the mutant charge, allowing Wolverine, Beast and Colossus to rally the human soldiers and begin taking the fight back to the Brotherhood. Seeing Storm take flight again, Callisto gives an evil grin and moves for an ambush. Using her superhuman speed, she is able to rapidly jump onto the roof of the prison complex and leaps, tackling Storm down to the ground, where the two of them battle hand to hand. Seeing Iceman joining the battle, conjuring a wall of ice to halt a group of charging Brotherhood mutants, Pyro wants to rush forward to face Iceman, but Magneto holds a hand to stop him.Magneto now moves a rook in the chess game, telling Juggernaut to break into the prison complex and take out Leech. Shadowcat sees Juggernaut's charge and phases through the prison wall. Running up behind Juggernaut, she phases him halfway through the floor and takes off running, phasing through walls to find Leech. But Juggernaut can play this game of tag with her and then some, easily smashing through any wall she phases through. Shadowcat temporarily outwits him by phasing through one wall and then leaping to one side, hiding as Juggernaut blindly continues his charge forward until he realizes the ploy.Arclight and Kid Omega locate Worthington and Dr. Rao. The two of them try to escape from the mutants, only to find themselves cornered by Psylocke's ability to teleport through areas of shadow. Psylocke and Arclight seize Worthington and drag him off while Kid Omega grabs Dr. Rao, holding her against him while soothingly telling her that everything will be all right. This, of course, is a lie, as Omega then erupts his sharp quills from all over his body, killing Dr. Rao.Shadowcat makes her way into Leech's room, gently telling him she's here to help. She takes his hand and goes to the far wall to phase through it, but finds she can't. Leech tells her that mere proximity to him nullifies her mutant powers. And the sound of smashing stone tells them that Juggernaut is closing in. Getting an idea, Shadowcat waits for Juggernaut to smash into the room, and then taunts him, verbally mocking him. Juggernaut roars in anger and charges, looking to smash her and Leech into pulp against the wall. Shadowcat leaps aside with Leech at the last second, and Juggernaut, his own powers fading as he gets close, crashes into the wall and knocks himself senseless, allowing Shadowcat to hurry Leech to safety, the long way, by running.Arclight and Psylocke drag Worthington to the roof of the prison complex. As punishment for his inventing the cure, they are going to hurl him off the roof to his death. But as Worthington is thrown down, his son Angel swoops in, using his wings and power of flight to save him.Outside, the Brotherhood is starting to get routed. Storm defeats Callisto by hurling her into a chain-link fence and barraging the whole fence with blasts of lightning. Magneto gestures for Pyro to help him; the second rook and the king on the chess board are marching into battle.Magneto begins hurling all the abandoned vehicles still on the bridge, like missiles, which Pyro sets ablaze. The explosive, flaming missiles rain down on the island, forcing all of the soldiers, and the X-Men as well, to take cover. As they hunker down behind whatever cover they can find, the X-Men desperately look for a way to strike back.Lying on the ground is a broken plastic handgun; the cartridge of needles still intact. Wolverine spots it and the X-Men have their counterattack, if they can all work together as a team. Storm provides cover by condensing water vapor into pea-soup fog around the island. Iceman begins freezing some of the flaming cars as they are hurled down, taking some of the sting out of them, and also making Pyro seethe with the desire to face his rival. Magneto sees Pyro's anger and tells him to go ahead and fight Iceman.Pyro and Iceman square off, Pyro hurling fire which Iceman blocks with his ice beam. The battle seems at a stalemate until Pyro reaches inward and begins projecting his fire with redoubled force. The flame pushes Iceman's ice beam back until the flames seem about to engulf him. But Iceman counters by covering his whole body in ice, protecting him, then snaking his hands outward and around to grab Pyro's wrists, freezing the lighters strapped to them. As Pyro can only channel and manipulate fire, and not create it, he is now defeated. Iceman knocks him out with a headbutt.Wolverine and Colossus walk forward as the fog clears. Colossus grabs Wolverine and, using the same maneuver as in the training chamber, hurls Wolverine at Magneto. Raising a hand, Magneto easily stops Wolverine, dragging him down to the ground, pinning him there on his back, just shy of Magneto at his feet.But this too was a decoy; the real threat was from Beast. Having moved around and scaled the bridge, Beast leaps down, landing behind Magneto, and plunges the cure needles into him. Magneto slowly crumples to the ground, looking at the needles with horror and dismay as his powers fade and he is reverted to a normal human. Jean Grey looks on impassively as Eric Lensherr, ex-Magneto, tells her this is what humanity wants for all mutants. Wolverine and Jean lock eyes as he tells her that the battle is over.But the arriving ground troop reinforcements from the army arrive, blindly charging and firing a massive barrage of cure needles. Jean hears their shouts and the sound of the needles launching. Fear gives way to anger, which gives way to rage, and Dark Phoenix stirs from within Jean: the queen on the chessboard. With but a dark glare, the needles and the entire contingent of reinforcement soldiers are disintegrated. The X-Men watch in horror as Phoenix begins unleashing her powers, tearing the entire island apart, indiscriminately disintegrating and eradicating anything that gets too close to her, human and mutant alike, the X-Men jet, the upper floors of the prison complex. Wolverine tells Storm that he is the only one who can still stop Phoenix. Storm leads the X-Men and remaining soldiers to evacuate the island and flee across the bridge. Shadowcat emerges from the prison complex with Leech and follows the flight. Even Eric stares in fear at what he's unleashed before also fleeing.Wolverine begins trudging toward Jean. Phoenix turns her assault on him; the disintegrating flesh sloughing off Wolverine's body and pushing his instant regenerative powers to the limit. Finally Wolverine reaches her and stands face to face. With a look of cruel amusement, Phoenix asks Wolverine if he'd die for his fellow X-Men.A look of sorrow in his eyes, Wolverine answers, \"Not for them... for you.\" The emotional response jars Jean's consciousness back to the surface with a gasp. Gazing deep into Wolverine's eyes, Jean begins to cry. She tearfully begs Wolverine to kill her so she can be saved from Phoenix, and from herself. Wolverine hesitates, telling Jean he loves her, before driving his claws through her midsection. Instantly his face turns grieved, but Jean smiles in silent gratitude and peacefully closes her eyes before slumping lifeless in Wolverine's arms.Cut to the Xavier mutant academy, Shadowcat standing before the graves of Xavier, Jean and Cyclops, the grave markers bearing their full real names. The school is back in full operation with Storm running it in Xavier's place. Marie D'Ancanto has returned, though she has voluntarily undergone the cure and is no longer Rogue. She tells Iceman it's what she wanted, as she holds his hand for the first time. Leech is now also a student at the school. Wolverine, now a full-time teacher at the academy, watches a news bulletin where the President introduces Beast, as Dr. Hank McCoy, having appointed him as the new United States ambassador to the United Nations, representing mutant interests.In the last scene, Angel is seen flying over the still-broken Golden Gate Bridge. As he continues soaring through the air, the camera pans down from him to a peaceful park where people are engaged in playing chess. The camera pans along them to zoom in on one person sitting with no opponent, before a board on which sit metallic pieces. It is Eric Lensherr. He raises a hand toward the black queen and concentrates, and the chess piece only teeters very slightly.In an extra scene after the closing credits are finished, Dr. Moira MacTaggart is seen walking into the hospital room of the brain-dead man. To her astonishment and shock, the man's face suddenly turns to her and says, \"Hello, Moira,\" in Xavier's voice. Freeze on Moira's face as she softly whispers, \"Charles?\""
        ],
        "summaries": [
          "The human government develops a cure for mutations, and Jean Gray becomes a darker uncontrollable persona called the Phoenix who allies with Magneto, causing escalation into an all-out battle for the X-Men.",
          "When a \"cure\" is created, which apparently can turn any mutant into a \"normal\" human being, there is outrage amongst the mutant community. While some mutants do like the idea of a \"cure\", including Rogue, many mutants find that there shouldn't be a \"cure\". Magneto, who still believes a war is coming, recruits a large team of mutants to take down Warren Worthington II and his \"cure\". Might seem easy for the X-Men to stop, but Magneto has a big advantage, which Wolverine doesn't have. Jean Grey has returned, and joined with Magneto. The Dark Phoenix has woken within her, which has the ability to destroy anything in her way, even if that \"anything\" is an X-Man.",
          "When a special medicinal \"cure\" for mutants is created by a government funded laboratory, a choice is to be made by mutants all over the world. However, this does not sit well with Professor X and his X-Men, who are questioning about the situation. But Magneto sees this news as a threat, and begins to build a mutant army in order to destroy it. On the other hand, in light of the returning Jean Grey, the X-Men find that they are not only up against Magneto and his Brotherhood, but a deadly force more powerful than anything that came before.",
          "After the uneasy alliance with Magneto in X2 (2003), the entire species of the powerful meta-humans find themselves before an agonising dilemma: with the aid of a revolutionary medical treatment, all mutants can now suppress their extraordinary gene, to live an ordinary life as humans. To further complicate matters--as the former X-Men member, Jean Grey, evolves into the dark and omnipotent Phoenix--Magneto amasses an invincible army of mutated supporters, against the backdrop of odious conflict within the mutant community. At first, the super-humans were fighting for acceptance, then, for survival. Now, all mutants must choose sides. Can Professor X, Storm, Wolverine, and a handful of loyal X-Men stop the formidable menace, Phoenix?",
          "The X-Men, mutant heroes sworn to defend a world that hates and fears them, are back. This time, with the help of new recruits Beast and Angel, they must face evolution in the form of their former teammate, Jean Grey. Possessed with the cosmic power of the Dark Phoenix, the resurrected Jean Grey has become a danger to herself, her mutant comrades, and the entire planet. To stave off this imminent threat to humanity, a potential \"cure\" is discovered and processed to treat, and ultimately eliminate, genetic mutations, once and for all. Now, as the battle lines are drawn, the X-Men, led by Professor Charles Xavier, must contend with Jean Grey's world-consuming powers, as well as the malevolent Brotherhood, a band of powerful mutants organized under Xavier's former ally, Magneto.",
          "When a private laboratory, supported by the government, finds a \"cure\" for the mutants, using the D.N.A. of a powerful boy, the mutants have the option of giving up their powers and become human, but their society split. Magneto opposes and decides to join a force to fight against the government, and kill the mutant boy. Meanwhile, Jean Grey resurrects uncontrolled by Xavier and with the personality of the powerful Dark Phoenix. She destroys Cyclops and Professor Charles Xavier, and allies with the evil forces of Magneto, making them almost invincible."
        ]
      }
    ]
  }
}
