{
"took": 50,
"timed_out": false,
"_shards": {
"total": 2,
"successful": 2,
"skipped": 0,
"failed": 0
},
"hits": {
"total": {
"value": 355,
"relation": "eq"
},
"max_score": 21.138378,
"hits": [
{
"_index": "movies",
"_type": "docs",
"_id": "si_NAIUBmFo8GYv0bo80",
"_score": 21.138378,
"_source": {
"title": "8: The Mormon Proposition",
"year": 2010,
"genders": [
"Documentary"
],
"score": 7.1,
"directors": [
"Reed Cowan"
,
"Steven Greenstreet"
],
"writers": [
"Reed Cowan"
],
"synopsis": [
"As California's anti-gay marriage proposition 8 languished in the polls, Mormon Prophet Thomas S. Monson issued a call from Salt Lake City to millions of Mormons all over the world. His was an order to action containing the secret code language of the highly secret Mormon temple ceremony. The action alert commanded Mormons in and out of California to do all things necessary to insure the passage of California's Proposition 8. Within days, hundreds of thousands of Mormons all over the United States funneled thirty million Mormon dollars in to California coffers to purchase the passage of California's anti-gay marriage Proposition 8.Before the Mormons and their participation in the passage of Proposition 8, evangelicals were flopping in the fight. After Mormons got involved, the fight flourished.During the fight, the Mormon Church media-engine, including mega-million dollar public relations and political consulting firm support, barraged Californians with a suffocating number of misleading television and radio ads and door-to-door campaigns manned by the Mormon NATIONAL ORGANIZATION FOR MARRIAGE.When Prop. 8 passed in California by a slim margin, Mormons were quick to take credit for the success. But when backlash from LGBT citizens targeted Mormon temples throughout the United States, the Mormon Church was the first to complain that they were the ones being persecuted.In the wake of it all, documentary producer Reed Cowan was collecting secret recordings, secret documents and never before seen footage exposing Mormon efforts to quash ANY rights for LGBT citizens anywhere in the world. 'As a former Mormon missionary, I am appalled in knowing that a church which itself worships the practice of alternative marriage (polygamy), would become so vehemently involved in the marriage debate,' says Director Reed Cowan.8: The Mormon Proposition follows the story of many LGBT citizens seeking marriage equality. One of the couples Cowan follows is Tyler Barrick and Spencer Jones. Barrick is the direct descendant of Mormon founder and Prophet, Joseph Smith's right hand man Fredrick G. Williams.The Barrick-Jones family history tells tales of Mormon ancestors chased from state to state because of their own practice of alternative marriage (polygamy). Now, decades later, the Barrick-Jones family is experiencing cultural and governmental discrimination of the same kind that haunted their ancestors. Only now, they're at war with their own religion of Mormonism and the people their religion seduced in to voting against their union.'When 8 passed, I called my mother crying--why did the Mormons do this to us? Why would our own people do this to us? They have turned their backs on us, ' says Barrick-Jones.8: The Mormon Proposition exposes decade's-long campaigns against LGBT rights, not only working behind the scenes to unseat political leaders who advocate for marriage equality, but also abuse against their own people through electric shock therapy and frontal lobotomies for BYU men arrested by Mormon security police. For the first time in history, the film goes on record about alleged prurient meetings between Mormon Prophet Spencer W. Kimball with a secret group of gay BYU students who called themselves 'Spencer's boys.' The film chronicles the hundreds of gay-Mormon suicides, including the story of Mormon Stuart Matis, who shot himself on the steps of a California Mormon Church during another of the church's work against marriage equality during the days of California's Knight Initiative.Long before its official completion, 8: The Mormon Proposition has already received considerable international press coverage. During the filming of 8, Reed Cowan interviewed Mormon Bishop and Senator D. Chris Buttars, who compared gay people to radical Muslims and said 'gays represent the greatest threat to America going down today.'Buttars characterization of gays engaged in so-called pig sex, brought on an HRC action alert, a scolding from GLAAD, and the eventual ouster of Utah Senator Buttars from his position as chair of Utah's Senate Judiciary Committee.In the days during the media backlash following Buttars interview with Cowan for 8, major media outlets and programs like FORBES, WASHINGTON POST and THE RACHEL MADDOW SHOW picked up on the story with considerable coverage that resulted in thirty thousand e mails to the Utah Senate President and the crashing of the Utah Senate computer server for three days.8: The Mormon Proposition also reveals the truth about Utah's gay homeless youth and the fact that the lions-share of hundreds of homeless teens on the streets in Utah, are LGBT youth who have been kicked out after coming out to their families.Finally, in the telling of the Mormon Church's risk of losing their tax-free status, 8: THE MORMON PROPOSITION is a call to action not only to LGBT citizens, but all citizens everywhere to not only stand up for human rights, but also to pay attention to where the money and the information is coming from whenever a ballot measure picks up uncommon speed, money and heat.In the words of Reed Cowan, '8: The Mormon Proposition puts on record one of the greatest election shams in the history of the United States. If the Mormon church gets a pass on this one, we're in grave danger as a society of letting other groups purchase votes and we're putting power behind their so-called 'secret combinations' to do it again. This can never happen again. Never.'"
],
"summaries": [
"A scorching indictment of the Mormon Church's historic involvement in the promotion & passage of California's Proposition 8 and the Mormon religion's secretive, decades-long campaign against LGBT human rights."
,
"In 2009, thousands of LGBT citizens are denied almost 200 civil rights their straight, married counterparts enjoy through civil marriage. Some states have signaled progress. But amid the progress, The Mormon Church, with its front-group THE NATIONAL ORGANIZATION FOR MARRIAGE, has been coordinating, financing and leading the effort to stop the advancement of marriage equality for more than three decades. As an organization worth hundreds of billions of dollars, the Mormon Church has been able to wage this war in secret. Not until the California Fair Political Practices Commission launched an investigation into the Mormon's involvement in Proposition 8, did the secrets of the Mormon effort become a matter of record. Through never-before seen documents, recordings & insider-interviews, 8: THE MORMON PROPOSITION, exposes the efforts of the Mormon Church and its members to halt nearly every piece of LGBT legislation on the desks of lawmakers from Hawaii to New York. 8: THE MORMON PROPOSITION makes these efforts a matter of record and challenges viewers to demand more of government officials in requiring religions more transparency in their efforts to influence public policy. Emmy-award winning journalist and documentary filmmaker Reed Cowan is a former Mormon who served a two-year mission door-to-door for the Mormon Church. His access to high-level Mormons & Mormon communications on the matter, coupled with his OUT status as a gay man and father of two adopted sons has provided a compelling and at times shocking look at the Mormon way of doing business against LGBT people."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "dS_NAIUBmFo8GYv0bnwu",
"_score": 15.770205,
"_source": {
"title": "East Palace, West Palace",
"year": 1996,
"genders": [
"Drama"
],
"score": 6.3,
"directors": [
"Yuan Zhang"
],
"writers": [
"Xiaobo Wang"
,
"Yuan Zhang"
],
"synopsis": [ ],
"summaries": [
"Before the 1990s P.R.China criminalized the LGBT population. Without family law and marriage law for the LGBT couples, many had to secretly encounter for sexual activities with the risk of police arrests."
,
"In China, homosexuality isn't illegal, but homosexuals are routinely persecuted by police and arrested for "hooliganism". The film focuses on a young gay writer A-Lan who, being attracted to a young policeman, manages to have himself interrogated for a whole night. His life-story which he tells during the interrogation reflects the general repression of the Chinese society. The policeman's attitude shifts from the initial revulsion to fascination and, finally, to attraction."
,
"In Beijing, gays have hidden sexual encounters in a park during the night and are severely repressed by the police. The writer A Lan is arrested by the policeman Xiao Shi and along the whole night, he is interrogated, disclosing his hard life-story since he was a child and his crush on Xiao Shi."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "vS_NAIUBmFo8GYv0booy",
"_score": 15.593084,
"_source": {
"title": "Love My Life",
"year": 2006,
"genders": [
"Drama"
],
"score": 6,
"directors": [
"Kôji Kawano"
],
"writers": [
"Hiroko Kanasugi"
,
"Ebine Yamaji"
],
"synopsis": [ ],
"summaries": [
"Ichiko and Eri are two beautiful Japanese Uni students who are in a lesbian relationship. Ichiko comes out to her father who tells her he is also gay and her mother was a lesbian. Her best friend is gay too, though he has a female who is after him. Their liaison is very intense, but Eri suggests a temporary separation so she can concentrate on her law studies. The break from their affair is difficult for Ichiko to deal with. But Eri soon sorts out her priorities."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "ES_NAIUBmFo8GYv0bpI1",
"_score": 15.575281,
"_source": {
"title": "Wish Me Away",
"year": 2011,
"genders": [
"Documentary"
,
"Biography"
,
"Music"
],
"score": 7.5,
"directors": [
"Bobbie Birleffi"
,
"Beverly Kopf"
],
"writers": [
"Chely Wright"
,
"Jennifer Archer"
,
"Howard Bragman"
],
"synopsis": [ ],
"summaries": [
"After a lifetime of hiding, Chely Wright becomes the first commercial country music singer to come out as gay, shattering cultural stereotypes within Nashville, her conservative heartland family and, most importantly, within herself. With unprecedented access over a two-year period, including her private video diaries, the film layers Chely's rise to fame while hiding in the late 90's with the execution of her coming out plan, culminating in the exciting moment when she steps into the media glare to reveal she is gay. The film shows both the devastation of internalized homophobia and the transformational power of living an authentic life. The film also documents the conflicting responses from Nashville, the heartland and the LGBT community as Chely Wright prepares for an unknown future."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Ky_NAIUBmFo8GYv0bpg3",
"_score": 15.105504,
"_source": {
"title": "Pride",
"year": 2014,
"genders": [
"Biography"
,
"Comedy"
,
"Drama"
],
"score": 7.8,
"directors": [
"Matthew Warchus"
],
"writers": [
"Stephen Beresford"
],
"synopsis": [
"Its the summer of 1984 Margaret Thatcher is in power and the National Union of Mineworkers (NUM) is on strike. At the Gay Pride March in London, a group of gay and lesbian activists decides to raise money to support the families of the striking miners. But there is a problem. The Union seems embarrassed to receive their support.But the activists are not deterred. They decide to ignore the Union and go direct to the miners. They identify a mining village in deepest Wales and set off in a mini bus to make their donation in person. And so begins the extraordinary story of two seemingly alien communities who form a surprising and ultimately triumphant partnership."
],
"summaries": [
"U.K. gay activists work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984."
,
"In 1984 20 year old closet gay Joe hesitantly arrives in London from Bromley for his first Gay Pride march and is taken under the collective wing of a group of gay men and Lesbian Steph, who meet at flamboyant Jonathan and his Welsh partner Gethin's Soho bookshop. Not only are gays being threatened by Thatcher but the miners are on strike in response to her pit closures and Northern Irish activist Mark Ashton believes gays and miners should show solidarity. Almost by accident a mini-bus full of gays find themselves in the Welsh village of Onllwyn in the Dulais valley and through their sincere fund raising and Jonathan's nifty disco moves persuade most of the community that they are on the same side. When a bigot tries to sabotage the partnership with a tabloid smear Mark turns it back on her with a hugely successful benefit concert to which most of the villagers, now thoroughly in tune with their gay friends, turn up. The miners are defeated and return to work but at the Pride march the following year a vast contingent of miners show up to repay their comrades with their show of support."
,
"It's the summer of 1984. Margaret Thatcher is in power and the National Union of Mineworkers (NUM) is on strike. At the Gay Pride March in London, a group of gay and lesbian activists decides to raise money to support the families of the striking miners."
,
"Set in the summer of 1984 Margaret Thatcher is in power and the National Union of Mineworkers (NUM) is on strike. At the Gay Pride March in London, a group of gay and lesbian activists decides to raise money to support the families of the striking miners. But there is a problem. The Union seems embarrassed to receive their support."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "lS_NAIUBmFo8GYv0bnMr",
"_score": 14.744228,
"_source": {
"title": "Dimenticare Venezia",
"year": 1979,
"genders": [
"Drama"
],
"score": 6.7,
"directors": [
"Franco Brusati"
],
"writers": [
"Franco Brusati"
,
"Jaja Fiastri"
],
"synopsis": [ ],
"summaries": [
"A gay brother visits his childhood home where his sister still lives with her lesbian niece and her girlfriend. They reminisce about the better past and their parents."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "dC_NAIUBmFo8GYv0boIw",
"_score": 14.357601,
"_source": {
"title": "Hush!",
"year": 2001,
"genders": [
"Comedy"
,
"Drama"
],
"score": 6.9,
"directors": [
"Ryosuke Hashiguchi"
],
"writers": [
"Ryosuke Hashiguchi"
],
"synopsis": [
"Basics: 2 guys who are gay, one female who is lonely for someone to love. The woman approaches 1 of the guys and wants him to seed her would be child. Gay guy 1 moves through the movie with all the usual angst. Gay guy 2 loves him but is just this side of giving up on gay guy 1 because he is too ambivalent. The parent and families get involved and all heck breaks loose."
],
"summaries": [
"Soon after the disparate yet compatible Naoya and Katsuhiro start to settle into a relationship, a slightly unhinged young woman named Asako asks Katsuhiro to father her child."
,
"While the couple navigates the implications of this unexpected proposal, they are forced to confront their conflicting understandings of what it means to be gay and in a committed relationship. A landmark work of LGBTQ Japanese cinema by pioneering director Ryosuke Hashiguchi, Hush. humorously and poignantly upends the traditional Japanese genre of the family drama to offer a deeply human story about three people doing their best to be true to themselves."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "UC_NAIUBmFo8GYv0bpA1",
"_score": 13.876739,
"_source": {
"title": "Girltrash: All Night Long",
"year": 2014,
"genders": [
"Comedy"
,
"Crime"
,
"Drama"
],
"score": 6.2,
"directors": [
"Alexandra Kondracke"
],
"writers": [
"Angela Robinson"
],
"synopsis": [
"Based on the extremely successful Internet Web series from Showtime, GIRLTRASH: All Night Long, the Movie stars Lisa Rieffel (lead singer of Killola), Gabrielle Christian ('South of Nowhere'), Michelle Lombardo ('Quarterlife'), Mandy Musgrave ('South of Nowhere'), Rose Rollins ('The L Word'), Kate French ('One Tree Hill', The L Word', 'Wicked Wicked Games') and Clementine Ford ('The L Word'). Directed by Alex Kondracke and produced by Angela Robinson ('D.E.B.S.', 'Herbie Fully Loaded', 'The L Word') & Lisa Thrasher ('Itty Bitty Titty Committee'). Stacy Codikow (D.E.B.S., Itty Bitty Titty Committee) the founder of POWER UP is executive producing.In the tradition of "Go" and "Superbad," 'GIRLTRASH: All Night Long' is the story of five girls and one epic night. Daisy and Tyler are two hapless rockers trying to make it to a Battle of the Bands concert on time. They are waylaid by Daisy's sister, Colby, who has her sights set on hooking up with the girl of her dreams, Misty (that is, if she can manage to have a conversation with her first.) As the night spirals out of control, the girls will find lesbian love, lust, girl-fights, rock and roll, and a whole lot of stoned sorority girls. Oh, did we mention it's a musical?Source- girltrashallnightlong.com"
],
"summaries": [
"The story of five girls and one epic night. The girls will find love, lust, girl-fights, rock and roll, and a whole lot of stoned sorority girls."
,
"Set during one long night in the LGBT sub-culture of Los Angeles, Daisy and Tyler are two rock and roll musicians who are selected to partake in a battle of the bands contest to claim a prize. But while on their way to the concert, their van breaks down and they are sidetracked by Daisy's younger sister, Colby, a recent college graduate who agrees to drive them to the concert if they help her hook up with her girl-crush; a struggling actress named Misty. Also tagging along is Misty's bisexual best friend Sid, who longs to hook up with a famous celebrity. However, Misty is not interested in hooking up with Colby because she has her sights on Tyler. Meanwhile, Daisy tries to win back her ex-girlfriend, Xan, who is on a date with her latest girlfriend who is competing against Daisy and Tyler's band that very night. Elsewhere, Monique Jones is a violent ex-con recently paroled from prison who comes looking for Daisy and Tyler with a score to settle."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "MC_NAIUBmFo8GYv0bpI1",
"_score": 13.770108,
"_source": {
"title": "Stud Life",
"year": 2012,
"genders": [
"Drama"
,
"Romance"
],
"score": 5.1,
"directors": [
"Campbell Ex"
],
"writers": [
"Campbell Ex"
],
"synopsis": [ ],
"summaries": [
"JJ is a 'Stud' Lesbian. Together with her best friend Seb, a gay pretty boy, they work as wedding photographers. When JJ falls in love with a beautiful diva, JJ and Seb's friendship is tested. JJ is forced to chose between her hot new lover and her best friend."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Ri_NAIUBmFo8GYv0bpQ2",
"_score": 13.415571,
"_source": {
"title": "I Do",
"year": 2012,
"genders": [
"Drama"
,
"Romance"
],
"score": 6.5,
"directors": [
"Glenn Gaylord"
],
"writers": [
"David W. Ross"
],
"synopsis": [ ],
"summaries": [
"A gay Brit living in New York is deprived of his immigration status and risks losing his family and life in the U.S. He marries his lesbian best friend to remain in the country and stay with his family, but things get complicated when he meets the love of his life and is forced to make an impossible choice."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "1C_NAIUBmFo8GYv0bogy",
"_score": 12.534144,
"_source": {
"title": "Itty Bitty Titty Committee",
"year": 2007,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 5.4,
"directors": [
"Jamie Babbit"
],
"writers": [
"Jamie Babbit"
,
"Tina Mabry"
,
"Abigail McCarthy"
],
"synopsis": [
"Anna is coming out. But not as gay as a revolutionary. Itty Bitty Titty Committee is a rockin love song to the heady rush of sex, freedom and rebellion that happens when an everyday girl discovers her own strength and the righteous indignation needed to take action and change the world. Our heroine is a shy, just-out-of-high-school lesbian, still living with her parents and working at a plastic surgery clinic. She is depressed because of a recent breakup but lives in a super-loving, gay-is-A-OK kind of family. Her world opens up one night when she catches a one-woman army reclaiming public space for women (i.e., spray painting the clinic where Anna works). A recruiting member of the guerrilla girls-esque Clits in Action (C(i)A), Sadie is trying to make people aware of how bad plastic surgery is for women. With an undeniable attraction to this sexy, raw rebel gurl, Anna eagerly joins the ranks of C(i)A and starts her rollercoaster ride from meek and mousy to bad-ass bravado. Full of mosh pits, power fists and utter charm,"
],
"summaries": [
"High School grad and all American gal, Anna, finds her purpose and herself after she hooks up with the radical feminists in The Itty Bitty Titty Committee."
,
"Anna is a young lesbian high school graduate who still lives with her parents, and works as a receptionist in a plastic surgeon's office. She embarks on a wild ride when she hooks up with a cadre of ultra-radical feminist lesbians hell-bent on raising hell. But things get even more complicated when Anna falls in love with Sadie, the radical group's leader who's already involved with an older woman named Courtney."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "qy_NAIUBmFo8GYv0booy",
"_score": 12.4894085,
"_source": {
"title": "For the Bible Tells Me So",
"year": 2007,
"genders": [
"Documentary"
,
"Romance"
],
"score": 7.8,
"directors": [
"Daniel G. Karslake"
],
"writers": [
"Daniel G. Karslake"
,
"Helen R. Mendoza"
],
"synopsis": [
"The producers of this movie explore ways of discrediting traditional Biblical teachings concerning homosexuality. They uses anecdotes from families who are friendly or at least resigned to the concept of homosexuality and they gather testimony from liberal clergy who discuss the scriptures. These testimonials are typified by a preacher from the Disciples of Christ who stresses that cannot say what the Bible says; we can only say what it reads. Others profess that scriptures which describe homosexuality as an abomination are morally equivalent to dietary restrictions cited in contiguous but not contextual scriptures. Other arguments against scriptural teachings against homosexuality offer some tortured definitions of of words which deviate greatly from common and long accepted definitions. A good example of this involves the narrator's claim that "natural" actually means "customary." This would substantially alter the meaning and the long accepted view of the word in its context. The producers provide scant attention to opposing viewpoints; it is safe to say that any opposing viewpoints are merely token."
],
"summaries": [
"An exploration of the intersection between religion and homosexuality in the U.S. and how the religious right has used its interpretation of the Bible to stigmatize the gay community."
,
"We meet five Christian families, each with a gay or lesbian child. Parents talk about their marriages and church-going, their children's childhood and coming out, their reactions, and changes over time. The stories told by these nine parents and four adult children alternate with talking heads - Protestant and Jewish theologians - and with film clips of fundamentalist preachers and pundits and news clips of people in the street. They discuss scripture and biblical scholarship. A thesis of the film is that much of Christianity's homophobia represents a misreading of scripture, a denial of science, and an embrace of quack psychology. The families call for love."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "zi_NAIUBmFo8GYv0bm8n",
"_score": 12.316904,
"_source": {
"title": "Rachel, Rachel",
"year": 1968,
"genders": [
"Drama"
,
"Romance"
],
"score": 7.1,
"directors": [
"Paul Newman"
],
"writers": [
"Stewart Stern"
,
"Margaret Laurence"
],
"synopsis": [
"Rachel Cameron (Joanne Woodward) is a shy, 35-year-old spinster schoolteacher living with her widowed mother in a small apartment above a funeral home that was once owned by her late father in a small town in Connecticut. Haunted by memories of her unhappy childhood and her mortician father, Rachel spends each frustrating day taking care of her mother and working with the schoolchildren. School is soon let out for summer vacation and Rachel figures it will just be another lonely and boring summer for her. (It's implied that she may even hate summer as her job provided somewhat of an escape from her domineering mother who's always trying to compare her to her sister, who married a successful businessman in Boston.)Rachel's closest friend is Calla Mackie (Estelle Parsons), a fellow unmarried teacher who persuades her to attend a revival meeting, where a visiting preacher, named Reverend Wood, encourages Rachel to express her need for the love of Jesus Christ. Rachel is overwhelmed by God's grace, baring so much pent-up emotion, that she is humbled after the service. While comforting Rachel, Calla suddenly begins to kiss Rachel passionately. (It is never explained if Calla is a lesbian, bisexual, or if she merely reacted to the emotion of the moment.) Rachel's reaction is to withdraw from the friendship for the time being.Note: Brief daydreaming sequences of the adult Rachel also appear, including those showing her imagining seizing a stolen moment with the school's possibly sexual-harassing principal; taking an under-loved boy in her classroom home with her; and rocking an expected baby in a park while children play nearby.Rachel realizes that only by exposing herself to life is the way she can she experience it. She therefore gives herself to a former high school friend, named Nick Kazlik (James Olsen), who is in town for a visit with his parents which she and he sleep together after first meeting. Mistaking her first sexual encounter for love, she fantasizes about a future with Nick. Her hopes are shattered, however, when Nick, put off by her seriousness, abruptly ends their affair.A short time later, Rachel discovers that she may be pregnant. Determined to accept the consequences of her actions, she decides to go away and have the child. After Calla has helped her find a teaching post in Oregon, Rachel learns that her pregnancy is merely a cyst requiring minor surgery. After undergoing surgery to have the cyst removed, she tells her mother, in the hospital, that she has decided to relocate, and that her mother may accompany her or not, as she wishes. Her mother quickly agrees to go, in a way that suggests she realizes her dependence on Rachel and perhaps even will take her less for granted from now on. Rachel sets out with hope for the future, having learned that she has choices, that she is able to give and receive sexual pleasure, that it is possible for her to take on life actively, rather than wait for it to find her. In the final scene, as Rachel leaves town with her somewhat reluctant mother and looks for the last time at the familiar sights of her home town, she speculates on what the future may bring."
],
"summaries": [
"Rachel is a lonely school teacher who lives with her mother. When a man from the big city asks her out, she starts thinking about where she wants her life to go."
,
"Thirty-five year old spinster and virgin Rachel Cameron is a sad, lonely woman. She lives in the small town of Japonica, Connecticut where she grew up. She teaches second grade at Japonica Elementary School and lives with her highly demanding widowed mother (her funeral director father passed away fourteen years ago) in the same apartment above a funeral home where she grew up, despite the home now not being owned by them. Rachel often uses her mother as an excuse not to do things. Rachel represses her emotions, and is prone to daydreaming to envision alternate paths for herself in certain situations if she only had the nerve to do those things. Even when Nick Kazlik, a childhood acquaintance who has returned to Japonica for a summer visit with his family, makes it clear that he wants to have fun with her while he's in town, she can't act on his request out of fear of the unknown. But after a couple of incidents with her only real friend Calla Mackie, who is a fellow teacher at the school, Rachel begins to allow herself more freedom. But as Rachel's repressions slowly melt away, how her emotions will manifest themselves becomes the question."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "mi_NAIUBmFo8GYv0bm8n",
"_score": 12.245798,
"_source": {
"title": "Les Biches",
"year": 1968,
"genders": [
"Drama"
],
"score": 6.9,
"directors": [
"Claude Chabrol"
],
"writers": [
"Paul Gégauff"
,
"Claude Chabrol"
],
"synopsis": [ ],
"summaries": [
"Architect Paul Thomas insinuates himself into the relationship of two bisexual women living in a St. Tropez villa with tragic consequences."
,
"Frédérique is a rich and beautiful woman who picks up a female street artist called "Why". It is December and they go to her villa in Saint Tropez, which is inhabited by a couple of odd gay men. Both women fall for the local architect Paul Thomas. However Why says that she is not interested in him, so Frédérique invites him to move into the villa."
,
"In Paris, while crossing a bridge over the Seine, the bored bisexual millionaire Frédérique meets a homeless young street painter called 'Why' and invites her to drink tea at her apartment. They have a love affair and Frédérique takes 'Why' to spend the winter at her house in Saint Tropez, where Frédérique's other two friends of hers live. When Frédérique throws a party for a few guests, the handsome architect Paul Thomas hits on Why. She is seduced by Paul and spends the night with him in his place. The next day, the selfish Frédérique visits Paul and seduces him. They travel together to Paris and when they return, Frédérique tells Why that Paul is going to live with them at her house. Why is upset but unsuccessfully tries to seduce Paul. One night, Why proposes they get drunk, expecting to go to their room and have a threesome, but she is unwanted by the couple. When Frédérique and Paul travel to Paris to attend urgent business, Why follows them expecting to stay in Frédérique's apartment."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "dy_NAIUBmFo8GYv0bpY3",
"_score": 12.204645,
"_source": {
"title": "Me Him Her",
"year": 2015,
"genders": [
"Comedy"
,
"Romance"
],
"score": 5.2,
"directors": [
"Max Landis"
],
"writers": [
"Max Landis"
],
"synopsis": [ ],
"summaries": [
"Vicenarian drifter Cory arrives in Los Angeles to help his semi-famous T.V. star friend Brendan take his first steps out of the closet."
,
"Brendan Ehrlick, star of TV's popular cop series "Hard Justice," would like to come out of the closet to his parents. His first step? Come out to his best friend Cory in Florida and solicit his help. Cory already knows he's gay but comes to L.A. anyway, where his actions, rather than help Brendan, put him in awkward, possibly career-threatening situations. As corporate managers advise Brendan to remain uninformative in dealing with paparazzi, Cory ventures off into a one-night-stand with Emily, a lesbian on the rebound from a toxic relationship. He falls for her, but being with him confuses her life-long lesbian identity. Her struggles with this prompt Cory towards suddenly becoming a better friend to Brendan, leading to an immediate abduction followed by a violent, sword-wielding confrontation at the "Hard Justice" cast party."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "VS_NAIUBmFo8GYv0bngs",
"_score": 12.193323,
"_source": {
"title": "Internal Affairs",
"year": 1990,
"genders": [
"Crime"
,
"Drama"
,
"Thriller"
],
"score": 6.5,
"directors": [
"Mike Figgis"
],
"writers": [
"Henry Bean"
],
"synopsis": [
"Ambitious LA cop with Latin temper moves to Internal Affairs department where he's paired up with lesbian superior. Immediately involved in police brutality case, his pursuit of the young police officer leads him to cross swords with an amoral, possibly sociopathic police sergeant who controls a seemingly department wide network of corruption. Physical and pychological battle between them involving violence, murder and some, occasionally rough, sex ends in triumph for the good guys as usual but with some thought provoking character exploration along the way as the film develops. Sympathethic treatment of the gay female IA officer ahead of its time."
],
"summaries": [
"An Internal Affairs agent becomes obsessed with bringing down a cop who has managed to maintain a spotless reputation despite being involved in a web of corruption."
,
"Keen young Raymond Avila joins the Internal Affairs Department of the Los Angeles police. He and partner Amy Wallace are soon looking closely at the activities of cop Dennis Peck whose financial holdings start to suggest something shady. Indeed Peck is involved in any number of dubious or downright criminal activities. He is also devious, a womaniser, and a clever manipulator, and he starts to turn his attention on Avila."
,
"Earnest Raymond Avilla has just begun his assignment in the LAPD's Internal Affairs Division (IAD) partnered with capable and bright Amy Wallace, the IAD arguably the most hated division by the non-IAD officers in its members being seen as opportunistic in getting ahead in the force investigating their "brothers". To show that he is above board, Raymond agrees as his and Amy's first case as partners that of Van Stretch, Raymond wanting to seem impartial despite he and Van going back to their days together in the academy. Although there does seem to be improper conduct by Van, Raymond begins to believe a bigger, more dangerous fish is Van's partner Dennis Peck, who outwardly is seen as the model officer by the force's highers-up. What Raymond sees in Dennis is a bright officer too content in his relatively low position within the force, he who is able to live beyond his means, especially in having to pay alimony and child support to several ex-wives. In reality, Dennis is not only a womanizer and chronic philanderer in still fooling around with other women despite again being married, but is a master manipulator in working every situation to his benefit and often illegal end goals, that manipulation often of crime scenes and of his fellow officers, including Van and by association Van's occasionally battered wife, Penny Stretch. What ensues is a game of cat and mouse between Raymond and Dennis which becomes personal in both sides using the other's family - Dennis' wife Heather Peck and Raymond's contemporary art gallery curator wife Kathleen Avilla - to achieve their respective end goals, which may be more dangerous for Raymond and Kathleen as Dennis has and will kill to protect his way of life."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Ni_NAIUBmFo8GYv0bnUr",
"_score": 11.20455,
"_source": {
"title": "The Lonely Lady",
"year": 1983,
"genders": [
"Drama"
],
"score": 3.1,
"directors": [
"Peter Sasdy"
],
"writers": [
"Harold Robbins"
,
"Ellen Shepard"
,
"John Kershaw"
],
"synopsis": [
"Jerilee Randall enters the Awards Presentation Ceremony alone, unrecognized by the media and the crowd gathered outside.Several years earlier, as a student at Valley High School, 18-year-old Jerilee received an award, presented by film director Guy Jackson, for her outstanding achievements in creative writing. In an acceptance speech, Jerilee states that in each of her stories, at least one character must be "concerned with some important issue that people are afraid to talk about." Afterward, Jerilee attends a party where she meets Walt Thornton, Jnr., the son of renowned screenwriter, Walter Thornton. He invites Jerilee to meet his famous father, and during the drive, Walt's friends Joe and Mary attempt to draw her into their amorous activities in the back seat. Shortly after arriving, Joe knocks Walt unconscious and rapes Jerilee with the nozzle of a garden hose before the elder Walter comes to her rescue.A few days later, Walter visits Jerilee to return the award statuette she left in his home. They bond over their shared passion for writing, and over time, their mutual admiration turns to love. Although Jerilee's widowed mother, Veronica, disapproves of her daughter's romance with an older man, she does not interfere with the couple's plans to marry. Later, Walter's agent tries to discourage Jerilee's aspirations, saying, "women can't write," and advises her to earn a living from her beauty rather than her mind. Jerilee proves him wrong by writing a critically-acclaimed book of short stories.When an unemployed actress begs Walter for a part in his next picture, he uses the incident to show his wife that many in the entertainment industry have lost their self-respect. Regardless, Jerilee is anxious to learn screenwriting and becomes Walter's assistant on his latest film. On the set, she reconnects with director Guy Jackson, who complains about the length of a key speech in Walter's screenplay, to be delivered during a child's funeral. Jerilee replaces the entire speech with the word, "why," which pleases the director. Walter is angered by his wife's audacity, but accepts credit for the rewrite.After the film has become a commercial and critical success, Jerilee is angered by Walter's refusal to acknowledge her contribution during a lunch with friends and associates. He admits to his loss of self-respect and leaves. Upon returning home, Jerilynn tries to reason with her husband, but he becomes verbally abusive and makes a cruel reference to the garden hose that she enjoyed being raped by it.Sometime later, Guy visits Jerilee in her modest apartment. She has left Walter, written another book, and wants to write a screenplay about two people whose deep love cannot surmount their lack of compatibility. Guy takes her to a party, where she encounters rising star George Ballantine, and they begin a torrid affair, despite the fact that he is married. George rejects Jerilee when he learns that she is pregnant with his child, and she has an abortion.While at a restaurant with Veronica, Jerilee meets nightclub owner Vincent Dacosta and his business partner, Nick Rossi, who are in search of screenplays for their new film production company. When Jerilee offers her screenplay, Dacosta is interested, but later admits that he and Nick will need more than six months to raise the necessary funds. Aware of Jerilee's dire financial situation, he offers her a job at his nightclub. Their business relationship develops into a stormy love affair, as Dacosta reveals his volatile personality and penchant for cocaine.Jerilee has a nervous breakdown after Dacosta allows her to be molested by lesbian Italian actress Carla Maria Peroni, and she is committed to a mental hospital. Guy's regular visits to the hospital, along with his love and encouragement, speed Jerilee's recovery. Her harrowing experiences inspire her to write a new screenplay, titled "The Hold-Outs," which Guy takes to his agent. Jerilee is offered the opportunity to sell her screenplay to producer Tom Castel, providing George Ballantine is given a starring role. She refuses at first, but Guy convinces her, saying, "It's the movie that matters." Jerilee meets with Castel at his home, where the producer leaves the decision to his bisexual wife, Joanne, who insists that Jerilee join her in the hot tub.Months later, the events come full circle at the Presentation Ceremony, where Jerilee wins the award for best original screenplay. During her acceptance speech, she admits that she, like so many women in Hollywood, had to trade sex for a career, and describes how she was exploited by her colleagues whom she describes by name. Jerilee places her award statuette on the podium and refuses to accept it. She leaves the ceremony in tears, ignoring the taunts of outraged audience members."
],
"summaries": [
"Hoping to achieve success in Hollywood, a young aspiring screenwriter allows others to exploit her. She goes through affair after sordid affair in her attempt to write her own screenplay and have it produced."
,
"Jerilee Randall, a simple schoolgirl living in the San Fernando Valley, dreams of becoming a famous screenwriter. She meets the son of a famous screenwriter at a party and accepts his invitation to come to his house. They drive away with some other people, and that night one of his friends assaults her with a garden hose. The attack is interrupted--just in time--by screenwriter Walter Thornton. Jerilee and Walter become friends, then fall in love and marry. Their marriage falls apart when Jerilee's script rewrites actually improve one of Walter's screenplays and he feels one-upped. Jerilee then tries to write her own screenplay and have it produced, which ends up involving her in endless sordid affairs."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "ZS_NAIUBmFo8GYv0bnwu",
"_score": 11.144213,
"_source": {
"title": "Chasing Amy",
"year": 1997,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 7.2,
"directors": [
"Kevin Smith"
],
"writers": [
"Kevin Smith"
],
"synopsis": [
"Holden McNeil (Ben Affleck) and Banky Edwards (Jason Lee) are comic book artists and lifelong friends. Holden is the calmer, more reasonable of the duo; Banky, meanwhile, is the caustic and short-tempered half. The story opens at a comic book convention in New York City where the two are promoting their latest comic series 'Bluntman and Chronic'. After Holden breaks up a fight between Banky and an antagonistic fan, they attend a panel discussion where they meet Alyssa Jones (Joey Lauren Adams). She is a struggling comic book writer whom is friends with the African-American comic book writer and activist Hooper (Dwight Ewell) who puts on this militant image to hide his flamboyantly gay personality.That evening, the four go out for drinks together at a local bar where Holden is attracted to Alyssa based on their conversation during a dart game. Through Hooper she invites Holden to a get together at a bar she frequents. Banks comes along and while there Alyssa is asked to sing a song. During the song Banky notices that they are in a female gay bar and that Alyssa is singing the love song to a woman in the audience and not to Holden who thinks the song is for him. The four of them end up at a booth and Alyssa and Banky have an involved conversation about sex with women while Holden broods, visibly upset about Alyssa being a lesbian. However, they have discovered they are both from the same area of New Jersey and the two begin hanging out, and a deep friendship develops. During their discussions it is clear that Holden has a very narrow heterosexual view on male female relationships and sex in general. The new friendship does not sit well with the homophobic Banky, who dislikes and distrusts Alyssa and is bothered by the relationship that develops between her and Holden. Holden and Banky's business relationship suffers as well -- the two had been on the verge of signing a lucrative deal to turn Bluntman and Chronic into television show and Banky feels that Holden is no longer taking their combined efforts or the TV show seriously.Eventually, Holden is no longer able to contain his feelings, and confesses his love to Alyssa. She is initially angry with him and walks away. Holden follows her and they have a heated discussion about their relationship and she walks away again. Holden is confused and while returning to his vehicle Alyssa runs up, they embrace and that night the two begin a romantic relationship. Banky walks in the next morning and finds them together sleeping on his couch in the studio. This new development worsens the tension between Holden and Banky who distrusts Alyssa and that his friend is going to be hurt when the relationship fails. Banky runs across an old friend who grew up with Alyssa who tells him a sexual adventure story from Alyssa's past. Banky reports to Holden that Alyssa participated in a threesome with two guys during high school, which earned her the nickname "Finger Cuffs" for getting it from both ends. Holden is deeply disturbed by this revelation, having believed based on their conversations about love and sex that he is the first man Alyssa had ever slept with.Holden asks advice from Hooper who tells him that if he wants his relationship with Alyssa to work, he must be honest and truthful and ask Alyssa about her past. Hooper also tells Holden he believes the issue with Banky is that Banky is jealous and in love with him and that his macho sexual banter is a disguise for his true feelings.The following evening, Holden confronts Alyssa while attending a hockey game and he clumsily attempts baiting her into confessing, which she eventually does, prompting her to storm out of the arena. During a tearful argument in the parking lot, she tells Holden about her youthful sexual experimentation involving men. She apologizes for letting him believe that he was the only man she had been with but justifies it by saying she could see that he took pleasure in the thought. However, she refuses to apologize for her past and Holden leaves feeling angry and confused.Later, during lunch at a local diner with the local stoners and drug dealers Jay and Silent Bob (Jason Mewes and Kevin Smith), who were the inspiration for the Bluntman and Chronic comic book characters, Holden gives them their monthly residual pay for sales of the comic book. Here he confides in them about his troubled feelings and relationship with Alyssa. Speaking more than one line for the first time, Silent Bob mentions chasing Amy and reveals that he was once in a relationship "a couple of years ago" which was similar to Holden's. Despite the fact that he was in love with his girlfriend, Amy, his insecurities about her adventurous sexual past caused him to sabotage the relationship and leave her. Angry at himself for letting her go, he has "spent every day since then chasing Amy".Inspired by Silent Bob's story, Holden devises a plan to fix both his relationship with Alyssa and his fractured friendship with Banky. He invites them both over and tells Alyssa that he would like to get over her past and remain her boyfriend. He also tells Banky that he realizes that Banky is in love with him... kissing him passionately to prove the point. Holden suggests that the three of them should have sex with each other in a threesome so he will no longer be envious of Alyssa's broader experiences and it will resolve Banky's issues with them as a couple. Banky reluctantly agrees to participate. Alyssa is appalled and refuses, at which Banky expresses his relief. Alyssa tries to explain to Holden why his plan is so wrong. Before leaving, she states that she will always love him but her past is in the past and she will not be his whore and slaps him across his face. Banky then leaves without saying a word.One year later, the story has Banky busy promoting his own new comic book at a convention in New York. It is revealed that Holden has dissolved their partnership over Bluntman and Chronic, leaving the viewer with the assumption that he sold the publishing and creative rights over to Banky (which is corroborated in the beginning of 'Jay and Silent Bob Strike Back'). Banky looks over and sees Holden at a distance, who silently congratulates him for his success on the new book. Banky gestures over to a booth hosted by Alyssa who is promoting her own comic, and provides wordless encouragement with a hand gesture implying a coming together to Holden to go talk to her. Holden has a brief poignant conversation with Alyssa, and gives her a copy of 'Chasing Amy', his new comic based on their failed relationship. Holden asks her to contact him. After Holden leaves, Alyssa's girlfriend (Virginia Smith) comes back to the booth and asks who that was. Alyssa feigns indifference,casually tosses his comic on the floor behind her and replies, "Oh, just some guy I knew." She then turns to sign the next fan's material."
],
"summaries": [
"Holden and Banky are comic book artists. Everything's going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's a lesbian."
,
"A pair of comic book authors named Holden McNeil and Banky Edwards, who live in New Jersey, have been best friends for 20 years. They spend their time working in their studio, and in the evenings they are going out. But their friendship is about to be disputed for the first time in their life, when a beautiful young lesbian woman named Alyssa Jones enters their life and Holden falls in love with her. Now Holden has to deal with Banky's jealousy, and with his new girlfriend's very rich past."
,
"Holden and Banky are two average guys who just need someone to bring out their hidden secrets. Enter Alyssa Jones and Hooper LaMont, two homosexuals who are slightly more experienced than the former two. Together, Hooper and Alyssa show Holden and Banky that being gay isn't as bad as they might think. Meanwhile, Holden develops an 'untainted' love for Alyssa, one which she finally sees in him as well, taking Holden on a journey through the complexities of love in the 90s."
,
"Holden and Banky are best friends and authors of a popular comic book called "Bluntman and Chronic". Holden falls in love with Alyssa, also a comic book artist, who happens to be a lesbian. Holden's new relationship with Alyssa strains his life-long friendship with Banky, and soon the relationship between Holden and Alyssa hits a wall due to Holden not being able to deal with her past."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "gC_NAIUBmFo8GYv0bpA1",
"_score": 10.511123,
"_source": {
"title": "Mutantes: Punk Porn Feminism",
"year": 2009,
"genders": [
"Documentary"
],
"score": 6.3,
"directors": [
"Virginie Despentes"
],
"writers": [
"Norma Jean Almodovar"
,
"Maria Beatty"
,
"Lynn Breedlove"
],
"synopsis": [ ],
"summaries": [
"Mutantes sheds light on a feminism that was little talked about in France. This documentary comprises of a series of interviews conducted in the USA, Paris and Barcelona, and documents from the archives about the political action of sex workers, queer activists and post-pornographic performances."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "kC_NAIUBmFo8GYv0bogy",
"_score": 10.222271,
"_source": {
"title": "Out at the Wedding",
"year": 2007,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 6.1,
"directors": [
"Lee Friedlander"
],
"writers": [
"Paula Goldberg"
],
"synopsis": [ ],
"summaries": [
"Ever have an identity crisis? Tell a little white lie here and there, just to make everyone happy? Well, Alex Houston has got you beat, hands down. After telling her fiancé, Dana, that her entire family is dead, Manhattanite Alex whisks off to her childhood home in South Carolina to serve as bridesmaid at her high-maintenance, estranged sister Jeannie's wedding. As she tries not to steal Jeannie's thunder by telling her family that a) she's engaged, and b) the man she's going to marry is a Jewish African American, things get a little mixed up. For starters, Alex's sharp-tongued, mischievous best friend Jonathan unwittingly starts a rumor at the wedding that Alex is gay and Dana is a woman. When her family reacts in a surprisingly supportive way, Alex decides to go with it. It's easier than telling the truth, right? But when Alex and Jonathan decide to hire sexy lesbian Risa to act as her lover when Jeannie comes to visit Alex in New York, things really start to get out of hand. Director Lee Friedlander follows up her award-winning 2004 film "Girl Play" with this witty, farcical romp that explores the sometimes comically bumbling way in which we come out to the people we love - whether we're gay or straight. As she becomes increasingly entangled in her web of lies, Alex struggles to come to terms with her fiancé, her family and most of all herself along the way."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "FS_NAIUBmFo8GYv0bpI1",
"_score": 10.172838,
"_source": {
"title": "Paul Goodman Changed My Life",
"year": 2011,
"genders": [
"Documentary"
,
"Biography"
,
"Drama"
],
"score": 6.6,
"directors": [
"Jonathan Lee"
],
"writers": [
"Paul Goodman"
],
"synopsis": [ ],
"summaries": [
"Paul Goodman, whose best-selling 'Growing Up Absurd' made him the philosopher of the New Left in the 1960s, was also a brilliant poet, out queer (and family man) in the 1940s, radical pacifist and visionary. His ideas and stubborn integrity helped many find a moral compass in the '60's -- and can do so again today."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "dC_NAIUBmFo8GYv0bn0u",
"_score": 10.151806,
"_source": {
"title": "The Kiss of Her Flesh",
"year": 1968,
"genders": [
"Horror"
,
"Thriller"
],
"score": 5,
"directors": [
"Michael Findlay"
],
"writers": [
"Michael Findlay"
,
"Roberta Findlay"
],
"synopsis": [ ],
"summaries": [
"A weapons expert who murdered his unfaithful stripper wife and her lover goes on a killing spree, bumping off exotic dancers and hookers, while plotting the demise of his wife's swinging bisexual sister and her kinky boyfriend."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "fy_NAIUBmFo8GYv0bosz",
"_score": 10.075182,
"_source": {
"title": "Vampire Killers",
"year": 2009,
"genders": [
"Action"
,
"Comedy"
,
"Fantasy"
],
"score": 5.1,
"directors": [
"Phil Claydon"
],
"writers": [
"Stewart Williams"
,
"Paul Hupfield"
],
"synopsis": [
"Jimmy (Mathew Horne) and Fletch (James Corden) are two friends living in London experiencing life problems. Jimmy is dumped by his girlfriend and Fletch is fired from his job as a clown. They decide to escape their woes and hike to a remote village in Norfolk they find on an old map. As they arrive at a pub in the village, with Jimmy upset about Fletch destroying his phone, they see a number of attractive foreign female history students leaving.Hoping to find more beautiful women inside, they are greeted by a morose crowd of men and approached by a seemingly crazed vicar (Paul McGann) who believes Jimmy is a long lost descendant of a local vampire slayer. As the barman offers the two men free ale as an apology for the vicar, they learn the students they saw earlier are going to a cottage - where they are to stay the night. Jimmy and Fletch pursue the students' bus, catching up to it as the engine has broken down, and are introduced to four girls (Heidi, Lotte, Anke and Trudi). They are invited to join a party on the bus.The group arrives at their destination, only to learn that a curse rests over the village and that every female child turns into a lesbian vampire on her eighteenth birthday. There is an old legend stating that the Vampire Queen, Carmilla, descended on the village, killed its menfolk and seduced its women to her evil. When the ruler of the land, Baron Wolfgang Mclaren (Jimmy's great ancestor) returned from the Crusades, he discovered one of the women corrupted by Carmilla was his wife, Eva. The baron forged a sacred sword, then defeated Carmilla, but before dying, Carmilla cursed the village, adding that when the blood of the last of Mclaren's bloodline mixed with a virgin girl's blood, Carmilla would be resurrected.Fletch and Jimmy spend the night with the women. Heidi, Anke and Trudi are turned into vampires. After Lotte insists that the others try to find her missing friends, they witness Trudi being turned. Eva, Carmilla's mistress, tries to draw Lotte to her growing clan of lesbian vampires. The trio runs back into the cottage after killing vampires Heidi and Anke and barricade themselves in after the vampires destroy the bus. Jimmy's ex-girlfriend Judi arrives at the door and Jimmy, not ready to give up on the relationship, takes her into the bedroom. Lotte reveals to Fletch that she is a virgin and wants to sleep with Jimmy.At the church, the Vicar researches the vampire slayer who killed Carmilla before arming himself and setting off to find Jimmy. Judi reveals herself to be a vampire, and after a struggle, Fletch and Jimmy kill her. The vampires approach the cottage and Jimmy inadvertently invites them in. Eva discovers that Jimmy is the descendant of the baron who killed Carmilla and that Lotte is a virgin and kidnaps them.The Vicar saves Fletch from Trudi and tells Fletch the truth about the village and Jimmy's identity. They go after Jimmy and Lotte in the Vicar's crucifix-covered car. As the vampires prepare to sacrifice Lotte and Jimmy, Fletch and the Vicar try to recover the sword of Daeldo, the sword that killed Carmilla, from the baron's tomb. While Fletch works to open the tomb, the Vicar checks on his daughter Rebecca, but does not notice that she has been turned. Rebecca attempts to seduce Fletch, who does not know what she is. When she attacks him, she is inadvertently impaled on the sword. Fletch decides not to tell the Vicar of his daughter's death.At Carmilla's tomb, Lotte reveals her love for Jimmy. The vampires begin draining the two of their blood to resurrect Carmilla. With the sword, Fletch and the Vicar drive to Carmilla's tomb. When they enter the woods, they bring various weapons, but forget the sword. Despite not having the sword, the pair reach Jimmy and Lotte. The Vicar releases them, but not before enough blood gathers to resurrect Carmilla. The Vicar sacrifices himself so the others can get back to the car and the sword. Eva separates Lotte from the men, attacking and seducing her. Lotte fights back while Fletch and Jimmy fetch weapons. Lotte kills Eva with her cross necklace, infuriating Carmilla. Fletch tries to kill Carmilla before Lotte is turned, but is captured himself. Jimmy saves them by hurling the sword at Carmilla, piercing her heart and destroying her for good. With the curse lifted, the three survivors decide to continue ridding the world of evil.The film ends with the shot of a "Gay Werewolf" howling before the full moon."
],
"summaries": [
"Their women having been enslaved by the local pack of lesbian vampires thanks to an ancient curse, the remaining menfolk of a rural town send two hapless young lads out onto the moors as a sacrifice."
,
"Centuries ago, Baron Wolfgang MacLaren vanquished the Vampire Queen Carmilla in the remote Cragwich; however, before decapitating the evil vampire, she curses the locals and descendants of the baron, swearing that every woman would turn into a lesbian vampire on her 18th birthday. In the present day, clumsy, naive cuckold Jimmy is dumped again by his girlfriend Judy and misses her. His best friend Fletch is fired in his job of clown after hitting an annoying boy. The two broken friends decide to camp in the countryside to forget their problems, and Jimmy throws a dart at a map in a pub to decide where they should go. They head to Cragwich, and when they arrive in the Baron's Rest bar, they see four hot girls leaving the place in a Kombi. The innkeeper offers the guys the old Mircalla cottage in the woods, the same place the girls will lodge. Meanwhile, Lotte, Heide, Anke, and Trudi have trouble with their van, and when Jimmy and Fletch reach them in the forest, the girls offer the guys a ride to their cottage. They introduce themselves as students of folklore who they are researching the Vampire Queen Carmilla. When Fletch believes that he will have a night of beer and sex with three sexy girls and Jimmy and Lotte have a crush on each other, the cottage is surrounded by a group of lesbian vampires that vampires intend to use Jimmy and Lotte's blood to bring Carmilla back to life. They are abducted by the vampires, but Fletch escapes and meets Reverend Vicar, who tells him that Jimmy is a descendant of the baron and the only hope to stop the evil curse of Cragwich."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "by_NAIUBmFo8GYv0bngs",
"_score": 10.04578,
"_source": {
"title": "Paris Is Burning",
"year": 1990,
"genders": [
"Documentary"
,
"Drama"
,
"Romance"
],
"score": 8.1,
"directors": [
"Jennie Livingston"
],
"writers": [
"Brooke Xtravaganza"
,
"André Christian"
,
"Dorian Corey"
],
"synopsis": [ ],
"summaries": [
"A chronicle of New York's drag scene in the 1980s, focusing on balls, voguing and the ambitions and dreams of those who gave the era its warmth and vitality."
,
"A documentary of New York's LGBT scene in the 1980s, showing the real life of poor Black and Latin LGBT people, introduce the ballrooms, the categories, the houses, the voguing, and the dreams and ambitions of these people who are systematically excluded from society, they fight to conquer the right to be and to reinvent themselves in a world starring straight and white people. They use the balls to show their creativity, have fun with their community and family, shining, and having their names recognized in the ballroom scene."
,
"This is a documentary of 'drag nights' among New York's underclass. Queens are interviewed and observed preparing for and competing in many 'balls'. The people, the clothes, and the whole environment are outlandish."
,
"An unblinking behind-the-scenes story of fashion-obsessed New Yorkers who created "voguing" and drag balls, and turned these raucous celebrations into a powerful expression pf personal pride. The world-within-a-world is instantly familiar, filled with ambitions, desires, and yearnings that reflect America itself. PARIS IS BURNING is an intimate portrait of one urban community, a world in which the allure of high fashion, status, and wealth becomes an affirmation of love, acceptance, and joy."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "jS_NAIUBmFo8GYv0bpE1",
"_score": 10.042728,
"_source": {
"title": "We Are the Night",
"year": 2010,
"genders": [
"Drama"
,
"Fantasy"
,
"Horror"
],
"score": 6.2,
"directors": [
"Dennis Gansel"
],
"writers": [
"Jan Berger"
,
"Dennis Gansel"
],
"synopsis": [
"The film opens with several images of three young women. The images date further and further back until ending in the late 18th century.In a private airplane, the people and the pilots are dead. The only survivors, three young women, are the obvious killers. The leader of these women finds an air-hostess (Cristina do Rego) still alive. After examining her eyes, she breaks her neck and the women jump out of the plane, allowing it to crash into Berlin, Germany.The next day, somewhere in Berlin, a young 18-year-old drug addict and petty criminal, Lena (Karoline Herfurth), lurks near an ATM cash dispenser. Just as her victim has used the machine she pickpockets his credit card only for the victim to be arrested by the police. A police officer, Tom (Max Riemelt), chases after her and eventually catches up with her on a bridge. After a short conversation, he tries to arrest her but Lena hits him in the face, kicks him between the legs and jumps off the bridge onto a passing boat. Lena returns to her home, a large high-rise apartment block where she lives with her drug-addicted, alcoholic mother (Steffi Kühnert) who is flirting with her parole officer.Later that evening, Lena goes to a nightclub. Everyone in line for the club is being examined with a hidden camera by one of the women from the beginning, Louise (Nina Hoss). Upon seeing Lena, she orders the guard to let her in. Inside the club, Louise dances with Lena and offers her a drink. She asks where Lena's friends are, but Lena replies she does not have any. When Lena goes to the bathroom, Louise follows and bites her on her neck. Freaked out and seeing that Louise casts no reflection in the mirror, the terrified Lena runs home. When she awakes in the morning, the sun burns her, forcing her to stay inside. That night, Lena returns to the club to confront Louise about what has happened. She meets Louise's two companions, the silent brunette Charlotte (Jennifer Ulrich) and the cheerful redhead Nora (Anna Fischer). Although the word is never said in the film, it becomes clear that Louise, Charlotte and Nora are vampires.The girls sell the angry and confused Lena to a Russian pimp (Waléra Kanischtscheff) as a prostitute. Louise plans for Lena to kill the wicked man to ease her transformation. Lena is locked in a room. When the pimp comes in to rape her, she is overwhelmed by vampiric blood lust and attacks the pimp. In the struggle, she stabs him with a broken light bulb and tries to escape but another pimp shoots her with a shotgun. The three other vampire girls return to kill the pimps before setting them ablaze. They fail to notice one mobster hiding in fear. Before leaving, Nora steals one of the mobster's Lamborghini.When Lena awakes at the hotel, Louise gives her a glass of what appears to be blood. As Lena drinks, she feels her strength return. Louise takes care of Lena, removing her dirty and torn clothes and showing her to a bathroom where a bath is waiting. Louise tells Lena the story of how she was changed 280 years ago at a masked ball. At first she hated her maker (a woman), but grew to love her after traveling throughout Europe and getting to know all the benefits of vampire life. After her maker was burned (killed by sunlight), Louise wanted to commit suicide to join her, but instead began searching for a new companion. Louise then settled with and turned Charlotte and Nora as her two new companions/lovers. Louise then walks out and closes the bathroom door at Lena's request for privacy. As Lena bathes, her short hair grows and returns to its natural color, her ear and nose piercings fall out and she loses all scars, bruises and wounds (including a tattoo on her belly).Now fully embracing her new life as a vampire (mostly due to finally leaving her life of poverty behind her), Lena spends the night shopping, partying and having fun with her three new vampire girlfriends who give her the stolen Lamborghini as a gift. As they party, Lena notices that Charlotte longingly staring at a pair of baby shoes. Charlotte also exhibits several signs of depression and engages in acts of self-harm, among other things burning her own eyeball (which immediately heals).During a dinner at a local restaurant, (the vampires can eat and taste food, but it does not satisfy them), Louise tells Lena that there are no male vampires currently in existence, because as the male vampires grew arrogant, the females grew tired of their superiority and killed all of them with the common promise to never turn a man into a vampire. Nora also reveals to Lena that she first met Louise at a Gay Pride Love Parade of 1997 where, after a one-night stand, Louise bit and turned her. As the night comes to an end, the four lady vampires return to their hotel to perform their morning ritual: allowing the first rays of sun burn their skin but retreating inside before any lasting harm can be done. Charlotte stays outside longer than the others, but retreats before catching fire. As they settle into their individual coffins for the day, Louise deeply and passionately kisses Lena, which startles and confuses Lena who bites Louise's lip in response. Louise interrupts herself and goes to her own coffin, where she begins cursing her hastiness.Meanwhile, Tom uses a file on Lena to find her home address. The next night, Lena returns home to visit her mother who has not even noticed her absence. As Lena leaves after saying goodbye to her mother, Tom sees her, but almost does not recognize her due to her different color hairstyle and new fancy clothing. He tells Lena that she could go to prison for violating her 18-month probation for auto theft if he arrested her for stealing the credit card, but says he won't because her victim (Wasja) used women. The two have coffee and talk, but when Lena suddenly sees Louise approaching, she uses her Lamborghini to retreat to the vampire's nightclub.At the club, Lena finds Charlotte in a private room where Charlotte (finally speaking for the first time) tells Lena that she was a silent movie actress in the 1920s and that she had a husband and daughter. However, Charlotte was ashamed at herself for she was a closeted lesbian in denial of her sexuality until she first met Louise who turned and encouraged Charlotte to abandon her family to settle with her new life. Louise enters the room and asks Lena why she is acting different. Lena lies that she misses the sun, so Louise takes the girls to an indoor swimming pool area called Tropical Islands Resort that has artificial sunlight allowing them to have a pool party "in the sun". Two night watchmen (Christian Näth and Tom Jahn) find the girls and ask how they managed to get inside. Nora convinces the men to join them in the pool where she quickly kills off one of them, but as water slows the vampires down, the other tries to escape. Charlotte kills this man in a sadistic manner, slicing his throat with a piece of paper which causes him to die slowly and painfully. Lena flees the scene in terror.Meanwhile, Tom and his partner, Lummer (Arved Birnbaum), interrogate the surviving Russian mobster van Gough (Ivan Shvedoff) who says that "the devil" killed his friends and stole his Lamborghini. As van Gogh describes it Tom realizes that the stolen car is the car he saw Lena drive.Nora awakes with a bellboy (Neil Belakhdar) she had flirted with (making it known that Nora is actually bisexual). She tries to wake him, but realizes she killed him when they had sex. Nora breaks down in tears as the other girls come into the room. Louise shows her that the SEK (German SWAT unit) is invading the building. Charlotte says she will stall them while the girls make their escape. The vampires have special cars with tinted windows to protect them from sunlight if they ever had to escape during daylight. Lena and Louise take one car while Nora drives alone. The police, who think the girls are simply dangerous criminals, are slaughtered by Charlotte. Tom enters the room looking for Lena and manages to shoot Charlotte before she attacks him, causing her to fall out the window and to the ground. As the sun starts to burn her skin, Lena and Louise manage to get her inside their car. Nora crashes into a car and is thrown into sunlight. Police open fire at the other car letting in sunlight on the vampires. Unable to save Nora, they drive away as Charlotte looks back at Nora burning to death and screaming in agony. The roof of the car is ripped off by a roadblock and the girls crash into a subway to escape the scourging sunlight.The three remaining vampire girls (Lena, Charlotte and Louise) hide at the abandoned Teufelsberg (The Devil's Mountain) where Louise has kept cash. Louise angrily blames Lena for leading the police to them and for Nora's death. Now wanted by the police, the girls prepare to escape to Moscow to make their new home there. Before leaving, Charlotte demands to see her elderly daughter.At a local retirement home, Charlotte sings a lullaby to her dying daughter whom in her last moments recognizes her mother. With a whole day before their departure flight to Russia, the girls return to their hideout to perform their morning ritual. As the sun rises, Charlotte locks Lena and Louise inside and allows the sun to kill her. Louise screams at Charlotte to open the door as she and Lena break down into tears as they hear Charlotte's dying screams.Lena goes to Tom to say good bye and show him who she really is (She forces him to shoot her and the wound heals in front of his eyes). Lena begins to cry while Tom holds her and they fall asleep. Lummer, who has suspected Tom of having some involvement with the girl since the hotel attack, has the SEK invade the building. Lena almost kills the policemen but is stopped by Tom's plea, leading to their arrest and incarceration.Louise goes to the watchmen while they're in the shower and kills them (director Dennis Gansel plays one of the cops getting killed). After that she asks Lena how she will manage to live with Tom, a human, because he will die in 60 years or less while she will never age and then she'll be alone. Louise kidnaps Tom, and Lena follows her. The sun is rising when they meet and Louise finally says to Lena, "I love you". Lena (who is really straight) tells Louise that she loves her back. Louise says that that's the most beautiful lie she's ever heard and shoots Tom. Louise and Lena have a fight and Lena throws Louise out a window into the sunlight, where she dies with a peaceful smile on her face. Lena runs to the wounded Tom and wants to bite him to make him a vampire like her so they can live together forever, but stops, kisses him and begins to cry.In the final scene, the SEK troops arrive with Lummer. Lena and Tom are both gone with no trace other than Louise's gun. Lummer looks outside and sees something the other policemen and the audience don't. Lummer whispers "good luck" and walks away from the scene."
],
"summaries": [
"In Berlin, a cop closes in on an all-female vampire trio who just took in a new member, Lena."
,
"The vampires Louise, Charlotte and Nora arrive in Berlin after attacking the passengers and crew of an airplane in a flight to Paris. The leader Louise has been looking for centuries for her missed love and Charlotte misses her daughter that she saw in 1923 for the last time. Meanwhile, the smalltime pickpocket Lena steals a Russian mobster and is chased by Detective Tom. When Lena goes to a nightclub, the lesbian Louise believes that Lena is the love of her life and transforms her into a vampire. Lena initially feels lost with the transformation, but sooner she joins the trio of vampires in their nightlife. When the pack of vampires attacks a group of criminals, the police department investigates the case and hunts the women without knowing the risks that they are taking. Meanwhile the lonely Tom and the Lena fall in love with each other; but the unrequited love of Louise for Lena jeopardizes the couple."
,
"18-year old Lena lives an unhappy life in Berlin with an uncaring mother and problems to fit in, constantly shoplifting and stealing. One night while visiting a nightclub, Lena is spotted by the vampire Louise. Lena is turned by Louise and introduced to a new life of wealth, fast cars and parties with Louise and her two fellow vampires Charlotte and Nora. Meanwhile, the young and sympathetic police officer Tom is investigating Lena. While Tom hopes to help Lena, he is unwittingly heading for a crash collision with Louise."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "MS_NAIUBmFo8GYv0boUx",
"_score": 9.861095,
"_source": {
"title": "Saving Face",
"year": 2004,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 7.4,
"directors": [
"Alice Wu"
],
"writers": [
"Alice Wu"
],
"synopsis": [ ],
"summaries": [
"A gay Chinese-American and her traditionalist mother are reluctant to go public with secret loves that clash against cultural expectations."
,
"In Manhattan, the brilliant Chinese-American lesbian surgeon Wil is surprised by the arrival of her forty-eight year old widow mother to her apartment. Ma was banished from Flushing, Queens, when her father discovered that she was pregnant. The presence of Ma affects the personal life of Wil, who is in love with the daughter of her boss at the hospital, the dancer Vivian Shing. Once her grandfather has promised that her mother would only return to Flushing remarried or proving that it was an immaculate conception, Wil tries to find a Chinese bachelor to marry Ma."
,
"A Chinese-American surgeon, living in Manhattan, is shocked when her single mother shows up on her doorstep pregnant. To help her mom save face and avoid the taboo in the Chinese community of an unmarried woman pregnant, the doctor helps her mom find Mr. Right. Cultures clash in this film that explores culture shock."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Ty_NAIUBmFo8GYv0bpQ2",
"_score": 9.573886,
"_source": {
"title": "ThanksKilling 3",
"year": 2012,
"genders": [
"Comedy"
,
"Horror"
,
"Sci-Fi"
],
"score": 2.8,
"directors": [
"Jordan Downey"
],
"writers": [
"Jordan Downey"
,
"Mike Will Downey"
,
"Kevin Stewart"
],
"synopsis": [ ],
"summaries": [
"Fowl-mouthed villain Turkie carves through the likes of a rapping grandma, a mindless puppet, a wig-wearing inventor, a bisexual space worm, and their equally ridiculous friends on his quest to recover the last copy of "ThanksKilling 2"."
,
"In "ThanksKilling 3", the fowl-mouthed villain Turkie is back and hacking his way to find the last copy of "ThanksKilling 2" which has landed in the hands of a group of disturbingly crude puppets. The death toll rises as Turkie carves through the likes of Flowis the rapping grandma, Rhonda the bisexual space worm, Yomi the puppet in search of her mind, and their equally ridiculous friends who all travel through fantastical settings such as the FeatherWorld and Turkey Hell. With the guidance of Uncle Donny (Dan Usaj), the wig-wearing inventor of the PluckMaster 3000, Jefferson (Joe Hartzler), Head of Security at ThanksgivingLand, and a WiseTurkey, the gatekeeper to the FeatherWorld, our collection of raunchy characters hope to fend off the murderous rampage of Turkie, all while trying to help Yomi find her mind."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Ly_NAIUBmFo8GYv0bnot",
"_score": 9.048481,
"_source": {
"title": "Bar Girls",
"year": 1994,
"genders": [
"Drama"
],
"score": 5,
"directors": [
"Marita Giovanni"
],
"writers": [
"Lauran Hoffman"
],
"synopsis": [ ],
"summaries": [
"Loretta is a successful lesbian writer of cartoons with problems in her romantic life with Annie. She is a habitué of a lesbian bar. One day she meets Rachel and they start a new life together. When J.R. starts flirting with Rachel, all the insecurity of Loretta rises in a jealousy situation."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Xi_NAIUBmFo8GYv0bnot",
"_score": 8.8375025,
"_source": {
"title": "Go Fish",
"year": 1994,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 5.7,
"directors": [
"Rose Troche"
],
"writers": [
"Guinevere Turner"
,
"Rose Troche"
],
"synopsis": [ ],
"summaries": [
"A romantic tale about finding a soulmate. The only difference here is that both partners are women...in Chicago's lesbian community."
,
"Max is a trendy, pretty, young lesbian, who is having trouble finding love. A friend sets her up with Ely, whom Max likes, but Ely is frumpy, homely, and older. Nor do they have much in common. Can Max learn to look past the packaging?"
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Hy_NAIUBmFo8GYv0bpo4",
"_score": 8.834512,
"_source": {
"title": "Summertime",
"year": 2015,
"genders": [
"Drama"
,
"Romance"
],
"score": 6.7,
"directors": [
"Catherine Corsini"
],
"writers": [
"Catherine Corsini"
,
"Laurette Polmanss"
],
"synopsis": [
"Delphine Benchiessa (Izïa Higelin) is the only child of French farmers who enjoys working the land with her parents. Though her father Maurice (Jean-Henri Compère) wants her to marry, Delphine is secretly pursuing a relationship with another local girl. When she goes to a rendez-vous with her girlfriend she is informed that her girlfriend intends to marry a local boy, dismissing the relationship between her and Delphine as "not serious". Delphine then runs away to Paris (revealing here that the year is 1971).While walking down the street Delphine encounters a group of women running down the street pinching men's buttocks. When one of them attacks a woman, Delphine helps extract her and learns that her name is Carole (Cécile de France). Carole and the other women belong to a feminist group focused on women's liberation. They encourage Delphine to join and she begins to participate in their protests. When one of the group members learns that her best friend, a gay man, has been committed to a mental institution by his family and is being given electroshock therapy, the rest of the group refuses to help her extract him. Delphine on the other hand successfully argues that they should help to free him, and is part of a group of women, along with Carole, who successfully free him. The night, Delphine suddenly kisses Carole who is surprised and rejects her. The next day Carole tells Delphine that she is not a lesbian, but the two wind up in a passionate embrace and begin an affair. Carole initially believes that it is a one night stand, but quickly develops feelings for Delphine. She tells her boyfriend of the affair and the two struggle to work out their relationship even as Carole continues to see Delphine.Delphine receives a phone call from her mother Monique (Noémie Lvovsky) that her father has had a heart attack. Delphine goes to visit them and realizes that she must stay in order to help run the farm. Taking some of the lessons she has learned in the feminist collective she represents her parents' interest with the farmers. Carole goes to visit her and decides that she cannot live without her. Taking a break from her boyfriend she returns to the countryside but is surprised to learn that she and Delphine must remain discreet and closeted as they are still living with Delphine's mother who does not know her daughter is gay.Over the next several weeks, Carole initially enjoys country life and works the land with Delphine and her mother. However she finds the people confining as they mock her left-wing politics and she finds it frustrating she is unable to openly be with Delphine the way she was in Paris. She also begins to have doubts about Delphine's intentions after Antoine (Kévin Azaïs), a local boy in love with Delphine, tells her that Delphine will never leave the farm and Delphine's mother tells Carole that Antoine intends to marry Delphine. Carole begins fighting with Delphine which results in several people learning Delphine's secret including a local farmer who sees them kissing, and her mother who overhears them arguing.The following morning Delphine's mother walks in on Carole and Delphine in bed. Though she acts like everything is normal with Delphine she tells Carole to leave her home, accusing her of having perverted her daughter before attacking her. Carole tells Delphine she is leaving and Delphine decides to run away to be with Carole. Though they leave on the train together, Delphine finds herself unable to leave. She decides to miss their connecting train to Paris and returns home.Five Years Later; 1976Carole is working at a women's health clinic in Paris and is in a relationship with another woman. She receives a letter from Delphine who writes to tell her that she has finally left her parents' farm and now has one of her own in Southern France. She tells Carole that she regrets not leaving with her five years earlier but she understands that it is impossible to turn back time."
],
"summaries": [
"A young woman moves from the French countryside to Paris and begins a passionate love affair with a feminist leader in this drama set in 1970s France."
,
"There was little chance, in the year 1971, that Carole, a Paris Spanish teacher and feminist militant, would ever meet Delphine, the daughter of a couple of Limousin farmers. But they did meet and not only did they come across each other but they fell passionately in love as well. Unfortunately, Delphine's father fell victim to a stroke, and the young woman had no other choice but to go back home to help her mother run the family farm. Carole, who was so smitten by Delphine, couldn't stand the estrangement and decided to join her lover at the farm. But could feminism and lesbianism easily be transferred to the countryside and its standards of the time...?"
,
"Delphine (Higelin) is a twenty-something farm girl of humble means who moves to the big city of Paris in the turbulent 1970s, searching for her independence. It's not long before she is drawn to dynamic thirty-something Carole (de France), who is actively involved in the emerging feminist movement."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Gy_NAIUBmFo8GYv0bnwt",
"_score": 8.79324,
"_source": {
"title": "She's the One",
"year": 1996,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 6,
"directors": [
"Edward Burns"
],
"writers": [
"Edward Burns"
],
"synopsis": [
"The film tells the story of Irish-Catholic Fitzpatrick brothers, Mickey (Edward Burns) and Francis (Mike McGlone) and the tribulations of love, family and betrayal. Mickey is a New York City blue-collared taxi driver, unhappy over an act of infidelity committed by Heather (Cameron Diaz), his ex-fiancée. Francis is a white-collared Wall Street stock investor, who unknown to his wife, Renee (Jennifer Aniston), is having an affair.During weekends, Mickey and Francis visit their parents who live on Long Island. Their mother is never seen on screen, while they have better time interacting with their father, Frank (John Mahoney), whom is a emotionally bereft conservative man as well as an old-school sexist and a bigot whom takes them out fishing on his motorboat, but refuses to let women on board due to family tradition. Frank always gives Mickey and Francis advice to live out their lives any way they can and to always go for what drives them to succeed.While driving his cab one day, Mickey picks up Hope (Maxine Bahns), a young woman and NYU art student with whom he becomes infatuated and impulsively marries that same week despite knowing her only a few days. Mickey and Hope show up one evening at Francis and Renee's apartment to inform them of their quickie marriage. This causes consternation for his brother, largely because he was not asked to be best man at the wedding. Mickey moves in with Hope, but later becomes disillusioned with aspects of her liberal and free-spirited lifestyle, including frequent power cuts in their ramshackle apartment.Francis is also having problems in his marriage. He is concerned that he is being unfair to Heather, his mistress, the very same woman Mickey left, by continuing to stay with Renee. At the same time, Renee's family, especially her younger sister Molly (Amanda Peet) suggests the problem with Francis' lack if interest in her is that he may be gay, so she has Mickey and his father confront him about it. He denies being gay, but admits to being unfaithful.Meanwhile, Francis' arrogance leads him to take potshots at his brother for the apparent lack of forward progression in his life with his new wife, while Francis argues with Heather about her own sexual infidelity with a much older man referred to as "Papa".One day, Mickey picks up Heather in his cab and goes up to her apartment to retrieve a television that belonged to him during their relationship. Heather responds by demanding Mickey's watch, which she purchased as a gift. Mickey relents, which she implies she wants more from him, but he does not reciprocate, instead reminds her of her affair, and her previous profession. Throughout all this, Mickey and Francis' father offers more egoistical and selfish advice to them. Then Frank learns, during a fishing trip with the church's pastor, that his supposedly highly religious wife hasn't been to Church Mass in months.On a visit to his mistress's apartment, Francis learns that Mickey and Heather have recently met. Francis makes an unexpected visit to his brother's apartment and questions Mickey about his visit with Heather. They get into an argument over whether or not Mickey had sex with Heather. Later, Mickey discovers that she is the woman Francis has been having an affair with. The revelation escalates to an argument in their parents' home, during a birthday dinner for their father. In an attempt to settle the dispute, Frank takes both Francis and Mickey outside and ties boxing gloves on each, with the intent of having them fight out their differences. Mickey proves the victor.Eventually, Francis confronts Renee about his affair and files for divorce, in order to marry Heather. When Mickey finds out about the impending marriage, he informs Francis that Heather was once a prostitute during her college days. This causes Francis to get cold feet and it angers Heather. She tells Mickey that she thought that he didn't have a problem with her prior choice of employment, and Mickey says that he doesn't, but Francis may, and that he has a right to know.Meanwhile, Hope has already dropped a bomb on Mickey: she is moving to Paris very soon to attend art school and Mickey is not sure about whether or not to join her. On a visit to the bar where Hope works, Mickey has a talk with Connie (Leslie Mann), one of Hope's co-workers, who claims to have had a "special relationship" with Hope before the marriage. This troubles Mickey so much that he begins to avoid Hope. Later, Hope tells Mickey that she is unsure if he should come to Paris after all and admits to having a "semi-lesbian affair" with Connie some years back. As a result, Mickey and Hope's relationship appears to be about to break up.Due to Francis' indecision over marriage in light of the news that Heather was a prostitute, Heather decides to leave him and marry "Papa", the wealthy older man she has been seeing concurrently while she was with Francis. When Francis threatens to tell Papa that Heather was a prostitute, Heather tells Francis that Papa was "her best customer". He then calls Renee in hopes of getting back together with her. But she is already in another relationship with Scott Sherman, a overweight mutual acquaintance whom Francis had made fun of in an earlier scene.In the final scenes of the film, Mickey and Francis meet with their father at his house where the distraught Frank tells them that their mother had just left him the previous day and has run off with a dry-cleaning store owner whom she has been having an affair with for several months. Unsure about everything now, Frank finally apologizes to Mickey and Francis for giving them bad advice about life and love when his own wife was cheating on him behind his back. As a result, the three men decide to go out fishing aware that despite the failure of their love lives, they will always have each other. As they prepare the motorboat to cast off, only Mickey decides it would be better if he tried to have one last talk with Hope before she leaves America. Only their father has arranged a surprise guest - Hope. The movie ends with Hope asking to drive the boat, but Frank, aware that women are not allowed on board, says it is too soon for that."
],
"summaries": [
"The love lives of two brothers, Mickey and Francis, interconnect as Francis cheats on his wife with Mickey's ex-girlfriend, while Mickey impulsively marries a stranger."
,
"How do siblings deal with each other in their targets? This is the question tackled in this movie. Blue-collared Mickey drives a New York taxicab since the breakup with his promiscuous ex-fiancée Heather two years ago. His younger, white-collared brother, Francis, cannot let Mickey forget the tragedy of the "hairy ass": (Mickey's image of his apartment floor of the guy having sex with Heather after walking in on them). Finding relief in driving his cab, Mickey meets an art student named Hope whom he marries after knowing her for only 24 hours. Mickey also meets his old lover Heather, and learns more about life itself as taxi fares in the course of a summer. Francis, a young Wall Street corporate raider, unhappy in his marriage to Renee and led by his infidelity, continues his shots at Mickey throughout the film, only to find himself a plot device that lends humor and lessons about marriage and brotherhood when he meets and starts an dangerous affair with Heather, despite Mickey's warnings that Heather is a gold-digging nymphomaniac who goes through sexual partners as often as a person changes clothes. Given Mickey's frame of reference on the past and his bride of 24 hours, it is no wonder that the two brothers, along with their father, an ego-eccentric and emotionally bereft bigot and a hard-core chauvinist who does not allow women aboard his fishing boat, learn about the strength of women, and their own lives."
,
"Two Irish-American brothers. Mickey, the older, hippie-like, lost, not knowing what he wants. The younger brother, Francis, a Wall Street power player with a beautiful wife named Renee, rich. Unfortunately, Francis is having an affair with Mickey's promiscuous ex-fiancée Heather. Mickey meets and marries a girl, named Hope he's known for 24 hours, while Francis dumps Renee to ask Heather to marry him... not realizing that Mickey was right about her."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "bC_NAIUBmFo8GYv0bpA1",
"_score": 8.74316,
"_source": {
"title": "The Humbling",
"year": 2014,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 5.6,
"directors": [
"Barry Levinson"
],
"writers": [
"Buck Henry"
,
"Michal Zebede"
,
"Philip Roth"
],
"synopsis": [ ],
"summaries": [
"A stage actor who is slowly losing his mind engages in a relationship with a sexually confused younger woman."
,
"Simon is an aging actor who suffers from bouts of dementia. He is institutionalized after an incident during a Broadway play, then returns home, where he contemplates suicide in Hemingway style. When he embarks upon an affair with an ex-girlfriend's amoral bisexual daughter, Pegeen, his world starts to fall apart. It ends on stage, with even Axler's audience and fellow actors unsure what's real and what's not."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "NC_NAIUBmFo8GYv0bnEp",
"_score": 8.717695,
"_source": {
"title": "Heat",
"year": 1972,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 6.1,
"directors": [
"Paul Morrissey"
],
"writers": [
"John Hallowell"
,
"Paul Morrissey"
],
"synopsis": [ ],
"summaries": [
"Spoof of the casual sexual adventures of a one-time child actor in Hollywood. It also involves a bratty on-again, off-again lesbian character."
,
"Joey, an unemployed ex-child actor, uses sex to get his landlady, Lydia, to reduce his rent, and then tries to exert his influence on Sally, who is now washed-up and wasn't even more than slightly important at the height of her career. She tries to help him, until he realizes that she just isn't well-connected enough to be of any service to him. The affair is complicated by Sally's psychotic, maybe-lesbian-or-maybe-not daughter Jessica, who tries to muscle in on her mother's relationship with Joey."
,
"Spoof of the casual sexual adventures of a one-time child actor in Hollywood. Also involves a bratty on-again, off-again lesbian character."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "HS_NAIUBmFo8GYv0boIw",
"_score": 8.568279,
"_source": {
"title": "Chance",
"year": 2002,
"genders": [
"Comedy"
,
"Drama"
],
"score": 6.8,
"directors": [
"Amber Benson"
],
"writers": [
"Amber Benson"
],
"synopsis": [
"Chance (Amber Benson) is a twentysomething slacker living in Los Angeles, who relies on a trust fund for finances. Narrating her own life story, Chance introduces her friend and room mate Simon (James Marsters), a not very successful telemarketer who is self-conscious about his body odor, has been sleeping on her couch. One day, Simon comes home from the grocery store to find a woman in Chance's bed who won't wake up.Earlier.... Chance is annoyed when Rory (Rayder Woods), a struggling actor with whom Chance had a one-night stand, appears at her door and becomes emotional trying to convince her that they have a connection beyond just sex because they really talked afterward. Chance and Simon spin a story about meeting in a mental institution, which makes Rory uncomfortable enough to stop crying and to leave.Simon tricks Chance into answering a phone call from her mother by telling her that it's a man named Jack (Andy Hallet) whom she was immediately attracted to when she met at a nightclub and tried to pick up. Her overbearing mother, Desiree (Christina Esterbrook), is calling to tell her that she is coming to visit. Trying to escape spending time with her mother, Chance persuades Simon to switch roles with her for the weekend and Simon spends time with Desiree pretending to be Chance until Desiree tells Simon that she needs to talk to Chance about something in particular. Desiree tells Chance that she is divorcing Chance's father, Malcolm (Jeff Ricketts), because he is in a relationship with a young woman, named Heidi (Lara Boyd Rhodes).Upset, Chance tells Simon about her parents' divorce and reveals that Desiree wants to stay with them for a while. Chance is suspicious when Simon tries to offer some comfort, and he begs again for $200 to pay off some unpaid parking tickets. Though hesitant to loan anyone money because of a bad experience with her first serious boyfriend Guy (Shamus Murphy), a man who romanced Chance a year earlier while she was living alone. In a flashback, Guy asked Chance if he could borrow some money to pay off some friends of his. Chance gave Guy the money he needed, only to see him literaly run over by a carload of angry thugs for not paying up on time. In the present, Chance agrees to give Simon the money for playing along with her charade for her mother.Uncomfortable with the idea of her mother living with her, Chance arranges for Desiree and her to have dinner with Malcolm and Heidi aboart Malcolm's sailboat in a marina. Chance also invites Rory and, as Chance had hoped, Heidi is immediately smitten with him because she watches the soap opera in which he stars. When Rory manages to get Heidi out of the room, Chance asks her parents about the divorce. Malcolm reveals that Desiree had suggested that they experiment sexually with Heidi, and Desiree felt rejected when Heidi preferred him. Desiree insists that he seduced her, but Malcolm denies it. Malcolm says that while attractions may come and go he loves her.Chance goes out to a club one night and meets a woman from England named Sara (Tressa Di Figlia), who makes sexual advances on her. The bi-curious Chance brings Sara home with her, and after spending a day in bed together making out, Sara suggests that they take some drugs. Chance refuses and takes the drugs away. Chance leaves her apartment the next morning, and when she returns she finds Simon in her bedroom with Sara, who has apparently overdosed. Chance initially tries to comfort Simon, but soon she herself begins to freak out when she realizes that she has a dead woman in her bed. Overcome with emotion, Simon kisses Chance and they have sex. Afterward, the two quickly begin to fight about the significance of the sex and Simon leaves the apartment. Chance drags Sara's body off her bed to the living room couch where she covers the body with a blanket and retires back to her bedroom to go to sleep for the night.The next morning, Chance awakes to find Sara, alive, sitting at the kitchen table. Sara tells her that she wasn't dead, just "resting." She thanks Chance for the place to sleep and then leaves. Chance then realizes that Simon never came home.On a park bench where Simon has apparently slept all night, he has run in with Jack, who recognizes him from the nightclub. The two make small talk until Simon realizes that Jack is hitting on him. Simon begins laughing and at Jack's confusion tells him that Chance has a huge crush on him and thinks that he is straight. Simon then tells Jack about what had happened the night before and about his frustration and attraction to Chance. Jack tells Simon that, even though he is gay, he sometimes has sex with women because he needs the contact with human beings, and Simon realizes that he needs that human contact too. Simon returns to Chance's apartment, and Chance is happy to see him, greeting him with a hug. They apologize for their actions and both admit that they are ready to try a relationship."
],
"summaries": [
"A young woman tries to find the right man to be with while dealing with her own life and family problems."
,
"'Chance' is a black comedy about how hard it is to find "the one". Mostly told from the point-of-view of a young, sexually aggressive woman, named Chance, whom according to her: "we're all out there looking for true love", which turns out to be a very elusive thing indeed, and Chance is no exception. She's desperately on the prowl for a man, but since she's more mouse than cat, she get's herself into scrape after scrape in her screwball pursuit of love. Surrounded by a bevy of adoring but completely wrong-for-her men (and one dead girl from Manchester, England), Chance has to pick her way through her messy life in order to figure out which guy is "it"."
,
"Chance is a single, neurotic, 20-something woman living in Los Angeles trying to get by any way she can (waitressing, acting, etc.) Her one true goal in life, as her frequent narration to the viewers, are to find her 'Mr. Right'. The people in Chance's life are Simon, her slacker roommate and telemarketer whom has a crush on her, but is too much in denial to admit it to her or even himself; Rory, a struggling actor and Chance's ex-boyfriend with massive crush on her, but he's too boring for her to be interested; Milton is her creepy voyeuristic neighborhood whom lusts after her; Jack is a struggling singer whom Chance finds attractive, but unaware that he's gay; Guy is another person in Chance's life whose romance is cut short by an accident; Sara is a young and outgoing bisexual woman from Manchester, England whom after a one-night stand with Chance, ends up dead from a drug OD, or does she? And then there's Chance's mother Desiree who's even more crazy than Chance, and distraught over her husband Malcolm divorcing her to be with his personal secretary."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "tC_NAIUBmFo8GYv0bn4u",
"_score": 8.564432,
"_source": {
"title": "My Own Country",
"year": 1998,
"genders": [
"Drama"
],
"score": 6.8,
"directors": [
"Mira Nair"
],
"writers": [
"Abraham Verghese"
,
"Jim Leonard"
,
"Sooni Taraporevala"
],
"synopsis": [ ],
"summaries": [
""My Own Country" tells the story of an East Indian doctor who settles in Johnson City, Tennessee. The doctor's name is Abraham Verghese, and he specializes in infectious diseases. It's 1985, and AIDS is spreading from the big cities to the rural areas. Abraham takes AIDS as his personal crusade and is soon well-known for his compassion and non-judgmental treatment. He soon becomes overwhelmed with patients from the surrounding states, which strains his marriage."
,
"After obtaining his medical degree from Madras Medical College, Dr. Abraham Verghese decides to re-locate to Johnson City, Tennessee. He eventually gets married to Rajani, who is an accomplished dancer, and has a boy, Steven. Since Abraham specializes in infectious diseases, he takes special interest in patients suffering from Acquired Immune Deficiency Syndrome(AIDS), and presents his work at the local gay/lesbian hang-outs and clubs, creating a public awareness of AIDS. Soon he has as many as 82 patients in his care at the local hospital. He gets engrossed in his work to the extent thathe starts neglecting his very heavily pregnant wife Rajani, who eventually gives birth to Jacob. She threatens him with marriage counseling, while fearing that her husband may acquire AIDS through contact with his patients, while he himself has to deal with hospital administration who are concerned about funds and resources being utilized on patients who may never recover."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "by_NAIUBmFo8GYv0bocx",
"_score": 8.460446,
"_source": {
"title": "29th & Gay",
"year": 2005,
"genders": [
"Comedy"
],
"score": 5.1,
"directors": [
"Carrie Preston"
],
"writers": [
"James Vasquez"
],
"synopsis": [ ],
"summaries": [
"'29th and Gay' is the movie for the gay everyman. Following a year in the life of James Sanchez, it's a story about a guy rapidly approaching 30 who doesn't have a six-pack, full head of hair or boyfriend. While his best friend, actress-turned-activist Roxy, struggles with showing him that there's life beyond the glitz of the disco ball, his other friend Brandon, comfortable in his own gay skin, works on getting him to at least talk to a guy. Feeling out of place in the world of circuit boys and caught between his Hispanic-American heritage and his gayness, he finds his true place in the world as he realizes that life is the journey, not the destination."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "VC_NAIUBmFo8GYv0bnEp",
"_score": 8.318151,
"_source": {
"title": "Four Times That Night",
"year": 1971,
"genders": [
"Comedy"
,
"Romance"
],
"score": 5.7,
"directors": [
"Mario Bava"
],
"writers": [
"Mario Moroni"
,
"Charles Ross"
,
"Guido Leoni"
],
"synopsis": [
"John (Brett Halsey) is a young playboy who is driving his silver sports car though Rome when he catches sight of Tina (Daniela Giordano) on the street, so he begins to follow her. She acts disinterested, but he refuses to give up. After finally catching up to her in a nearby park, John asks her out on the date, and she finally agrees.Later that afternoon, John arrives at Tina's apartment to pick her up. He is greeted by her severe, old-fashioned mother (Valeria Sabel) and is warned not to keep Tina out too late. Though John seems disappointed in her assertion that "Tina's a good girl", he takes her out to a swinging nightclub where they have a great time dancing.At 2:00 a.m., Tina arrives back at her apartment and her mother, who waited up for her, is furious for staying out so late. Her anger escalates when she sees that Tina's dress, 'a Paris original', has been badly torn. Tina tells her mother that John attempted to rape her and then recalls the night's events: after leaving the nightclub, John took her back to his large, spacious apartment, where he kept her prisoner and tried to force himself on her. Tina is adamant that she rejected his advances, even going as far as to scratch his forehead in retaliation. She then explains that she managed to escape after locking the sex-mad swinger in his large, ultra-mod bathroom, and then made her escape. Having finished telling the story, Tina's mother wants to phone the police, but Tina stops her by saying: "they'll never believe me."Meanwhile at the nightclub, John arrives at the nearly deserted place for a nightcap where he is noticed by a few friends of his who note some deep scratches on his forehead. Having seen him with Tina earlier, the friends ask him jokes if he "did it" with the girl. John is offended by the suggestion and offers his version of the events. In John's version of the story, it was Tina who came onto HIM in the park, and it was her idea that they go out. John says that he could sense danger from the start after arriving at Tina's apartment and meeting her mother, both of whom vied for his affection. After this farcical incident, he and Tina went to the nightclub as planed. John took her back to his apartment where they engaged in a veritable string of sexual encounters. He finishes the story by explaining that the scratches on his forehead were the result of over-zealous lovemaking on Tina's part, and that she used up so much of his energy that he had to stop for a drink after taking her home.The following morning, the sleazy doorman (Dick Randall) at John's apartment building has his own version of the events of the previous night to share with his friend the milkman (Rainer Basedow). The doorman explains that John is really a homosexual who lures pretty girls to his apartment for the benefit of his lesbian friend Esmeralda (Pascale Petit). Thus, when John retuned from the nightclub with Tina, he phoned Esmeralda, and his gay lover, George (Michael Hinz), and asked them to come over. Once they arrived, John went off with George leaving Tina with Esmeralda, who drugged the girl's drink and tried to take advantage of her. When the doorman, spying on them from the building rooftop, left to tend to the front door of the building, he returned when Tina was waking up. She tried to escape, John attempted to restrain her and ended up having his forehead scratched. The milkman is skeptical to the doorman's claims, but the doorman responds that he saw the whole thing with his own eyes.At this point, a German-speaking psychologist (Calisto Calisti) interrupts the movie to offer the viewers the "true sequence of events" which he gathered from police reports and various other sources. The real explanation he claims is much more innocent: John and Tina were both struck by love at first sight when they first met in the park on that day. After a pleasant first date at the nightclub, they did return to John's apartment for a make-out session. By mutual consent, they decided to wait a while before consummating their romance. But John's efforts to take her home are thwarted when the front gate to his apartment building refuses to open. With the doorman nowhere to be found (he is actually on the building rooftop spying on another couple in the same manner he described), John tried to give Tina a boost over the gate, and she tore her dress by accident on the pike top of the iron gate, and accidentally scratched his forehead when she fell onto him. Knowing full well that nobody will believe such a crazy explanation, they both decided to make up their own stories to tell to whoever might be interested.Which of these four stories is the true one? You decide."
],
"summaries": [
"A night of attempted seduction is recalled from the perspectives of the woman, the man, a lecherous doorman and a psychoanalyst."
,
"While walking in the park with her dog in Castel Fusano, Tina flirts with Gianni, a playboy in a fancy sport car. They schedule a date for that evening, and she wears her most elegant and expensive dress. They go to a night club, where they meet some of Gianni's friends: Duccio, Sergio and Pino. Gianni tries to abuse her, but she manages to escape, returns home and tells her version of the facts to her mother, Sofia who is more worried about how she has torn the expensive and elegant dress than for her daughter. Gianni returns to the restaurant with some suspicious scratches on his forehead, he claims to have conquered the girl who had to leave first. The doorman of Gianni's palace tells a completely different version stating that the two entered at night bringing with them two friends named Giorgio and Esmeralda, finally even a psychoanalyst exposes his version of the facts. But the truth is revealed at the end."
,
"While walking in the park with her dog, Tina Brandt is flirted with by the Gianni Prada, a playboy in a fancy sport car. They schedule a date for that evening, and Tina wears her most elegant and expensive dress. They go to a night club to dance and Tina returns home late. Her mother Sofia sees Tina sneaking in, her dress torn apart, and Tina tells her mother that Gianni tried to rape her. The next morning, Gianni tells a different story to his friend. Later, the doorman tells another version of the story. Last but not the least, the possible truth is disclosed."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "ui_NAIUBmFo8GYv0boMw",
"_score": 8.005365,
"_source": {
"title": "9 Dead Gay Guys",
"year": 2002,
"genders": [
"Comedy"
,
"Crime"
],
"score": 6.2,
"directors": [
"Lab Ky Mo"
],
"writers": [
"Lab Ky Mo"
],
"synopsis": [ ],
"summaries": [
"Two Irish lads stumble through London's gay scene."
,
"The story of two lads from Belfast as they stumble their way through the London gay underworld in search of 'gainful employment,' this being the offering of sexual favors to older gay men in order to subsidize their respective giros. However, when one of the lads accidentally shags a punter to death, they are forced to look for 'work' elsewhere. It is then that they discover the myth of 'The Bread in the Bed': a huge bed full of money. 'Nine Dead Gay Guys' is the result of the ensuing caper as the lads begin the search for the elusive bed."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "sS_NAIUBmFo8GYv0bn0u",
"_score": 7.959358,
"_source": {
"title": "Oscenità",
"year": 1980,
"genders": [
"Adult"
,
"Drama"
],
"score": 4.5,
"directors": [
"Renato Polselli"
],
"writers": [
"Renato Polselli"
],
"synopsis": [ ],
"summaries": [
"A group of people come up with provocative or downright nasty sexual scenarios like rape, bestiality, tree branch masturbation, candle masturbation, corncob masturbation, whipping, lesbian orgies, toe masturbation, and bathtub assault."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Jy_NAIUBmFo8GYv0bn4u",
"_score": 7.9452944,
"_source": {
"title": "Three to Tango",
"year": 1999,
"genders": [
"Comedy"
,
"Romance"
],
"score": 6,
"directors": [
"Damon Santostefano"
],
"writers": [
"Rodney Patrick Vaccaro"
,
"Aline Brosh McKenna"
],
"synopsis": [ ],
"summaries": [
"A rich businessman's assumption that his new colleague is gay leads him to ask the man to keep an eye on his mistress. However, the man is not gay, and begins to fall for the woman himself."
,
"A rich businessman, Dylan McDermott, mistakenly believes that Matthew Perry, who is bidding on a $90 million restoration contract, is gay and asks him to keep tabs on his mistress, Neve Campbell. Perry, who is not gay, falls for Neve in a big way but she thinks he's gay."
,
"Oscar Novak is an idealistic, young architect on the rise. Boyishly handsome and funny, Oscar and his business partner, Peter Steinberg, have just landed a career-making opportunity-Chicago tycoon Charles Newman has chosen them to compete for the design of a multi-million dollar cultural center. In a ploy for publicity, Newman has pitched Oscar and Peter in a neck-and-neck competition with their arch rivals and former colleagues, the hugely successful (and equally ruthless) Decker and Strauss. Impressed with Oscar's feverish dedication to winning the job, Charles assigns him the additional task of spying on his mistress, Amy, a woman who Charles guards as jealously as he guards his investments. Oscar's bumbling attempts at surveillance fail, but he does develop a crush on Amy, a beautiful and headstrong artist, who begins to return his growing affection. Much to his chagrin, Oscar may have finally found the woman of his dreams. But Oscar's dream is short-lived when he discovers that the jealous Charles has assigned him this special job only because he (mistakenly) believes that Oscar is gay. Oscar's frustration compounds when he realizes that Amy also believes him to be gay. In short order, Oscar's friends, his family, even strangers on the street believe that he is gay. The very heterosexual Oscar Novak becomes the most famous gay man in Chicago and his entire life is turned upside-down. When he is honored as Chicago's Gay Professional of the Year, Oscar has to make a decision-will he continue the lie and hold on to the job of a lifetime and a warm but frustrating friendship with the girl he loves, or is it time to face the consequences of coming out of the closet and telling the whole world that he is secretly - straight?"
,
"Oscar is an architect, he and his partner, Peter are competing with another pair for a restoration job. Charles Newman, the pompous businessman, who will decide who among them will do the job. He instructs them to build a model of their proposals, he will decide then which one will get the job and they have to pay for it themselves. Now Oscar and Peter are struggling but Peter decides to mortgage his apartment so they can get the job. Now Peter who is gay and after being caught in a "compromising" position with him, Oscar is disbelieved to be gay. Now Charles who has a mistress, Amy. Now she is surround by several male friends, Charles is a little insecure; when he learns that Oscar is gay, he "asks" him to keep an eye on her. Oscar is taken with her but when he learns that they think he is gay and knowing that it could jeopardize the job allows them to continue thinking that. But things go out of hand when a newspaper reporter outs him. And Oscar, who has fallen for Amy and who disapproves of her relationship with Charles, is uncertain of what to do."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "DC_NAIUBmFo8GYv0bnst",
"_score": 7.9091854,
"_source": {
"title": "French Twist",
"year": 1995,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 6.4,
"directors": [
"Josiane Balasko"
],
"writers": [
"Josiane Balasko"
,
"Telsche Boorman"
,
"Patrick Aubrée"
],
"synopsis": [ ],
"summaries": [
"After learning of her husband's infidelities, a housewife invites an itinerant lesbian to move in with them. None of their lives will ever be the same again."
,
"Undoubtedly, the smug real estate agent, family man, and father of one, Laurent, is a shameless philanderer. Under the nose of his beautiful but unhappy wife, Loli, the incurable womaniser never misses an opportunity to cheat on her, until one day, the cigarillo-smoking and very lesbian plumber, Marijo, sets foot in their house. Now, the stage looks set for the perfect revenge, and nothing can stand in the way of a woman scorned. Can Loli and Laurent survive the complications of having a stranger in their bedroom?"
,
"Laurent is the local estate agent, a job that offers easy opportunties for his womanising. His wife beautiful wife Loli looks after his home and two children unaware of his many affairs. However, their world is turned upside down by the arrival of Marijo, an itinerant lesbian whose minivan breaks down nearby. The neglected Loli is drawn to the sensitive Marijo and when she learns of Laurent's infidelities, invites Marijo to move in with them. The arrangement takes an emotional toll on each of them, exacerbated by the arrival of a figure from Marijo's past. As they struggle with the situation and each other, all of their lives are changed forever."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "mi_NAIUBmFo8GYv0boUx",
"_score": 7.872293,
"_source": {
"title": "Dorian Blues",
"year": 2004,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 6.7,
"directors": [
"Tennyson Bardwell"
],
"writers": [
"Tennyson Bardwell"
],
"synopsis": [ ],
"summaries": [
"High school senior Dorian begins a gay man's odyssey when he determines that he's gay and decides to come out. Chief among concerns is the reaction of his father, who has never liked him."
,
"Coming-of-age. A small-town young man realizes why he's such a misfit - he's gay! Adolescence is proving a pain for the always-thinking Dorian. He's an outcast and the butt of classmates' fag jokes at high school. He's different and understands why when he reaches the conclusion that he's a "stereotypical gay." He soon announces this discovery to his homophobic, Nixon-loving dad. As Dad throws him out of the house, Dorian's off to NYU to encounter a new world of coffee houses, sophisticates and handsome men."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Iy_NAIUBmFo8GYv0bo80",
"_score": 7.872293,
"_source": {
"title": "Making the Boys",
"year": 2011,
"genders": [
"Documentary"
,
"Biography"
,
"Romance"
],
"score": 7.4,
"directors": [
"Crayton Robey"
],
"writers": [
"Edward Albee"
,
"Joe Allen"
,
"Matt Baney"
],
"synopsis": [ ],
"summaries": [
"On the eve of the 40th anniversary of the Gay Rights Movement, the film explores the drama, struggle and enduring legacy of the first-ever gay play and subsequent Hollywood movie to successfully reach a mainstream audience. Beloved by some for breaking new ground, and condemned by others for reinforcing gay stereotypes, The Boys in the Band sparked heated controversy that still exists four decades later."
,
"Admired by some as groundbreaking, hated by others as furthering stereotypes, The Boys in the Band was the first widely released gay film. This is the story of it's history and impact. Interviews with heavyweights from Edward Albee to Tony Kushner, plus rich archival footage from the 50s to today, illustrates the continuing legacy of The Boys."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Oi_NAIUBmFo8GYv0bnwt",
"_score": 7.860065,
"_source": {
"title": "The Watermelon Woman",
"year": 1996,
"genders": [
"Comedy"
,
"Drama"
,
"Romance"
],
"score": 7.1,
"directors": [
"Cheryl Dunye"
],
"writers": [
"Cheryl Dunye"
,
"Douglas McKeown"
],
"synopsis": [
"Cheryl is a young, African American lesbian who works in a video rental store in Philadelphia with her friend Tamara. They earn extra money by making professional home videos for people. Cheryl becomes interested in films from the 1930s and 40s which feature black actresses. She notices that these actresses are often not credited. She watches a film called Plantation Memories with a black actress who is credited simply as "The Watermelon Woman". Cheryl decides to make a documentary about the Watermelon Woman and find out more about her life.Tamara tries to set Cheryl up with her friend Yvette, but Cheryl is not interested. Cheryl meets a white woman in the store called Diana who, to Tamara's annoyance, flirts with Cheryl.Cheryl starts interviewing members of the public, asking them if they have heard of the Watermelon Woman. She interviews her mother who does not remember the name, but recognises a photograph of her. She tells Cheryl that she used to hear the Watermelon Woman singing in clubs in Philadelphia. Tamara's mother tells Cheryl to get in contact with Lee Edwards a man who has done a lot of research into black films. Cheryl and Tamara go to see Lee, and he tells them about 1920s and 30s black culture in Philadelphia. He explains to them that in those days, black women usually played domestic servants.Cheryl meets her mother's friend Shirley, who turns out to be a lesbian. Shirley tells her that the Watermelon Woman's name was Fae Richards, that she was a lesbian too, and that she used to sing in clubs "for all us stone butches". She says that Fae was always with Martha Page, the white director of Plantation Memories, and that Martha was a mean and ugly woman.When Cheryl and Tamara get caught ordering video tapes under Diana's name, Diana takes the tapes and tells Cheryl that she will have to come to her home to collect them. Cheryl goes to Diana's house, stays for dinner, and watches some of the tapes with her, telling her about her project. They have sex, and Cheryl decides that although Diana is not her usual type of woman, she likes being with her.Cheryl meets cultural critic Camille Paglia who tells her about the Mammy archetype, saying that it represented a goddess figure. Cheryl goes to the C.L.I.T. archive of lesbian material, and finds photographs of Fae Richards, including one given by Fae to a June Walker. With Diana's help, Cheryl manages to contact Martha Page's sister who denies that Martha was a lesbian.As Cheryl and Diana grow closer, Tamara makes it clear that she dislikes Diana and disapproves of their relationship. She accuses Cheryl of wanting to be white, and Diana of having a fetish for black people.Cheryl telephones June Walker, learning that she was Fae's partner for 20 years. They arrange to meet, but June is taken to hospital and leaves a letter for Cheryl instead. In the letter she says that she is angry with Martha Page, that Martha had nothing to do with what Fae's life. She urges Cheryl to tell their history.Having separated from Diana, and fallen out with Tamara, Cheryl finishes her project, never managing to make further contact with June."
],
"summaries": [
"A young black lesbian filmmaker probes into the life of The Watermelon Woman, a 1930s black actress who played 'mammy' archetypes."
,
"Cheryl is young, Black, and lesbian, working in Philadelphia with her best friend Tamara and consumed by a film project: to make a video about her search for a Black actress from Philly who appeared in films in the 30s and was known as the Watermelon Woman. Following various leads, Cheryl discovers the Watermelon Woman's stage name and real name and surmises that the actress had a long affair with Martha Page, a White woman and one of Hollywood's few female directors. As she's discovering these things, Cheryl becomes involved with Diana, who's also White. The affair strains Cheryl's friendship with Tamara. More discoveries bring Cheryl (and us, her audience) to new realizations."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "fy_NAIUBmFo8GYv0bm8n",
"_score": 7.8494673,
"_source": {
"title": "The Sex of Angels",
"year": 1968,
"genders": [
"Drama"
],
"score": 6.1,
"directors": [
"Ugo Liberatore"
],
"writers": [
"Ugo Liberatore"
,
"Franz Seitz"
],
"synopsis": [ ],
"summaries": [
"Four people (three women and a man) set off on a boat trip through the fjords of Yugoslavia. Two of the women are lesbian lovers. Influenced by LSD, the female passengers freely engage in nudity."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "ci_NAIUBmFo8GYv0bpI1",
"_score": 7.8494673,
"_source": {
"title": "7 Days in Havana",
"year": 2011,
"genders": [
"Drama"
],
"score": 6,
"directors": [
"Laurent Cantet"
,
"Benicio Del Toro"
,
"Julio Medem"
],
"writers": [
"Laurent Cantet"
,
"Alejandro Fadel"
,
"Martín Mauregui"
],
"synopsis": [ ],
"summaries": [
"A lesbian, an aspiring actor, an aspiring singer, a low-class marriage, a neighborhood community and 2 renowned directors have memorable less-than-24-hour-long experiences while living in/visiting the capital of Cuba."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "wy_NAIUBmFo8GYv0bm8n",
"_score": 7.838374,
"_source": {
"title": "No Way to Treat a Lady",
"year": 1968,
"genders": [
"Comedy"
,
"Crime"
,
"Drama"
],
"score": 7,
"directors": [
"Jack Smight"
],
"writers": [
"John Gay"
,
"William Goldman"
],
"synopsis": [
"New York City, 1968: A priest walks briskly up the sidewalk, whistling an odd little tune. He turns in at the entrance of a comfortable old apartment building, and heads up the stairs. Kate Palmer (Lee Remick) is coming down the stairs. "Top of the morning to you, young lady," he says, in a lilting Irish accent, and she replies, "Hello, Father," as they pass each other. The priest stops in front of Apartment 2B, and knocks. Alma Mulloy (Martine Bartlett) answers, a plump, middle-aged lady in a house dress and hair curlers. The priest introduces himself as Father McDowell, and she lets him in. After exchanging a few pleasantries, she tells him apologetically that if he's there about the church, she's no longer a Catholic...she lost her faith after her husband died. He acknowledges that most of us suffer in this vale of tears, and launches into a rambling discourse about his sainted mother, and what a beautiful, voluptuous woman she was. "But she had a delicate spot on her body," he says, "just there," and he touches Mrs. Mulloy on the ribs, and she giggles and squirms. He touches the spot again, and again she giggles and squirms. He swiftly moves around in back of the chair where she's sitting, and begins tickling her vigorously with both hands, until she is screaming and writhing with laughter. Suddenly his hands close around her throat, and he laughs like a hyena while he strangles the life out of her. When he is done, he kisses her on the forehead, and murmurs softly, "So, now, Mama, you rest in peace." He drags her body into the bathroom and seats her on the toilet. He finds a tube of lipstick and carefully paints a set of full, red, "Cupid's Bow" lips on her forehead. He stands in the doorway of the bathroom for a last look at his handiwork, blows poor Mrs. Mulloy a kiss and leaves.Morris Brummel (George Segal) is getting dressed in the apartment he shares with his mother. Mrs. Brummel is nagging him about his eating habits, his appearance, his profession (cop). She compares him to his older brother: married, three children, a doctor, making a thousand dollars a day...and all she gets from Morris is heartbreak. Morris, clearly accustomed to this, offers only token resistance. The phone rings, and he answers: his boss, Lieutenant Dawson (David Doyle), is calling to tell him that one of the other detectives has fallen ill, and Morris has been assigned to the Mulloy homicide in his place.Christopher Gill (Rod Steiger) comes downstairs to breakfast, a well-to-do, middle-aged bachelor, living a quiet, orderly life. Nevertheless, we see he is the man who strangled Mrs. Mulloy the previous day. He sits down at his dining room table, and his quiet, efficient housekeeper, Mrs. Fitts (Irene Daily), brings him his morning newspaper. He finds what he's looking for near the end of the second section, but it doesn't make him happy. He calls the newspaper to complain about the placement and brevity of the paragraph announcing the murder of Mrs. Mulloy. An assistant editor replies that it was probably due to the fact that they were racing a deadline. "May I ask who's calling?" he says. Gill hangs up. "No, you may not," he mutters.Morris arrives at Mrs. Mulloy's apartment, swarming with police, technicians and reporters. He finds the super and asks which tenant saw the priest at Mrs. Mulloy's door. He replies, "3E, directly above." As they head upstairs, a reporter asks Morris if he can get a quote. Morris tells him no, unless he wants to print that the murder was well-planned and well-executed.Kate is slow to answer the door, and she is still half asleep...but undeniably lovely. Morris asks if she can describe the priest. "If you've seen one, you've seen them all," she replies. He asks if he had any distinguishing features. "You mean, like a big nose? I can't remember. But you've got kind of a sweet-looking nose, there, yourself," she adds flirtatiously. Then she realizes that she's barely dressed in a rather revealing nightgown. She tells him she's going back to bed, and he should come back later. "I meant that about your nose," she says, with a little smile, as she stretches out on her bed. Morris leaves, but pauses in the hall just outside her door...to feel his nose.Later in the day, after Mrs. Brummel has seen the papers, she calls Morris: "I am sick at my heart when my own son goes looking at dead women's naked bodies. I tell you, Morris, it is no way to treat a lady."Mrs. Himmel (Ruth White), a plump, middle-aged German lady, has just fixed a tray for herself and settled down in front of her TV, when there's a knock at her door. She answers, and a gray-haired German plumber (Gill) tells her apologetically, "I have to pound on your water pipes." "Oh, no," says Mrs. Himmel, "Not on MY pipes...you go somewhere else." She starts to shut the door, but he interrupts, "What do you mean, go somewhere else? That's the trouble with the world. No one has any sympathy for anyone else, anymore. Well, I'll tell you something, it was a sad day when I left Frankfurt." He turns to leave. "Frankfurt!" Mrs. Himmel exclaims, "I'm from Frankfurt, too!" "Well, it's a small world," says the plumber, and turns back, smiling. "I'm sorry I yelled at you," she says, contritely, and lets him in. He heads for the kitchen, but stops when he sees the cake on her tray. "Baumkuchen!" he exclaims, "I haven't had baumkuchen since I left Frankfurt!" "Have a piece," she says, kindly. She asks if he'd like to look at some old photos of Frankfurt. He directs her to sit on the couch, so he can stand behind her and look over her shoulder. "Look, look, look!" he exclaims, pointing, "There's my friend, Fritz, right there...he's waving to you..." Mrs. Himmel looks closer, confused. "He's saying, 'Goodbye, Mrs. Himmel...auf wiedersehen'." He kisses her on the cheek. And in the next scene, poor Mrs. Himmel is seated on the toilet in her bathroom, with "Cupid's Bow" lips painted on her forehead. The plumber surveys his handiwork from the doorway.Morris is in the squad room, looking through fingerprint reports. Another detective, Monaghan (Val Bisoglio) asks what he's still doing here...it's past 10 p.m....asks why he doesn't get married. "You sound like my mother," says Morris. The phone rings and he answers. Gill introduces himself as Hans Schultz. "At least, that's who I am today," he says, "but last week I was Father Kevin McDowell." "What do you want?" asks Morris impatiently. "I just want to tell you," says Gill, slowly, "that I'm in Mrs. Himmel's apartment, and she is...quite dead." Momentarily stunned, Morris recovers quickly. He attracts Monaghan's attention, who quietly picks up his own phone and requests a trace. Morris sets out to keep Gill talking as long as he can. But Gill, lying on Mrs. Himmel's bed and enjoying himself immensely, lets Morris know that he's familiar with call tracing, and knows just how long he can stay on the line before they locate him. He tells Morris that he liked the quote in the newspaper, about Mrs. Mulloy's murder being well-planned and well-executed. He gives Morris Mrs. Himmel's address, so he can come and see that her murder is well up to his previous standard..."And I want you to put that in the newspaper," he adds. "In fact, I insist on it." And he hangs up.The police, the technicians, and the reporters all swarm over to Mrs. Himmel's apartment. Morris looks at Mrs. Himmel, and turns away, disgusted and discouraged.Next day, Gill is seated at his dining room table, humming his tune. Mrs. Fitts brings in his daily newspaper. This time, what he's looking for is splashed all over the second page, and he smiles as he reads it all.Kate Palmer has come to the precinct, to look at mug shots. Once again, she hasn't been much help..."Some people remember faces," she says, "with me, it's names." Morris offers to take her home, and they catch a bus at a nearby stop. She asks if he's a good detective; he replies modestly that he thinks so. And she teases him, saying she doubts it, since he'd insisted on her coming in even though she'd told him she wouldn't be any help. "You know what I think?" she says, impudently, "I think you just wanted to see me again." Morris starts to protest...she laughs and accuses him of fibbing. "Well," he finally admits, "I might have fibbed a little." They both smile. She looks around, and tells him this is their stop. They get off the bus, and as it pulls away, the camera shifts to the back of the bus, and we see that Gill is there, watching them through the rear window...in another disguise...on his way to another victim.The camera cuts back to Morris and Kate, walking along the street. "Why did you move?" he asks. "The ghost of Mrs. Mulloy finally got to me," she says. She remarks on what a fancy name he has. "What's your first name?" she asks. "Morris," he answers, sheepishly. She laughs..."I'll bet everyone calls you Moe". "They do," he admits, and they both laugh. They stop at the door of her apartment building, and he tells her goodbye. "Was there something you wanted to ask?" she prompts him. He hesitates, knowing he's not in this beautiful, elegant woman's league...then finally says, "I guess not." Then he blurts out, "Oh, well...maybe I could call you...say, Saturday night?" "Don't bother," she replies, poker-faced. "Huh?" he says, a bit confused. "Calling," she finishes with a smile. "I'll be ready at eight." He smiles, too, and walks on. She looks fondly after him, still chuckling over the name Moe Brummel.Gill walks up the hallway of another apartment building, dressed in a navy-blue jacket and yellow slacks, carrying a striped hat box. He pauses in front of a door and rings the bell. "Miss Belle Poppie?" he calls, in a lisping, effeminate voice. Inside the apartment, a middle-aged woman in a lace caftan (Barbara Baxley) gets up from her typewriter, and asks, "Who is it?" "It's Dorian Smith, dear," he replies, "I've brought your wig." Miss Poppie is puzzled. Dorian assures her she won a contest after signing a coupon at the drugstore. She opens the door about six inches, keeping it on the chain, and asks, "No strings?" "Absolutely none," he replies. "All right, I'll take it," she says, holding out her hand. "Oh, no," says Dorian. "I have to fit it for you...otherwise you'll look absolutely dreadful." She hesitates, but after making him promise he'll speak in a soft, low voice, so not to disturb her five cats, she lets him in. He directs her to sit on the couch, and takes a mirror off the wall so she can watch as he fits the wig. After some adjustment he asks, "Now...what do you think of that?" "I don't like it," she says. "Well, that's because I haven't finished," he tells her. "It needs to be fitted in here, and tucked in here, by your neck...you do have a lovely neck, don't you..." His facial expression hardens and his hands move into position...but just before they close on her throat the front door opens, and another middle-aged woman bustles into the room. "It's only me, Belle," she says, "and look what I brought for the babies!" She produces a new, deluxe scratching post. Belle admires it, then introduces the woman as her sister, Sylvia (Doris Roberts). Belle tells Sylvia that she's won a wig, and Mr. Smith is here to fit it for her. "Do you like it?" she asks Sylvia. "No," says Sylvia, bluntly. "But I guess if you won it, you won it." She looks at Dorian, and asks suspiciously, "and you're absolutely sure it's free?" He decides two Poppie sisters are more than he can handle. "Of course," he replies. "She gets the wig, and a custom fitting, and if she's still not happy with it, at the end of two months she'll get every penny of her money back." The two women begin to protest, with Belle saying, "That's dishonest!" He shouts, "Absolutely no one ever calls me dishonest!" He gathers up the wigs and the hatbox and storms over to the door. Sylvia calls him a homo. He pauses with his hand on the door knob, says, "Doesn't make you a bad person," and flounces out.Morris is at home, sitting at the table, reading crime scene reports and whistling softly. His mother brings in two plates, sets one down in front of him, and asks point blank, "So, who is this girl you're thinking about?" He tries to change the subject...asks if they didn't have kneidlach last night. "Loss of appetite...that's the first sign," she declares. He asks her to just lay off for once, and she says, "Temper...that's the second sign." She asks if the girl is Jewish and Morris admits he doesn't know. Mrs. Brummel is distraught at the idea of Morris dating a shiksa! They are wrangling back and forth when the phone rings...Morris answers. It's Gill, using his Dorian voice...he's calling from a wall phone just outside his latest victim's bathroom. "Oh, Morris," he says, "I've been a bad boy, again." At first Morris doesn't realize who he's talking to, and Gill blasts him for forgetting so soon. In his Dorian character, he is much more volatile, less controlled. He rambles about his brilliant characterizations, even giving Morris a sample of his "uncanny" W.C. Fields impersonation. Morris asks quietly if they can talk, one human being to another. "Oh, no," says Gill, with a shaky little laugh. "And I'm not going to tell you where I am this time, either...you'll have to figure it out for yourself." And he hangs up.They find the latest victim's apartment. A technician finds a few strands of long, blonde hair that don't match the victim...asks if there was a wig found in any of her stuff. They tell him no. "I don't know," complains Morris, "how can you figure with a pervert like this?" A lurking reporter asks Morris if he can quote him on that...Morris yells no, and has the uniformed officers escort him out.Back at the station, Morris calls Kate to cancel their date. The moment she hears his voice, she begins to talk excitedly about the dinner she's prepared...she watched that Julia Child woman, and has to admit it smells pretty great. Morris tells her, apologetically, that he can't make it, he has to work. Disappointed, annoyed, she says, "Oh, well...okay. Just a small, crummy dinner. It probably tastes rotten, anyway." "Maybe I could come over later," he suggests. "What for?" she retorts. "I don't know," he stammers, "I thought...maybe..." "Morris," she says, with finality, "I'm going to hang up now. Goodbye." "Goodbye," he murmurs, dejectedly. "Morris?" she says at the last moment, "Tonight you be careful, all right?" and then hangs up. Morris's face lights up..."Do you know what she said to me?" he asks Monaghan. "She said, 'Be careful.' Isn't that beautiful?"Gill is on his way to work, walking down the sidewalk with his briefcase, whistling his tune. He stops at a newsstand and buys a paper. He opens a wrought-iron gate, goes down the alley beyond, and enters the building...which turns out to be a theatre. He takes a private elevator to his office, takes the two wigs he was using as props out of his briefcase and puts them away. Then he opens his newspaper to read his latest notices...to be greeted by the headline, "Killer is a Sexual Pervert."Morris is at his desk, on the phone, with a tape recorder running and several detectives standing around listening. Gill is on the other end of the line, so angry he is almost in tears. "You had no right to call me a pervert, and you had no right to bring my mother into the story!" he screams as Hans Schultz. "My mother and I were famously close! And we LOVED each other! I want a retraction!" "I can't do that," says Morris. "I don't care," Gill screams, "I want a retraction printed, or you will suffer the consequences! I am NOT a pervert...and you will NOT dishonor my mother!"Morris, Monaghan, and Lieutenant Dawson are in the office of Inspector Haines (Murray Hamilton), listening to the tape of this conversation. The inspector asks Morris if he called the Strangler a sexual pervert. "Well, not for the record, sir," Morris replies. "Our own expert on Freud," says the inspector, wearily. "Brummel, I'm taking you off the case. In fact, I want you to stay home for a few days. You see, we can't print a retraction for your opinions, but maybe if we take you off the case, that will placate this madman." He continues, telling them he wants additional safety measures taken, to include dispatching officers to hotels and apartment houses that cater to women. "Tell them to stay inside," he says. "Tell them to keep their doors locked."A uniformed policeman, his back to the camera, is knocking on an apartment door. A middle-aged woman in a green suit and mustard-colored hat comes out of another door and walks by, glaring at him. A middle-aged lady in a bathrobe with a towel wrapped around her head opens the door, and is startled to see him. "What have I done?" she asks. "You haven't done anything, ma'am," he says, in a familiar voice. "Officer Brummel, 19th Precinct...I'm just giving out some precautionary information to women who live alone. May I come in and explain?" "Oh, yes, please do," she says, smiling, and steps to one side to let him in. The camera switches to the officer's face: it is Gill. "Thank you, ma'am," he says, and walks in.Morris is at home, getting ready to go out, bantering back and forth with his mother. The phone rings, and Mrs. Brummel answers. Gill asks to speak with Morris, using a Cary Grant accent. "Morris," Mrs. Brummel whispers, "It's HIM!" Morris takes the phone from her, and says "Yeah?" " 'Ello, Morrie, 'ow are you?" says Gill. "Listen...I think it's terrible the way the police are treating you. You tell 'em I'm not going to talk to anyone else but you. You tell them to put you back on the case or I'm liable to be a very naughty boy again tonight." "Hey," says Morris, "Don't do that, come on!" "I've got the simply sensational idea of guarding that woman what said she saw me dressed up in a police uniform," says Gill. He recites a bad limerick about Morris and the Strangler, then says "Cheery-bye" and hangs up.Morris hurries down to the precinct, and tries to sneak a look at the Strangler file. Monaghan catches him at it. He persuades Monaghan to tell him the new witness's name, in spite of the trouble it could cause both of them. "Her name is Pearl Menzel," says Monaghan. "You probably won't find her, though. I think she left town as soon as she talked to the newspapers. Or else she's boozing it up in some gin mill."Morris arrives at one of the bars she is known to frequent, a rundown neighborhood dive, and asks the bartender (Val Avery) if he's seen Pearl Menzel. The bartender says no. "Are you positive?" asks Morris. "As positive as I am that you're a cop," says the bartender, evenly. Morris decides no help is forthcoming from this quarter, and leaves. Shortly afterward, Sadie comes in: a tall, plump "lady" wearing a sleeveless black sheath, stiletto heels, a '60's bubble hairdo, and lots of make-up. She sits at the bar and orders a double Pink Lady in a suspiciously deep voice. While the bartender is getting it, she turns around and tells a bad joke as a come-on to a couple of guys sitting at a table. They rebuff her, and she turns to the man sitting next to her, and recites a bad limerick about the Strangler. A middle-aged woman at the end of the bar who's been sniffling into a handkerchief begins to cry, loudly. "Knock it off," growls the bartender to Sadie. "Can't you see she's scared to death?" Sadie retorts, "Well, who isn't?" "Yeah, but she says she actually saw him," says the bartender. "Oh," says Sadie, chastened. She goes around the bar to the woman, to comfort her. She asks if the woman has anywhere to go. The woman sobs no. Sadie invites her to come home with her. "I just live across the street," she says, "He won't attack two of us together." The woman hesitates. "Come on," coaxes Sadie, "We'll watch TV, have a few drinks...we'll have a ball." The woman finally nods, and they walk out together, with Sadie supporting the smaller woman as she sobs into her handkerchief.Morris has been checking the bar next door...he sees the women come out and cross the street, and on a sudden hunch, he runs back down into the first bar, and asks the bartender who the hooker was. "What hooker?" asks the bartender, stolidly. "The hooker that just left here!" says Morris, exasperatedly. "How would I know?" retorts the bartender. Morris turns to a couple of apple-cheeked frat boys sitting at the bar, and says, "Say, are you two familiar with the legal age for drinking in this state?" "All right, all right," says the bartender. "She just moved into that brownstone across the street, basement apartment."Sadie settles the woman on her couch, still quietly crying. "You know what I think," Sadie says, "I think you should call the cops. You need to get yourself some protection." She lights a cigarette, and heads for the refrigerator. "I can't," sobs the woman. "Well, it's up to you and your own conscience," says Sadie, "but just remember, he's killed four women." "Five," sobs the woman. "Five?" repeats Sadie, surprised. "I didn't know it was five." "It is now," the other woman growls in a masculine voice. She sits up, and we see it's Gill."Who was that woman with her...was it Pearl Menzel?" Morris asks. "No," says the bartender, "THAT'S Pearl Menzel," and points to a woman in a green suit with a mustard-colored hat at the other end of the bar. "Well, keep her here," says Morris, and runs out. He crosses the street, and runs down the stairs to Sadie's apartment. The door is open. He draws his gun and cautiously enters...the room is a wreck. He finds Sadie in the bathroom, sprawled on the toilet, a hasty "Cupid's Bow" smeared on her forehead. On the mirror above the sink, scrawled in red lipstick and underlined three times, are the words: "Reinstate Morris".They are back in Inspector Haines's office. "I want all press releases on this latest murder to include the fact that Detective Brummel has been put in charge of the case again," he says. "I'm doing this solely at the recommendation of our expert, Dr. Shaffer. But I want everyone here to know that I still consider Lieutenant Dawson to be in charge."Gill walks into Sardi's. He is greeted cordially by the maître d, and shown to his usual table. His waiter asks what he would like, and Gill replies he'd like something French. And he asks for a telephone. "May I 'ave Monsieur Brummel, s'il vous plait?" he says, a la Maurice Chevalier. "Maurice Dubois 'ere...'ow do you like my new accent? I am very 'appy that they...uh, 'ow you say...reinstate you. C'est bon, ca." "That's very good, very French." says Morris. He is surrounded by detectives again, and Lieutenant Dawson, and the tape is running. "How about a little more?" "Ah, no, no, no, mon ami," replies Gill, "because if I take too much time you trace the call. I just called to say I start my vacation, and I promise not to be a bad boy. I give you my word of honor. A tout à l'heure." "Hold on...Can't you wait just a second?" asks Morris. But Gill is gone.Kate is leading a tour at the Lincoln Center, where she works. She passes Morris, sitting on the edge of a planter box, without acknowledging him. He gets up and follows after the group. As she is talking about the Mark Chagall painting, he moves a little off to one side where only she can see him, and without any change in his expression, opens the right side of his suit jacket and shows her his gun in its holster...she starts to laugh, barely able to finish. She leads the tour group away, and Morris follows, apparently forgiven. They are both unaware that Gill is watching from across the plaza.They have lunch together, at an outdoor cafe. "So," she says, "you finally found out." He asks, "Found out what?" She replies, "That I'm the Strangler. How else can you spare me these few precious minutes? Oh, at first that was one of the things I liked about you, that you didn't try to make a pass at me right off. But don't you think you're carrying a good thing a little too far?" He says nothing, still a little shy with this lovely woman. "Morris, would it bother you if we stopped seeing each other?" she asks. "Yes, of course," he says, vehemently...but seems unable to say anything further. "What do I do wrong?" she asks, frustrated. "Is a Jewish cop so wrong for me?" "The thing is," he says, and hesitates..."I want to show you my yacht." "Yacht?!" she says in disbelief. "My yacht," he replies, firmly.They are on a police launch, cruising around the harbor. They sit down in the stern, look at each other and smile. "To tell you the truth, Morris, I've had him," says Kate. "Had who?" he asks. "Randy Beautiful," she replies. "And he was beautiful, old Randy...good future, good family...good everything. And then one day, I don't know...the message just came to me. I turned over and tapped him on the top of his beautiful head, and said, 'You only love me for my body, not for myself...for my mind.' And he screamed, 'What mind? Any thought of yours would die of loneliness.' So I got up, got dressed, packed my little suitcase, and I left Randy Beautiful...AND his good family, AND his good future. Tell me the truth, Morris...Do I have a good mind?" Morris replies earnestly, "You have a brilliant mind." "Are you tender, Morris?" she asks, wistfully. "You can have me if you say yes." "Yes," he says, firmly. "Do you love me, Morris?" she asks. He hesitates a moment, then replies, "Yes, I think so." She smiles and says, "Kiss me, Morris". He leans over and kisses her, a bit awkwardly because of the way they're sitting. They both stand and kiss again...and Morris IS tender...and they keep on kissing.Morris is sitting at his desk, alone in the squad room. A uniformed officer brings in Mr. Kupperman (Michael Dunn). He stands at Morris's desk and says, "Ok, you got me." "For what?" Morris asks, blankly. "What do you think?!" snaps Mr. Kupperman. "You're the Strangler?" Morris asks, incredulously. He can be forgiven his doubt...Mr. Kupperman is, after all, just under four feet tall. "I killed them all," says Mr. Kupperman, smiling proudly. "Mr. Kupperman..." Morris begins. "You be careful what you're going to say," interrupts Mr. Kupperman, "I'm very sensitive on certain subjects." Morris begins again..."Well, naturally, I wouldn't bring it up if it didn't have some bearing on the case, but...you're a midget. The few witnesses we have claim that he was of normal...uh...that is to say...he was taller than you." "You see how I fooled them," says Mr. Kupperman, eagerly. "Did you talk to me several times on the phone?" asks Morris. "That's right," says Mr. Kupperman. Morris hands him the mike to the tape recorder on his desk, and says, "Imitate Barry Fitzgerald." Mr. Kupperman does so...very badly. Morris reaches for the mike, and Mr. Kupperman says, "Wait...I can do W.C. Fields." This effort is only slightly better. Morris takes the mike from him and says, "Mr. Kupperman, I just don't believe you're the Strangler." "Bigot! You're a bigot!" declares Mr. Kupperman, and the conversation deteriorates into a shouting match. Lieutenant Dawson's door opens: he pokes his head out, looks at them, nods slightly, and goes back inside. "I'm very sorry, Mr. Kupperman," says Morris, quietly, "but you're going to have to leave now." "You're turning me loose to murder again," says Mr. Kupperman, bitterly. "All right, but this is what it's going to say in tomorrow's paper." He grabs a piece of chalk off Morris's desk and writes "6th Victim" on one of the partitions. He throws the chalk at Morris and stamps out. Morris stares at the words for a moment, then he knocks on Lt. Dawson's door. "I've got an idea," he says. "It's kind of crazy, but it just might shake things up."Gill is seated at his grand piano, playing a lovely, peaceful melody. Mrs. Fitts brings in a vase filled with flowers. He asks her if his airline tickets have arrived, and she says yes. He tells her that the flowers are lovely. "Romance," he says, smiling a little as he plays..."Romance is the thing that makes men hold, and women bold, Mrs. Fitts." "If you read the papers, there isn't much love in them these days," she responds, stepping outside of her quiet, professional demeanor, for once. "Riots, and wars...and all these murders. It's getting so I don't dare set foot outside anymore. Imagine, Mr. Gill, one man killing six women!" "What do you mean?" says Gill, startled. "Here," she says, and hands him his paper. The headline reads "Sixth Victim". "Killed the same way as the others," she says, "with the lipstick across the forehead and everything." "Yes," he says, slowly, preoccupied, "yes. Uh, could I have my tea, now?" "Yes, of course...I'm sorry," she says, stepping back behind her mask, leaving him alone to contemplate this new development.He calls from a public phone booth. He tells Morris in his German accent that he didn't do it...he did NOT kill that woman. "Say you believe me," he says. "I can't say that, because I don't believe you," replies Morris. The detectives are standing around him, the tape is running. "It's a copycat," insists Gill. "I did everything up to now, and he comes along and wants to take credit, and it's not fair!" Morris, enjoying the upper hand for once, replies, "This is getting a little too weird for me, I think I'll hang up now." "Don't you hang up on me," hisses Gill, "or I'll kill a hundred women...I promise you that." He tries to calm down, so he can reason with Morris. "A little commons sense will tell you that it's a copycat. Did he call you on the phone? Did he tell you where the body was?" "Neither did you the first and fourth time," counters Morris. "But you forget," says Gill. "I've given you my word of honor that I'll stop." Morris murmurs, "For all that's worth." A uniformed officer enters the squad room and says, quietly, "Pan Am Building, downtown." The lieutenant and a couple of other detectives rush out. Gill continues to argue his innocence regarding the sixth victim...but Morris interrupts, saying, "This time we got a full description of you. You're very short...you have blonde hair...a wide nose...bushy eyebrows." Gill laughs, and says, "That's very funny, you see, because first of all I have brown hair, brown eyes, and I'm approximately six feet tall, and..." then, finally realizing, "...and you are clever. Oh, Mr. Brummel, you are very, very clever." He hangs up. "But you're not quite clever enough," he adds, and leaves the building...swiftly, but not hastily. Uniformed officers arrive shortly afterward, and round up a few suspects. But when Morris, Monaghan and Lt. Dawson arrive, it's obvious they didn't get the one they wanted.Morris and Kate arrive in the hallway just outside Morris's apartment. "Ok, I think I'm ready," says Kate. "But tell me, Morris, do you love me?" "Yes," he replies. "Madly, deeply? she asks. "Madly, deeply," he confirms. "Then I can move mountains," she says. He unlocks the door and they go inside. After introductions, Kate says to Mrs. Brummel, "It's such a pleasure to finally meet you...and to see your lovely home. Morris, look at this," she says, gesturing, "Isn't it wonderful? It's just so Jewish." Mrs. Brummel is rather flummoxed by this comment, not sure it's a compliment. "Jews always have the best apartments," explains Kate. "The best taste, the best apartments...it follows." "Are you Jewish?" asks Mrs. Brummel, brightening. "I have been studying to be Jewish since I was 14 years old," says Kate, as they move into the living room and sit down. "Off!" Kate exclaims suddenly. "What?" says Mrs. Brummel, startled. "Look at him," Kate gestures toward Morris. "He has his foot up on your coffee table. Off!" she orders, and he moves his foot. "Lummox," she murmurs. "Honestly, I don't know why I go out with him. On the money he makes we can't do anything. A Jewish cop, can you imagine anything so ridiculous?" "I keep telling him that!" says Mrs. Brummel, amazed. "Oh, but your son, Franklin," says Kate, with a smile. "I wish I'd met him before it was too late. With a son like him, you don't mind having this one so much. But he is good for one thing," she adds. "Morris, light my cigarette," she orders. He jumps to his feet, comes to stand in front of her, with his back to his mother. He gives her a faint, conspiratorial smile while he lights her cigarette. She smiles back, and blows him a secret little air-kiss. "Now, go away," she says. He walks dejectedly into the kitchen. "He's good for ordering around," says Kate to Mrs. Brummel, "for yelling at and ordering around." "He is," agrees Mrs. Brummel, delighted. "I can see we're the same person," says Kate. "Yes, we are," agrees Mrs. Brummel. "Would you excuse me a moment, please?" "Of course," says Kate. Mrs. Brummel slips into the kitchen and says to Morris, "That girl is a gem...a GEM! And you know something else? She reminds me of me." Kate breathes a long sigh of relief, and relaxes.Morris is waiting outside the lieutenant's office. Monaghan comes out, and Morris asks, "Well?" Monaghan replies, "He says the chief doesn't like it, the inspector doesn't like it, and he doesn't like it." Morris looks crestfallen. "But the commissioner..." continues Monaghan, and Morris looks up, hopeful... "The commissioner says we've got a phony body, we might as well have a phony suspect." Morris laughs and slaps Monaghan on the back. "When?" he asks. "It'll be in the papers tomorrow," Monaghan replies. "It better work this time." "It will, it will, you're such a worrier," replies Morris.Gill calls Morris again, from another public phone booth. He says in his German accent, "Morris, I'm glad I caught you...I'm relieved because I read in the newspaper about this William Gibson of Tudor City, and now we know he had nothing to do with the first five, but that he's definitely responsible for the sixth, so, at last! You know, I think its important that we get the facts straight..." Morris interrupts him to say, "You can forget the whole thing. We're letting him go. The evidence we had on him only ties up to the last killing." "Yes, I know," says Gill, impatiently, "but you can't let him go, and he goes out and copies me again." "I don't think so, Dorian," says Morris. "As far as I'm concerned, you've still got six." "That's a lie!" shouts Gill. "Oh, you're losing your temper, Dorian," taunts Morris. Then he says, "Oh, thank you, detective," to the air. "Word reaches me that he's already been released." "Released?!" says Gill, shocked. He hangs up. "Released," he murmurs, clearly shaken. "He hung up!" says Morris to Monaghan, with mock surprise. They've shaken up the Strangler again...perhaps he'll make another mistake.Kate is at home, studying up on Jewish food, history and culture. A man arrives outside her door, with a large, elaborate food-keeper. He rings the doorbell; she goes to answer, checking through the peephole first. Poor Kate, with her memory for names, not faces, doesn't recognize Father McDowell standing there in a maître d uniform. She opens the door, keeping it on the chain, and says, "Yes?" "Miss Kate Palmer?" he asks, and when she affirms that she is, he says, "I'm from the Italian restaurant around the corner, I was asked by Mr. Morris Brummel to bring this to you." "What is it?" she asks. "Well," he replies, "I have some nice homemade spaghetti, and veal piccata with a little lemon juice, a salad, and spumoni, and café expresso...and last but not least, Valpolicella wine. Mr. Brummel sends it all with his love and regret that the lady has to eat alone." "Morris?" she says, agreeably surprised. "I'll be damned." And she lets him in. He asks if he might use the table on the dais to serve her, and she agrees. He pulls out a chair for her, and she sits down. He puts his food-keeper down, and looks her over the way a wolf might look at a wandering lamb.Morris is at home, with reports and files from the case spread all over the table. Mrs. Brummel comes in with a tray and begins to clear them off, and they begin to wrangle over whether he will eat a meatloaf sandwich. The phone rings, Morris answers...it's Monaghan. He tells Morris that Gill called again. "Why didn't he call me?" asks Morris, puzzled. "He left a number where you could call him, if you want to talk to him," says Monaghan, "555-3810." "My God, that's Kate!" says Morris, his face turning sick. "I'll send a car," says Monaghan. "No, no...subway's faster," says Morris, "Get over there...go, go, go!" He grabs his coat and tells Mrs. Brummel, "Call Kate and tell her I'm on my way." She starts to sputter and he shouts, "Just CALL her!" and leaves on the run.Gill is serving the nice dinner to Kate. The phone rings and she stands up. "Don't answer it," orders Gill. "It might be important," she says and goes to the phone. "I said, don't answer it!" he shouts, and in two leaps he's at the phone plug, and rips it from the wall. She stares at him in shock, as the truth dawns on her. "Why me?" she asks, softly. "Why don't you ask him," he replies. She takes a step backward, and he takes two steps toward her...then they're both running...she for the door, and he after her. He catches her before she can get out, but she is able to get away from him twice. But the third time she goes back to the door, he finally gets a good grip on her, and clamps his hand over her nose and mouth. She slowly slides to the floor as she loses consciousness.Monaghan and the boys are at the outside door, ringing the buzzer frantically. The super admits them and they run to Kate's apartment. Gill comes out shortly after, wiping his hands, and walks hurriedly away. A policeman in a car spots him, and turns around to follow. Morris arrives at Kate's apartment. It looks very like the crime scenes of the other five victims, with officers, technicians, and reporters already on scene. He dashes to the bathroom...but she's not there. Monaghan comes out of another room, and beckons to him. He goes inside...Kate is lying on her bed, eyes closed, a damp cloth on her forehead. She opens her eyes and looks at him...she's all right, except for the Strangler's finger marks on her neck. He sits by her side, she caresses his face...he kisses her hand...and they embrace.Outside, Morris speaks with Monaghan and another detective, who reports that a man was seen and followed as far as 44th and Sixth. They have cars in the area looking for him. Morris and Monaghan go to join the manhunt. Gill knows the district well, and is able to stay ahead of them for a while. But he is seen going down the alley to his private entrance, and the officers converge on the theatre. They gain entry to the lobby, where they are calmly greeted by a man above suspicious: the theatre's well-known owner. They ask if he saw or heard anyone; he replies that, no, it's been very quiet. They ask if they can search the theatre. He consents, even offers to give them a little more light. They search the place from basement to roof, while he calmly watches. They return to the lobby, and admit they found nothing. He bids them good night. As they leave, Morris pauses in front of a large portrait of a middle-aged woman in period costume. It is one of several in the lobby, of the same woman in different period costumes. "Rather a striking portrait of my mother, don't you think?" asks Gill. "Did you ever see her on stage?" "No," says Morris, "I missed that." "You missed something," Gill says softly, with pride. He watches the officers leave, then glances back at the portrait of his mother. The camera zooms in on her full, red, "Cupid's Bow" lips.Gill is in his office, drinking a toast to his mother. He stands in front of a bust of her, and recites her speech from Antony and Cleopatra, rapturously, with closed eyes. When he finishes, he looks up to Morris watching him from the doorway. "You surprise me," he says, "I thought you and I were finished." Morris replies, "We haven't even started." Gill tries to bluff his way through...but Morris has put the pieces together. He points out Gill's acess to a wardrobe department, and his penchant for accents. He taunts him about his mother, wonders what she really thought of him...and what she'd have thought of a freak that strangles women? He picks up a picture of Gill's mother from Gill's desk, and continues, "They all had the lipstick, didn't they? The very shape of your dear mother's lips. The very lips on all those portraits out in your lobby!" Morris asks for the key to the wardrobe department. "I don't have to give it to you," says Gill. "No," agrees Morris. "we can come back for it." "I don't want YOU to come back," says Gill, petulantly. He goes to the cupboard where the keys are kept. He holds the key out, Morris takes it and leaves the office.Morris goes downstairs to the stage level and down another set of stairs that goes under the stage. Gill watches from a window in his office, then takes his elevator to the stage level. He turns off all the lights, leaving only an eerie red glow from the exit signs. Morris realizes his danger, and comes up from beneath the stage with his gun drawn. As he moves cautiously across the stage, he is almost crushed by a heavy scenery flat, then nearly beaned by a light frame released from above. He sees a figure running in the red glow, and fires his gun at it. He glances behind him, and turns back in time to get a sandbag counterweight in the face, which knocks him out cold. A spotlight comes up and focuses on the stage. Gill staggers into the light, staggering, holding his side, which is bloody. He nearly falls, grabs hold of the counterweight rope and eases himself down to the stage. He drags himself over to where Morris is lying, and grabs Morris's gun. He lies there for a moment, his head resting on Morris's stomach. "Mr. Brummel, you're a better shot than I thought you were," he murmurs. He finally pulls himself up to a standing position, and looks out into the empty theatre. Hallucinating, he sees Mrs. Mulloy, there...and shouts at her in Father McDowell's voice. He also sees Mrs. Himmel, and addresses her in Hans Schultz's voice, punctuating his final soliliquy by firing shots into the air from Morris's gun. He slips on his own blood, and falls back on the stage. "Oh, help!" he murmurs...then in Dorian's voice he pleads, "Sweet Jesus...save me." He looks around for Morris, who has regained consciousness and is now standing among the empty audience seats, watching Gill, his expression impassive. "Mr. Brummel, do me a favor," says Gill, "Forgive me." Morris's expression doesn't change...no forgiveness here. "Puh-leeeeeeeze," begs Gill. Then he covers his face, and with a last, sobbing breath, dies. Monaghan and the other officers file back into the theatre and move up onto the stage. Morris turns and walks out of the theatre. In the lobby, he pauses between two of Gill's mother's portraits to look back into the theatre, at the last scene being played out on the stage. Then he goes out of the theatre altogether, onto the street, into the early morning light."
],
"summaries": [
"A crafty serial killer plays a game of cat-and-mouse with a harried police detective trying to track him down."
,
"Christopher Gill is a psychopathic killer who uses various disguises to trick and strangle his victims. Moe Brummel is a single and harassed New York City police detective who starts to get phone calls from the strangler and builds a strange alliance as a result. Kate Palmer is a swinging, hip tour guide who witnesses the strangler leaving her dead neighbor's apartment and sets her sights on the detective. Moe's live-in mother wishes her son would be a successful Jewish doctor like his big brother."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "Ni_NAIUBmFo8GYv0bnQr",
"_score": 7.838374,
"_source": {
"title": "A Tale of Two Cities",
"year": 1980,
"genders": [
"Drama"
,
"History"
,
"Romance"
],
"score": 6.6,
"directors": [
"Jim Goddard"
],
"writers": [
"Charles Dickens"
,
"John Gay"
],
"synopsis": [ ],
"summaries": [
"An ex-aristocrat from France and an alcoholic English lawyer find themselves crossing paths and in love with the same woman during the French Revolution."
,
"Dissolute barrister Sydney Carton (Chris Sarandon) becomes enchanted and then hopelessly in love with the beautiful Lucie Manette (Alice Krige). But Lucie loves and marries Charles Darnay (Chris Sarandon), and remains oblivious to Carton's undimmed devotion to her. When Darnay is ensnared in the deadly web of the French Revolution and condemned to die by the guillotine, Sydney Carton concocts a dangerous plot to free the husband of the woman he loves."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "VS_NAIUBmFo8GYv0bowz",
"_score": 7.838374,
"_source": {
"title": "That Evening Sun",
"year": 2009,
"genders": [
"Drama"
],
"score": 7,
"directors": [
"Scott Teems"
],
"writers": [
"Scott Teems"
,
"William Gay"
],
"synopsis": [ ],
"summaries": [
"An aging Tennessee farmer returns to his homestead and must confront a family betrayal, the reappearance of an old enemy, and the loss of his farm."
,
"An aging farmer fights to keep the home that is rightfully his after fleeing from a nursing home and discovering that his son has leased the family farm to his old nemesis. Placed in a nursing home by his son and promptly forgotten, Abner Meecham (Hal Holbrook) realized that waiting to die was no way to live. Determined to enjoy his last days, Abner packed his bags and set his sights on the family farm. At least there he could die on his own land, in familiar surroundings. But Abner is in for a rude awakening, because upon returning home he discovers that his son has leased the farm to Lonzo Choat. Abner never cared much for Lonzo, and when Lonzo refuses to leave, Abner takes up residence in an old tenant shack on the property. Before long, their dispute becomes volatile, each man believing himself to be in the right, and refusing to back down from his position. Betrayed by his son and haunted by dreams of his beloved deceased wife, Abner draws a line in the sand in an attempt to reclaim his life. As threats are made and tension begins to brew, it's only a matter of time before the situation turns savage."
]
}
}
,
{
"_index": "movies",
"_type": "docs",
"_id": "NS_NAIUBmFo8GYv0bnUr",
"_score": 7.7662044,
"_source": {
"title": "Liquid Sky",
"year": 1982,
"genders": [
"Sci-Fi"
,
"Thriller"
],
"score": 6,
"directors": [
"Slava Tsukerman"
],
"writers": [
"Slava Tsukerman"
,
"Anne Carlisle"
,
"Nina V. Kerova"
],
"synopsis": [ ],
"summaries": [
"A small, heroin seeking UFO lands on a Manhattan roof, observes a bizarre, drug addicted fashion model and sucks endorphin from her sexual encounters' brains."
,
"Invisible aliens in a tiny flying saucer come to Earth looking for heroin. They land on top of a New York apartment inhabited by a drug dealer and her androgynous, bisexual nymphomaniac lover, who's also a fashion model. The aliens soon find the human pheromones created in the brain during orgasm preferable to heroin, and the model's casual sex partners begin disappearing. This increasingly bizarre scenario's observed by a lonely woman in the building across the street, a German scientist who's following the aliens, and an equally androgynous, drug-addicted male model (both models are played by Anne Carlisle). Darkly funny and thoroughly weird."
,
"In New Yor City's East Village, a small flying saucer lands on the roof, seeking heroin. In the apartment, the cocaine addicted model, Margaret's an androgynous, promiscuous, bisexual modell llives with her lover, the drug dealer Adrian. Margaret has sex with many partners in exchange for drugs. The aliens discover the sensation of orgasm's equivalent to heroin, and they suck the brains from Margaret's lovers, killing them first, then making their bodies disappear. Meanwhile, a German scientist's chasing the ETs, and watches the goings on from a building across from Margaret's."
,
"Downtown NYC fashion model, Margaret seeks fame, but who's in accordance codependent drug-fuelled relationship with her dealer/girlfriend.. Afterhaving sec with a man who printed get coke., he vanishes into thin air, and she soon realises that a mysterious force is killing everyone who has sex with her. Not knowing our carrying how our why, Margaret sets out to use this for revenge Meanwhile, a German scientist who knows what's going on; aliens who feed on heron find the same effect from human endorphins released during pleasure, and he attempts to warn her that she, too is in danger."
]
}
}
]
},
"aggregations": {
"year_duplicate": {
"doc_count_error_upper_bound": 0,
"sum_other_doc_count": 13,
"buckets": [
{
"key": 2009,
"doc_count": 24
}
,
{
"key": 2007,
"doc_count": 22
}
,
{
"key": 2006,
"doc_count": 17
}
,
{
"key": 2011,
"doc_count": 15
}
,
{
"key": 2012,
"doc_count": 15
}
,
{
"key": 2001,
"doc_count": 13
}
,
{
"key": 2014,
"doc_count": 13
}
,
{
"key": 2004,
"doc_count": 12
}
,
{
"key": 2005,
"doc_count": 12
}
,
{
"key": 2013,
"doc_count": 12
}
,
{
"key": 1998,
"doc_count": 11
}
,
{
"key": 1999,
"doc_count": 11
}
,
{
"key": 2010,
"doc_count": 11
}
,
{
"key": 1968,
"doc_count": 10
}
,
{
"key": 1996,
"doc_count": 10
}
,
{
"key": 2008,
"doc_count": 10
}
,
{
"key": 2015,
"doc_count": 10
}
,
{
"key": 1995,
"doc_count": 9
}
,
{
"key": 2002,
"doc_count": 9
}
,
{
"key": 2000,
"doc_count": 7
}
,
{
"key": 1970,
"doc_count": 6
}
,
{
"key": 1980,
"doc_count": 6
}
,
{
"key": 1971,
"doc_count": 5
}
,
{
"key": 1983,
"doc_count": 5
}
,
{
"key": 2003,
"doc_count": 5
}
,
{
"key": 1976,
"doc_count": 4
}
,
{
"key": 1984,
"doc_count": 4
}
,
{
"key": 1992,
"doc_count": 4
}
,
{
"key": 1997,
"doc_count": 4
}
,
{
"key": 2016,
"doc_count": 4
}
,
{
"key": 1972,
"doc_count": 3
}
,
{
"key": 1979,
"doc_count": 3
}
,
{
"key": 1981,
"doc_count": 3
}
,
{
"key": 1982,
"doc_count": 3
}
,
{
"key": 1994,
"doc_count": 3
}
,
{
"key": 1945,
"doc_count": 2
}
,
{
"key": 1947,
"doc_count": 2
}
,
{
"key": 1964,
"doc_count": 2
}
,
{
"key": 1966,
"doc_count": 2
}
,
{
"key": 1967,
"doc_count": 2
}
,
{
"key": 1969,
"doc_count": 2
}
,
{
"key": 1977,
"doc_count": 2
}
,
{
"key": 1987,
"doc_count": 2
}
,
{
"key": 1989,
"doc_count": 2
}
,
{
"key": 1990,
"doc_count": 2
}
,
{
"key": 1991,
"doc_count": 2
}
,
{
"key": 1993,
"doc_count": 2
}
,
{
"key": 1903,
"doc_count": 1
}
,
{
"key": 1930,
"doc_count": 1
}
,
{
"key": 1933,
"doc_count": 1
}
]
}
}
}
